<!DOCTYPE html>
    <html lang="zh-cn">
    <head>
    <meta charset="utf-8"/>
    <title>
    <meta name="authors" content="" />ANT十五大最佳实践[转]</title></head><body>From:<a href=http://www.cnblogs.com/itech/archive/2010/10/28/1863699.html#FeedBack>http://www.cnblogs.com/itech/archive/2010/10/28/1863699.html#FeedBack</a><br><br><div><h2><strong>ANT</strong><strong>&#21313;&#20116;&#22823;&#26368;&#20339;&#23454;&#36341;</strong></h2>&#13;
<p>&#36716;&#33258;&#65306;<a href="http://oreilly.com.cn/news/ant15toppractices.php?c=java">http://oreilly.com.cn/news/ant15toppractices.php?c=java</a></p>&#13;
<p>&#160;</p>&#13;
<p>&#20316;&#32773;&#65306;<a href="http://www.onjava.com/pub/au/110">Eric M. Burke</a>, coauthor of <a href="http://www.oreilly.com/catalog/jextprockbk/index.html?CMP=IL7015">Java Extreme Programming Cookbook</a></p>&#13;
<p>&#21407;&#25991;&#65306;<a href="http://www.onjava.com/pub/a/onjava/2003/12/17/ant_bestpractices.html">http://www.onjava.com/pub/a/onjava/2003/12/17/ant_bestpractices.html</a></p>&#13;
<p>&#35793;&#32773;&#65306;&#24464;&#24420;<a href="http://www.cnblogs.com/itech/admin/msn:xt121@hotmail.com">http://www.cnblogs.com/itech/admin/msn:xt121@hotmail.com</a></p>&#13;
<p>&#160;</p>&#13;
<p>&#22312;Ant&#20986;&#29616;&#20043;&#21069;&#65292;&#26500;&#24314;&#21644;&#37096;&#32626;Java&#24212;&#29992;&#38656;&#35201;&#20351;&#29992;&#21253;&#25324;&#29305;&#23450;&#24179;&#21488;&#30340;&#33050;&#26412;&#12289;Make&#25991;&#20214;&#12289;&#21508;&#31181;&#29256;&#26412;&#30340;IDE&#29978;&#33267;&#25163;&#24037;&#25805;&#20316;&#30340;&#8220;&#22823;&#26434;&#28905;&#8221;&#12290;&#29616;&#22312;&#65292;&#20960;&#20046;&#25152;&#26377;&#30340;&#24320;&#28304;Java&#39033;&#30446;&#37117;&#22312;&#20351;&#29992;Ant&#65292;&#22823;&#22810;&#25968;&#20844;&#21496;&#30340;&#20869;&#37096;&#39033;&#30446;&#20063;&#22312;&#20351;&#29992;Ant&#12290;Ant&#22312;&#36825;&#20123;&#39033;&#30446;&#20013;&#30340;&#24191;&#27867;&#20351;&#29992;&#33258;&#28982;&#23548;&#33268;&#20102;&#35835;&#32773;&#23545;&#19968;&#25972;&#22871;Ant&#26368;&#20339;&#23454;&#36341;&#30340;&#36843;&#20999;&#38656;&#27714;&#12290;</p>&#13;
<p>&#26412;&#25991;&#24635;&#32467;&#20102;&#25105;&#21916;&#29233;&#30340;Ant&#25216;&#24039;&#25110;&#26368;&#20339;&#23454;&#36341;&#65292;&#22810;&#25968;&#26159;&#20174;&#25105;&#20146;&#36523;&#32463;&#21382;&#30340;&#39033;&#30446;&#38169;&#35823;&#25110;&#25105;&#21548;&#35828;&#30340;&#20854;&#20182;&#20154;&#32463;&#21382;&#30340; &#8220;&#24656;&#24598;&#8221;&#25925;&#20107;&#20013;&#24471;&#21040;&#28789;&#24863;&#30340;&#12290;&#27604;&#22914;&#65292;&#26377;&#20154;&#21578;&#35785;&#25105;&#26377;&#20010;&#39033;&#30446;&#25226;XDoclet &#29983;&#25104;&#30340;&#20195;&#30721;&#25918;&#20837;&#24102;&#26377;&#38145;&#23450;&#25991;&#20214;&#21151;&#33021;&#30340;&#29256;&#26412;&#25511;&#21046;&#24037;&#20855;&#20013;&#12290;&#24403;&#24320;&#21457;&#32773;&#20462;&#25913;&#28304;&#20195;&#30721;&#26102;&#65292;&#20182;&#24517;&#39035;&#35760;&#20303;&#25163;&#24037;&#26816;&#20986;&#65288;Check out&#65289;&#24182;&#38145;&#23450;&#25152;&#26377;&#23558;&#35201;&#37325;&#26032;&#29983;&#25104;&#30340;&#25991;&#20214;&#12290;&#28982;&#21518;&#65292;&#25163;&#24037;&#36816;&#34892;&#20195;&#30721;&#29983;&#25104;&#22120;&#65292;&#21482;&#21040;&#36825;&#26102;&#20182;&#25165;&#33021;&#22815;&#35753;Ant&#32534;&#35793;&#20195;&#30721;&#65292;&#36825;&#19968;&#26041;&#27861;&#36824;&#23384;&#22312;&#22914;&#19979;&#19968;&#20123;&#38382;&#39064;&#65306;</p>&#13;
<ul><li>&#29983;&#25104;&#30340;&#20195;&#30721;&#26080;&#27861;&#23384;&#20648;&#22312;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#20013;&#12290;</li><li>Ant&#65288;&#26412;&#26696;&#20363;&#20013;&#26159;Xdoclet&#65289;&#24212;&#35813;&#33258;&#21160;&#30830;&#23450;&#19979;&#19968;&#27425;&#26500;&#24314;&#28041;&#21450;&#30340;&#28304;&#25991;&#20214;&#65292;&#32780;&#19981;&#24212;&#30001;&#31243;&#24207;&#21592;&#25163;&#24037;&#30830;&#23450;&#12290;</li><li>Ant&#30340;&#26500;&#24314;&#25991;&#20214;&#24212;&#35813;&#23450;&#20041;&#22909;&#27491;&#30830;&#30340;&#20219;&#21153;&#20381;&#36182;&#20851;&#31995;&#65292;&#36825;&#26679;&#31243;&#24207;&#21592;&#23601;&#19981;&#24517;&#20026;&#20102;&#23436;&#25104;&#26500;&#24314;&#32780;&#19981;&#24471;&#19981;&#25353;&#29031;&#29305;&#23450;&#39034;&#24207;&#35843;&#29992;&#20219;&#21153;&#12290; </li></ul>&#13;
<p>&#24403;&#25105;&#24320;&#22987;&#19968;&#20010;&#26032;&#39033;&#30446;&#26102;&#65292;&#25105;&#39318;&#20808;&#32534;&#20889;Ant&#26500;&#24314;&#25991;&#20214;&#12290;Ant&#25991;&#20214;&#26126;&#30830;&#22320;&#23450;&#20041;&#26500;&#24314;&#30340;&#36807;&#31243;&#65292;&#24182;&#34987;&#22242;&#38431;&#20013;&#30340;&#27599;&#20010;&#31243;&#24207;&#21592;&#20351;&#29992;&#12290;&#26412;&#25991;&#25152;&#21015;&#30340;&#25216;&#24039;&#22522;&#20110;&#36825;&#26679;&#30340;&#20551;&#23450;&#65306;Ant&#26500;&#24314;&#25991;&#20214;&#26159;&#19968;&#20010;&#24517;&#39035;&#20180;&#32454;&#32534;&#20889;&#30340;&#37325;&#35201;&#25991;&#20214;&#65292;&#23427;&#24212;&#22312;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#20013;&#24471;&#21040;&#32500;&#25252;&#65292;&#24182;&#34987;&#23450;&#26399;&#36827;&#34892;&#37325;&#26500;&#12290;&#19979;&#38754;&#26159;&#25105;&#30340;&#21313;&#20116;&#22823;Ant&#26368;&#20339;&#23454;&#36341;&#12290;</p>&#13;
<h3>1. &#37319;&#29992;&#19968;&#33268;&#30340;&#32534;&#30721;&#35268;&#33539;</h3>&#13;
<p>Ant&#29992;&#25143;&#26377;&#30340;&#21916;&#27426;&#26377;&#30340;&#30171;&#24680;&#20854;&#26500;&#24314;&#25991;&#20214;&#30340;XML&#35821;&#27861;&#12290;&#19982;&#20854;&#36339;&#36827;&#36825;&#19968;&#20196;&#20154;&#36855;&#24785;&#30340;&#20105;&#35770;&#20013;&#65292;&#19981;&#22914;&#35753;&#25105;&#20204;&#20808;&#30475;&#19968;&#20123;&#33021;&#20445;&#25345;XML&#26500;&#24314;&#25991;&#20214;&#31616;&#27905;&#30340;&#26041;&#27861;&#12290;</p>&#13;
<p>&#39318;&#20808;&#20063;&#26159;&#26368;&#37325;&#35201;&#30340;&#65292;&#33457;&#36153;&#26102;&#38388;&#26684;&#24335;&#21270;&#20320;&#30340;XML&#35753;&#23427;&#30475;&#19978;&#21435;&#24456;&#28165;&#26224;&#12290;&#19981;&#35770;XML&#26159;&#21542;&#32654;&#35266;&#65292;Ant&#37117;&#21487;&#20197;&#24037;&#20316;&#12290;&#20294;&#26159;&#19985;&#38475;&#30340;XML&#24456;&#38590;&#20196;&#20154;&#35835;&#25026;&#12290;&#20504;&#33509;&#20320;&#22312;&#20219;&#21153;&#20043;&#38388;&#30041;&#20986;&#31354;&#34892;&#65292;&#26377;&#35268;&#21017;&#30340;&#32553;&#36827;&#65292;&#27599;&#34892;&#25991;&#23383;&#19981;&#36229;&#36807;90&#21015;&#24038;&#21491;&#65292;&#37027;&#20040;XML&#20196;&#20154;&#24778;&#35766;&#22320;&#26131;&#35835;&#12290;&#20877;&#21152;&#19978;&#20351;&#29992;&#33021;&#22815;&#39640;&#20142;XML&#35821;&#27861;&#30340;&#20248;&#31168;&#32534;&#36753;&#22120;&#25110;IDE&#24037;&#20855;&#65292;&#20320;&#23601;&#19981;&#20250;&#26377;&#38405;&#35835;&#30340;&#40635;&#28902;&#12290;</p>&#13;
<p>&#21516;&#26679;&#65292;&#31934;&#36873;&#21547;&#24847;&#26126;&#30830;&#12289;&#23481;&#26131;&#35835;&#25026;&#30340;&#35789;&#27719;&#26469;&#21629;&#21517;&#20219;&#21153;&#21644;&#23646;&#24615;&#12290;&#27604;&#22914;&#65292;dir.reports&#23601;&#27604;rpts&#22909;&#12290;&#29305;&#23450;&#30340;&#32534;&#30721;&#35268;&#33539;&#24182;&#19981;&#37325;&#35201;&#65292;&#21482;&#35201;&#25343;&#20986;&#19968;&#22871;&#35268;&#33539;&#24182;&#22362;&#25345;&#20351;&#29992;&#23601;&#34892;&#12290;</p>&#13;
<h3>2. &#23558;build.xml&#25918;&#22312;&#39033;&#30446;&#26681;&#30446;&#24405;&#20013;</h3>&#13;
<p>Ant&#26500;&#24314;&#25991;&#20214;build.xml&#21487;&#20197;&#25918;&#22312;&#20219;&#20309;&#20301;&#32622;&#65292;&#20294;&#26159;&#25918;&#22312;&#39033;&#30446;&#39030;&#32423;&#30446;&#24405;&#20013;&#21487;&#20197;&#20445;&#25345;&#39033;&#30446;&#31616;&#27905;&#12290;&#36825;&#26159;&#26368;&#24120;&#29992;&#30340;&#35268;&#33539;&#65292;&#24320;&#21457;&#32773;&#33021;&#22815;&#22312;&#39030;&#32423;&#30446;&#24405;&#20013;&#25214;&#21040;&#39044;&#26399;&#30340;build.xml&#12290;&#25226;&#26500;&#24314;&#25991;&#20214;&#25918;&#22312;&#26681;&#30446;&#24405;&#20013;&#65292;&#20063;&#33021;&#22815;&#20351;&#20154;&#23481;&#26131;&#20102;&#35299;&#39033;&#30446;&#30446;&#24405;&#26641;&#20013;&#19981;&#21516;&#30446;&#24405;&#20043;&#38388;&#30340;&#36923;&#36753;&#20851;&#31995;&#12290;&#20197;&#19979;&#26159;&#19968;&#20010;&#20856;&#22411;&#30340;&#39033;&#30446;&#30446;&#24405;&#23618;&#27425;&#65306;</p>&#13;
<p>[root dir]<br>&#160; | build.xml&#160; <br>&#160; +--src&#160;<br>&#160; +--lib (&#21253;&#21547;&#31532;&#19977;&#26041; JAR&#21253;)&#160;<br>&#160; +--build (&#30001; build&#20219;&#21153;&#29983;&#25104;)&#160; <br>&#160; +--dist (&#30001; build&#20219;&#21153;&#29983;&#25104;) </p>&#13;
<p>&#24403;build.xml&#22312;&#39030;&#32423;&#30446;&#24405;&#26102;&#65292;&#20551;&#35774;&#20320;&#22788;&#20110;&#39033;&#30446;&#26576;&#20010;&#23376;&#30446;&#24405;&#20013;&#65292;&#21482;&#35201;&#36755;&#20837;&#65306;ant -find compile &#21629;&#20196;&#65292;&#19981;&#38656;&#35201;&#25913;&#21464;&#24037;&#20316;&#30446;&#24405;&#23601;&#33021;&#22815;&#20197;&#21629;&#20196;&#34892;&#26041;&#24335;&#32534;&#35793;&#20195;&#30721;&#12290;&#21442;&#25968;-find&#21578;&#35785;Ant&#23547;&#25214;&#23384;&#22312;&#20110;&#19978;&#32423;&#30446;&#24405;&#20013;&#30340;build.xml&#24182;&#25191;&#34892;&#12290;</p>&#13;
<h3>3. &#20351;&#29992;&#21333;&#19968;&#30340;&#26500;&#24314;&#25991;&#20214;</h3>&#13;
<p>&#26377;&#20154;&#21916;&#27426;&#23558;&#19968;&#20010;&#22823;&#39033;&#30446;&#20998;&#35299;&#25104;&#20960;&#20010;&#23567;&#30340;&#26500;&#24314;&#25991;&#20214;&#65292;&#27599;&#20010;&#26500;&#24314;&#25991;&#20214;&#20998;&#25285;&#25972;&#20010;&#26500;&#24314;&#36807;&#31243;&#30340;&#19968;&#23567;&#37096;&#20998;&#24037;&#20316;&#12290;&#36825;&#30830;&#23454;&#26159;&#30475;&#27861;&#19981;&#21516;&#30340;&#38382;&#39064;&#65292;&#20294;&#26159;&#24212;&#35813;&#35748;&#35782;&#21040;&#65292;&#23558;&#26500;&#24314;&#25991;&#20214;&#20998;&#21106;&#20250;&#22686;&#21152;&#23545;&#25972;&#20307;&#26500;&#24314;&#36807;&#31243;&#30340;&#29702;&#35299;&#38590;&#24230;&#12290;&#35201;&#27880;&#24847;&#22312;&#21333;&#19968;&#26500;&#24314;&#25991;&#20214;&#33021;&#22815;&#28165;&#26970;&#34920;&#29616;&#26500;&#24314;&#23618;&#27425;&#30340;&#24773;&#20917;&#19979;&#19981;&#35201;&#36807;&#24037;&#31243;&#21270;(over-engineer)&#12290;</p>&#13;
<p>&#21363;&#20351;&#20320;&#25226;&#39033;&#30446;&#21010;&#20998;&#20026;&#22810;&#20010;&#26500;&#24314;&#25991;&#20214;&#65292;&#20063;&#24212;&#20351;&#31243;&#24207;&#21592;&#33021;&#22815;&#22312;&#39033;&#30446;&#26681;&#30446;&#24405;&#19979;&#25214;&#21040;&#26680;&#24515;build.xml&#12290;&#23613;&#31649;&#35813;&#25991;&#20214;&#21482;&#26159;&#23558;&#23454;&#38469;&#26500;&#24314;&#24037;&#20316;&#22996;&#27966;&#32473;&#19979;&#32423;&#26500;&#24314;&#25991;&#20214;&#65292;&#20063;&#24212;&#20445;&#35777;&#35813;&#25991;&#20214;&#21487;&#29992;&#12290;</p>&#13;
<h3>4. &#25552;&#20379;&#33391;&#22909;&#30340;&#24110;&#21161;&#35828;&#26126;</h3>&#13;
<p>&#24212;&#23613;&#37327;&#20351;&#26500;&#24314;&#25991;&#20214;&#33258;&#25991;&#26723;&#21270;&#12290;&#22686;&#21152;&#20219;&#21153;&#25551;&#36848;&#26159;&#26368;&#31616;&#21333;&#30340;&#26041;&#27861;&#12290;&#24403;&#20320;&#36755;&#20837;ant -projecthelp&#26102;&#65292;&#20320;&#23601;&#21487;&#20197;&#30475;&#21040;&#24102;&#26377;&#25551;&#36848;&#30340;&#20219;&#21153;&#28165;&#21333;&#12290;&#27604;&#22914;&#65292;&#20320;&#21487;&#20197;&#36825;&#26679;&#23450;&#20041;&#20219;&#21153;&#65306;</p>&lt;target name="compile" &#160;<br>&#160;&#160; description="Compiles code, output goes to the build dir."&gt; &#13;
<p>&#26368;&#31616;&#21333;&#30340;&#35268;&#21017;&#26159;&#25226;&#25152;&#26377;&#20320;&#24819;&#35753;&#31243;&#24207;&#21592;&#36890;&#36807;&#21629;&#20196;&#34892;&#23601;&#21487;&#20197;&#35843;&#29992;&#30340;&#20219;&#21153;&#37117;&#21152;&#19978;&#25551;&#36848;&#12290;&#23545;&#20110;&#19968;&#33324;&#29992;&#26469;&#25191;&#34892;&#20013;&#38388;&#22788;&#29702;&#36807;&#31243;&#30340;&#20869;&#37096;&#20219;&#21153;&#65292;&#27604;&#22914;&#29983;&#25104;&#20195;&#30721;&#25110;&#24314;&#31435;&#36755;&#20986;&#30446;&#24405;&#31561;&#65292;&#23601;&#26080;&#27861;&#20351;&#29992;&#25551;&#36848;&#23646;&#24615;&#12290;</p>&#13;
<p>&#36825;&#26102;&#65292;&#21487;&#20197;&#36890;&#36807;&#22312;&#26500;&#24314;&#25991;&#20214;&#20013;&#21152;&#20837;XML&#27880;&#37322;&#26469;&#22788;&#29702;&#12290;&#25110;&#32773;&#19987;&#38376;&#23450;&#20041;&#19968;&#20010;help&#20219;&#21153;&#65292;&#24403;&#31243;&#24207;&#21592;&#36755;&#20837;ant help&#26102;&#26469;&#26174;&#31034;&#35814;&#32454;&#30340;&#20351;&#29992;&#35828;&#26126;&#12290;</p>&lt;target name="help" description="Display detailed usage information"&gt;<br>&#160; &lt;echo&gt;Detailed help...&lt;/echo&gt;&lt;/target&gt; &#13;
<h3>5. &#25552;&#20379;&#28165;&#38500;&#20219;&#21153;</h3>&#13;
Detailed help...<p>&#27599;&#20010;&#26500;&#24314;&#25991;&#20214;&#37117;&#24212;&#21253;&#21547;&#19968;&#20010;&#28165;&#38500;&#20219;&#21153;&#65292;&#29992;&#26469;&#21024;&#38500;&#25152;&#26377;&#29983;&#25104;&#30340;&#25991;&#20214;&#21644;&#30446;&#24405;&#65292;&#20351;&#31995;&#32479;&#22238;&#21040;&#26500;&#24314;&#25991;&#20214;&#25191;&#34892;&#21069;&#30340;&#21021;&#22987;&#29366;&#24577;&#12290;&#25191;&#34892;&#28165;&#31354;&#20219;&#21153;&#21518;&#36824;&#23384;&#22312;&#30340;&#25991;&#20214;&#37117;&#24212;&#22788;&#22312;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#30340;&#31649;&#29702;&#20043;&#19979;&#12290;&#27604;&#22914;&#65306;</p>&lt;target name="clean" <br>&#160;&#160;&#160;&#160;description="Destroys all generated files and dirs."&gt;<br>&#160; &lt;delete dir="${dir.build}"/&gt;<br>&#160; &lt;delete dir="${dir.dist}"/&gt;<br>&lt;/target&gt; &#13;
<p>&#38500;&#38750;&#26159;&#22312;&#20135;&#29983;&#25972;&#20010;&#31995;&#32479;&#29256;&#26412;&#30340;&#29305;&#27530;&#20219;&#21153;&#20013;&#65292;&#21542;&#21017;&#19981;&#35201;&#33258;&#21160;&#35843;&#29992;clean&#20219;&#21153;&#12290;&#24403;&#31243;&#24207;&#21592;&#20165;&#20165;&#25191;&#34892;&#32534;&#35793;&#20219;&#21153;&#25110;&#20854;&#20182;&#20219;&#21153;&#26102;&#65292;&#20182;&#20204;&#19981;&#38656;&#35201;&#26500;&#24314;&#25991;&#20214;&#20107;&#20808;&#25191;&#34892;&#26082;&#20196;&#20154;&#35752;&#21388;&#21448;&#27809;&#26377;&#24517;&#35201;&#30340;&#28165;&#31354;&#20219;&#21153;&#12290;&#35201;&#30456;&#20449;&#31243;&#24207;&#21592;&#33021;&#22815;&#30830;&#23450;&#20309;&#26102;&#38656;&#35201;&#28165;&#31354;&#25152;&#26377;&#25991;&#20214;&#12290;</p>&#13;
<h3>6. &#20351;&#29992;ANT&#31649;&#29702;&#20219;&#21153;&#20174;&#23646;&#20851;&#31995;</h3>&#13;
<p>&#20551;&#35774;&#20320;&#30340;&#24212;&#29992;&#30001;Swing GUI&#32452;&#20214;&#12289;Web&#30028;&#38754;&#12289;EJB&#23618;&#21644;&#20844;&#20849;&#24212;&#29992;&#20195;&#30721;&#32452;&#25104;&#12290;&#22312;&#22823;&#22411;&#31995;&#32479;&#20013;&#65292;&#20320;&#38656;&#35201;&#28165;&#26224;&#22320;&#23450;&#20041;&#27599;&#20010;Java&#21253;&#23646;&#20110;&#31995;&#32479;&#30340;&#21738;&#19968;&#23618;&#12290;&#21542;&#21017;&#20219;&#20309;&#19968;&#28857;&#20462;&#25913;&#37117;&#35201;&#34987;&#36843;&#37325;&#26032;&#32534;&#35793;&#25104;&#30334;&#19978;&#21315;&#20010;&#25991;&#20214;&#12290;&#31967;&#31957;&#30340;&#20219;&#21153;&#20174;&#23646;&#20851;&#31995;&#31649;&#29702;&#20250;&#23548;&#33268;&#36807;&#24230;&#22797;&#26434;&#32780;&#33030;&#24369;&#30340;&#31995;&#32479;&#12290;&#25913;&#21464;GUI&#38754;&#26495;&#30340;&#35774;&#35745;&#19981;&#24212;&#36896;&#25104;Servlet&#21644;EJB&#30340;&#37325;&#32534;&#35793;&#12290;</p>&#13;
<p>&#24403;&#31995;&#32479;&#21464;&#24471;&#24222;&#22823;&#21518;&#65292;&#31245;&#19981;&#27880;&#24847;&#23601;&#21487;&#33021;&#23558;&#20381;&#36182;&#20110;&#23458;&#25143;&#31471;&#30340;&#20195;&#30721;&#24341;&#20837;&#21040;&#26381;&#21153;&#31471;&#12290;&#36825;&#26159;&#22240;&#20026;&#20856;&#22411;&#30340;IDE&#39033;&#30446;&#25991;&#20214;&#32534;&#35793;&#20219;&#20309;&#25991;&#20214;&#37117;&#20351;&#29992;&#21333;&#19968;&#30340;classpath&#12290;&#32780;Ant&#33021;&#35753;&#20320;&#26356;&#26377;&#25928;&#22320;&#25511;&#21046;&#26500;&#24314;&#27963;&#21160;&#12290;</p>&#13;
<p>&#35774;&#35745;&#20320;&#30340;Ant&#26500;&#24314;&#25991;&#20214;&#32534;&#35793;&#22823;&#22411;&#39033;&#30446;&#30340;&#27493;&#39588;&#65306;&#39318;&#20808;&#65292;&#32534;&#35793;&#20844;&#20849;&#24212;&#29992;&#20195;&#30721;&#65292;&#23558;&#32534;&#35793;&#32467;&#26524;&#25171;&#25104;JAR&#21253;&#25991;&#20214;&#12290;&#28982;&#21518;&#65292;&#32534;&#35793;&#19978;&#19968;&#23618;&#30340;&#39033;&#30446;&#20195;&#30721;&#65292;&#32534;&#35793;&#26102;&#20381;&#38752;&#31532;&#19968;&#27493;&#20135;&#29983;&#30340;JAR&#25991;&#20214;&#12290;&#19981;&#26029;&#37325;&#22797;&#36825;&#19968;&#36807;&#31243;&#65292;&#30452;&#21040;&#26368;&#39640;&#23618;&#30340;&#20195;&#30721;&#32534;&#35793;&#23436;&#25104;&#12290;</p>&#13;
<p>&#20998;&#27493;&#26500;&#24314;&#24378;&#21270;&#20102;&#20219;&#21153;&#20174;&#23646;&#20851;&#31995;&#31649;&#29702;&#12290;&#22914;&#26524;&#20320;&#24037;&#20316;&#22312;&#24213;&#23618;Java&#26694;&#26550;&#19978;&#65292;&#20598;&#28982;&#24341;&#29992;&#21040;&#39640;&#23618;&#30340;GUI&#27169;&#26495;&#32452;&#20214;&#65292;&#36825;&#26102;&#20195;&#30721;&#19981;&#38656;&#35201;&#32534;&#35793;&#12290;&#36825;&#26159;&#30001;&#20110;&#26500;&#24314;&#25991;&#20214;&#22312;&#32534;&#35793;&#24213;&#23618;&#26694;&#26550;&#26102;&#22312;&#28304;&#36335;&#24452;&#20013;&#27809;&#26377;&#21253;&#21547;&#39640;&#23618;GUI&#38754;&#26495;&#32452;&#20214;&#30340;&#20195;&#30721;&#12290;</p>&#13;
<h3>7. &#23450;&#20041;&#24182;&#37325;&#29992;&#25991;&#20214;&#36335;&#24452;</h3>&#13;
<p>&#22914;&#26524;&#25991;&#20214;&#36335;&#24452;&#22312;&#19968;&#20010;&#22320;&#26041;&#19968;&#27425;&#24615;&#38598;&#20013;&#23450;&#20041;&#65292;&#24182;&#22312;&#25972;&#20010;&#26500;&#24314;&#25991;&#20214;&#20013;&#24471;&#21040;&#37325;&#29992;&#65292;&#37027;&#20040;&#26500;&#24314;&#25991;&#20214;&#26356;&#26131;&#20110;&#29702;&#35299;&#12290;&#20197;&#19979;&#26159;&#36825;&#26679;&#20570;&#30340;&#19968;&#20010;&#20363;&#23376;&#65306;</p>&lt;project name="sample" default="compile" basedir="."&gt;<br>&#160; &lt;path id="classpath.common"&gt;<br>&#160;&#160;&#160; &lt;pathelement location="${jdom.jar.withpath}"/&gt;<br>&#160;&#160;&#160; ...etc&#160; &lt;/path&gt;<br>&#160; &lt;path id="classpath.client"&gt;<br>&#160;&#160;&#160; &lt;pathelement location="${guistuff.jar.withpath}"/&gt;<br>&#160;&#160;&#160; &lt;pathelement location="${another.jar.withpath}"/&gt;<br>&#160;&#160;&#160; &lt;!-- reuse the common classpath --&gt;<br>&#160;&#160;&#160; &lt;path refid="classpath.common"/&gt;<br>&#160; &lt;/path&gt;<br>&#160; &lt;target name="compile.common" depends="prepare"&gt;<br>&#160;&#160;&#160; &lt;javac destdir="${dir.build}" srcdir="${dir.src}"&gt;<br>&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160; &lt;classpath refid="classpath.common"/&gt;<br>&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160; &lt;include name="com/oreilly/common/**"/&gt;<br>&#160;&#160;&#160; &lt;/javac&gt;<br>&#160; &lt;/target&gt;<br>&lt;/project&gt; &#13;
...etc <p>&#24403;&#39033;&#30446;&#19981;&#26029;&#22686;&#38271;&#26500;&#24314;&#26085;&#30410;&#22797;&#26434;&#26102;&#65292;&#36825;&#19968;&#25216;&#26415;&#36234;&#21457;&#20307;&#29616;&#20986;&#20854;&#20215;&#20540;&#12290;&#20320;&#21487;&#33021;&#38656;&#35201;&#20026;&#32534;&#35793;&#19981;&#21516;&#23618;&#27425;&#30340;&#24212;&#29992;&#23450;&#20041;&#21508;&#33258;&#30340;&#25991;&#20214;&#36335;&#24452;&#65292;&#27604;&#22914;&#36816;&#34892;&#21333;&#20803;&#27979;&#35797;&#30340;&#12289;&#36816;&#34892;&#24212;&#29992;&#31243;&#24207;&#30340;&#12289;&#36816;&#34892;Xdoclet&#30340;&#12289;&#29983;&#25104;JavaDocs&#30340;&#31561;&#31561;&#19981;&#21516;&#36335;&#24452;&#12290;&#36825;&#31181;&#32452;&#20214;&#21270;&#36335;&#24452;&#23450;&#20041;&#30340;&#26041;&#27861;&#27604;&#20026;&#27599;&#20010;&#20219;&#21153;&#21333;&#29420;&#23450;&#20041;&#36335;&#24452;&#35201;&#20248;&#36234;&#24471;&#22810;&#12290;&#21542;&#21017;&#65292;&#24456;&#23481;&#26131;&#20002;&#22833;&#20219;&#21153;&#20174;&#23646;&#20851;&#31995;&#30340;&#36712;&#36857;&#12290;</p>&#13;
<h3>8. &#23450;&#20041;&#24688;&#24403;&#30340;&#20219;&#21153;&#20174;&#23646;&#20851;&#31995;</h3>&#13;
<p>&#20551;&#35774;dist&#20219;&#21153;&#20174;&#23646;&#20110;jar&#20219;&#21153;&#65292;&#37027;&#20040;&#21738;&#20010;&#20219;&#21153;&#20174;&#23646;&#20110;compile&#20219;&#21153;&#21738;&#20010;&#20219;&#21153;&#20174;&#23646;&#20110;prepare&#20219;&#21153;&#21602;&#65311;Ant&#26500;&#24314;&#25991;&#20214;&#26368;&#32456;&#23450;&#20041;&#20102;&#20219;&#21153;&#30340;&#20174;&#23646;&#20851;&#31995;&#22270;&#65292;&#23427;&#24517;&#39035;&#34987;&#20180;&#32454;&#22320;&#23450;&#20041;&#21644;&#32500;&#25252;&#12290;</p>&#13;
<p>&#24212;&#35813;&#23450;&#26399;&#26816;&#26597;&#20219;&#21153;&#30340;&#20174;&#23646;&#20851;&#31995;&#20197;&#20445;&#35777;&#26500;&#24314;&#24037;&#20316;&#24471;&#21040;&#27491;&#30830;&#25191;&#34892;&#12290;&#22823;&#30340;&#26500;&#24314;&#25991;&#20214;&#38543;&#30528;&#26102;&#38388;&#25512;&#31227;&#36235;&#21521;&#20110;&#22686;&#21152;&#26356;&#22810;&#30340;&#20219;&#21153;&#65292;&#25152;&#20197;&#21040;&#26368;&#21518;&#21487;&#33021;&#30001;&#20110;&#19981;&#24517;&#35201;&#30340;&#20174;&#23646;&#20851;&#31995;&#23548;&#33268;&#26500;&#24314;&#24037;&#20316;&#38750;&#24120;&#22256;&#38590;&#12290;&#27604;&#22914;&#65292;&#20320;&#21487;&#33021;&#21457;&#29616;&#22312;&#31243;&#24207;&#21592;&#21482;&#38656;&#32534;&#35793;&#19968;&#20123;&#27809;&#26377;&#20351;&#29992;EJB&#30340;GUI&#20195;&#30721;&#26102;&#21448;&#37325;&#26032;&#29983;&#25104;&#20102;EJB&#20195;&#30721;&#12290;</p>&#13;
<p>&#20197;&#8220;&#20248;&#21270;&#8221;&#30340;&#21517;&#20041;&#24573;&#30053;&#20219;&#21153;&#30340;&#20174;&#23646;&#20851;&#31995;&#26159;&#21478;&#19968;&#31181;&#24120;&#35265;&#30340;&#38169;&#35823;&#12290;&#36825;&#31181;&#38169;&#35823;&#36843;&#20351;&#31243;&#24207;&#21592;&#20026;&#20102;&#24471;&#21040;&#24688;&#24403;&#30340;&#32467;&#26524;&#24517;&#39035;&#35760;&#20303;&#24182;&#25353;&#29031;&#29305;&#23450;&#30340;&#39034;&#24207;&#35843;&#29992;&#19968;&#20018;&#20219;&#21153;&#12290;&#26356;&#22909;&#30340;&#20570;&#27861;&#26159;&#65306;&#25552;&#20379;&#25551;&#36848;&#28165;&#26224;&#30340;&#20844;&#20849;&#20219;&#21153;&#65292;&#36825;&#20123;&#20219;&#21153;&#21253;&#21547;&#27491;&#30830;&#30340;&#20219;&#21153;&#20174;&#23646;&#20851;&#31995;&#65307;&#21478;&#22806;&#25552;&#20379;&#19968;&#22871;&#8220;&#19987;&#23478;&#8221;&#20219;&#21153;&#35753;&#20320;&#33021;&#22815;&#25163;&#24037;&#25191;&#34892;&#20010;&#21035;&#30340;&#26500;&#24314;&#27493;&#39588;&#65292;&#36825;&#20123;&#20219;&#21153;&#19981;&#25552;&#20379;&#23436;&#25972;&#30340;&#26500;&#24314;&#36807;&#31243;&#65292;&#20294;&#26159;&#35753;&#37027;&#20123;&#19987;&#23478;&#29992;&#25143;&#22312;&#24555;&#36895;&#32780;&#24700;&#20154;&#30340;&#32534;&#30721;&#26399;&#38388;&#33021;&#22815;&#36339;&#36807;&#26576;&#20123;&#27493;&#39588;&#12290;</p>&#13;
<h3>9.&#20351;&#29992;&#23646;&#24615;</h3>&#13;
<p>&#20219;&#20309;&#38656;&#35201;&#37197;&#32622;&#25110;&#21487;&#33021;&#21457;&#29983;&#21464;&#21270;&#30340;&#20449;&#24687;&#37117;&#24212;&#20316;&#20026;Ant&#23646;&#24615;&#23450;&#20041;&#19979;&#26469;&#12290;&#23545;&#20110;&#22312;&#26500;&#24314;&#25991;&#20214;&#20013;&#22810;&#27425;&#20986;&#29616;&#30340;&#20540;&#20063;&#21516;&#26679;&#22788;&#29702;&#12290;&#23646;&#24615;&#26082;&#21487;&#20197;&#22312;&#26500;&#24314;&#25991;&#20214;&#22836;&#37096;&#23450;&#20041;&#65292;&#20063;&#21487;&#20197;&#20026;&#20102;&#26356;&#22909;&#30340;&#28789;&#27963;&#24615;&#32780;&#22312;&#21333;&#29420;&#30340;&#23646;&#24615;&#25991;&#20214;&#20013;&#23450;&#20041;&#12290;&#20197;&#19979;&#26159;&#22312;&#26500;&#24314;&#25991;&#20214;&#20013;&#23450;&#20041;&#23646;&#24615;&#30340;&#26679;&#24335;&#65306;</p>&lt;project name="sample" default="compile" basedir="."&gt;<br>&#160; &lt;property name="dir.build" value="build"/&gt;<br>&#160; &lt;property name="dir.src" value="src"/&gt;<br>&#160; &lt;property name="jdom.home" value="../java-tools/jdom-b8"/&gt;<br>&#160; &lt;property name="jdom.jar" value="jdom.jar"/&gt;<br>&#160; &lt;property name="jdom.jar.withpath"<br>&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;value="${jdom.home}/build/${jdom.jar}"/&gt;<br>&#160;&#160;&#160; etc...<br>&lt;/project&gt; &#13;
etc...<p>&#25110;&#32773;&#20320;&#21487;&#20197;&#20351;&#29992;&#23646;&#24615;&#25991;&#20214;&#65306;</p>&lt;project name="sample" default="compile" basedir="."&gt;<br>&#160; &lt;property file="sample.properties"/&gt;<br>&#160;&#160; etc...<br>&lt;/project&gt; &#13;
etc...<p>&#22312;&#23646;&#24615;&#25991;&#20214; sample.properties&#20013;:</p>dir.build=build<br>dir.src=src<br>jdom.home=../java-tools/jdom-b8<br>jdom.jar=jdom.jarjdom.jar.withpath=${jdom.home}/build/${jdom.jar} &#13;
<p>dir.build=builddir.src=srcjdom.home=../java-tools/jdom-b8jdom.jar=jdom.jarjdom.jar.withpath=${jdom.home}/build/${jdom.jar}</p><p>&#29992;&#19968;&#20010;&#29420;&#31435;&#30340;&#25991;&#20214;&#23450;&#20041;&#23646;&#24615;&#26159;&#26377;&#22909;&#22788;&#30340;&#65292;&#23427;&#21487;&#20197;&#28165;&#26224;&#22320;&#23450;&#20041;&#26500;&#24314;&#20013;&#30340;&#21487;&#37197;&#32622;&#37096;&#20998;&#12290;&#21478;&#22806;&#65292;&#22312;&#24320;&#21457;&#32773;&#24037;&#20316;&#22312;&#19981;&#21516;&#25805;&#20316;&#31995;&#32479;&#30340;&#24773;&#20917;&#19979;&#65292;&#20320;&#21487;&#20197;&#22312;&#19981;&#21516;&#30340;&#24179;&#21488;&#19978;&#25552;&#20379;&#35813;&#25991;&#20214;&#30340;&#19981;&#21516;&#29256;&#26412;&#12290;</p>&#13;
<h3>10. &#20445;&#25345;&#26500;&#24314;&#36807;&#31243;&#29420;&#31435;</h3>&#13;
<p>&#20026;&#20102;&#26368;&#22823;&#38480;&#24230;&#30340;&#25193;&#23637;&#24615;&#65292;&#19981;&#35201;&#24212;&#29992;&#22806;&#37096;&#36335;&#24452;&#21644;&#24211;&#25991;&#20214;&#12290;&#26368;&#37325;&#35201;&#30340;&#26159;&#19981;&#35201;&#20381;&#36182;&#20110;&#31243;&#24207;&#21592;&#30340;CLASSPATH&#35774;&#32622;&#12290;&#21462;&#32780;&#20195;&#20043;&#30340;&#26159;&#65292;&#22312;&#26500;&#24314;&#25991;&#20214;&#20013;&#20351;&#29992;&#30456;&#23545;&#36335;&#24452;&#24182;&#23450;&#20041;&#33258;&#24049;&#30340;&#36335;&#24452;&#12290;&#22914;&#26524;&#20320;&#24341;&#29992;&#20102;&#32477;&#23545;&#36335;&#24452;&#22914;C:\java\tools&#65292;&#20854;&#20182;&#24320;&#21457;&#32773;&#26410;&#24517;&#20351;&#29992;&#19982;&#20320;&#30456;&#21516;&#30340;&#30446;&#24405;&#32467;&#26500;&#65292;&#25152;&#20197;&#23601;&#26080;&#27861;&#20351;&#29992;&#20320;&#30340;&#26500;&#24314;&#25991;&#20214;&#12290;</p>&#13;
<p>&#22914;&#26524;&#20320;&#37096;&#32626;&#24320;&#25918;&#28304;&#30721;&#39033;&#30446;&#65292;&#24212;&#35813;&#25552;&#20379;&#21253;&#21547;&#32534;&#35793;&#20195;&#30721;&#25152;&#38656;&#30340;&#25152;&#26377;JAR&#25991;&#20214;&#30340;&#21457;&#34892;&#29256;&#26412;&#12290;&#24403;&#28982;&#65292;&#36825;&#26159;&#22312;&#36981;&#23432;&#35768;&#21487;&#21327;&#35758;&#30340;&#22522;&#30784;&#19978;&#12290;&#23545;&#20110;&#20869;&#37096;&#39033;&#30446;&#65292;&#30456;&#20851;&#30340;JAR&#25991;&#20214;&#37117;&#24212;&#22312;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#30340;&#31649;&#29702;&#20013;&#65292;&#24182;&#25441;&#20986;&#65288;check out&#65289;&#21040;&#22823;&#23478;&#37117;&#30693;&#36947;&#30340;&#20301;&#32622;&#12290;</p>&#13;
<p>&#24403;&#20320;&#24517;&#39035;&#24341;&#29992;&#22806;&#37096;&#36335;&#24452;&#26102;&#65292;&#24212;&#23558;&#36335;&#24452;&#23450;&#20041;&#20026;&#23646;&#24615;&#12290;&#20351;&#31243;&#24207;&#21592;&#33021;&#22815;&#29992;&#36866;&#21512;&#20182;&#20204;&#33258;&#24049;&#30340;&#26426;&#22120;&#29615;&#22659;&#30340;&#21442;&#25968;&#37325;&#36733;&#36825;&#20123;&#23646;&#24615;&#12290;&#20320;&#20063;&#21487;&#20197;&#20351;&#29992;&#20197;&#19979;&#35821;&#27861;&#24341;&#29992;&#29615;&#22659;&#21464;&#37327;&#65306;</p>&lt;property environment="env"/&gt;<br>&lt;property name="dir.jboss" value="${env.JBOSS_HOME}"/&gt; &#13;
<h3>11. &#20351;&#29992;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;</h3>&#13;
<p></p><p>&#26500;&#24314;&#25991;&#20214;&#26159;&#19968;&#20010;&#37325;&#35201;&#30340;&#21046;&#21697;&#65292;&#24212;&#35813;&#20687;&#20195;&#30721;&#19968;&#26679;&#36827;&#34892;&#29256;&#26412;&#25511;&#21046;&#12290;&#24403;&#20320;&#26631;&#35760;&#20320;&#30340;&#20195;&#30721;&#26102;&#65292;&#20063;&#24212;&#29992;&#21516;&#26679;&#30340;&#26631;&#31614;&#26631;&#35760;&#26500;&#24314;&#25991;&#20214;&#12290;&#36825;&#26679;&#24403;&#20320;&#38656;&#35201;&#22238;&#28335;&#21040;&#26087;&#29256;&#26412;&#24182;&#36827;&#34892;&#26500;&#24314;&#26102;&#65292;&#33021;&#22815;&#20351;&#29992;&#30456;&#24212;&#29256;&#26412;&#30340;&#26500;&#24314;&#25991;&#20214;&#12290;</p>&#13;
<p>&#38500;&#26500;&#24314;&#25991;&#20214;&#20043;&#22806;&#65292;&#20320;&#36824;&#24212;&#22312;&#29256;&#26412;&#25511;&#21046;&#20013;&#32500;&#25252;&#31532;&#19977;&#26041;JAR&#25991;&#20214;&#12290;&#21516;&#26679;&#65292;&#36825;&#20351;&#20320;&#33021;&#22815;&#37325;&#26032;&#26500;&#24314;&#26087;&#29256;&#26412;&#30340;&#36719;&#20214;&#12290;&#36825;&#20063;&#33021;&#22815;&#26356;&#23481;&#26131;&#20445;&#35777;&#25152;&#26377;&#24320;&#21457;&#32773;&#25317;&#26377;&#19968;&#33268;&#30340;JAR&#25991;&#20214;&#65292;&#22240;&#20026;&#20182;&#20204;&#37117;&#26159;&#21516;&#26500;&#24314;&#25991;&#20214;&#19968;&#36215;&#20174;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#20013;&#25441;&#20986;&#30340;&#12290;</p>&#13;
<p>&#36890;&#24120;&#24212;&#36991;&#20813;&#22312;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#20013;&#23384;&#25918;&#26500;&#24314;&#25104;&#26524;&#12290;&#20504;&#33509;&#20320;&#30340;&#28304;&#20195;&#30721;&#24456;&#22909;&#22320;&#24471;&#21040;&#20102;&#29256;&#26412;&#25511;&#21046;&#65292;&#37027;&#20040;&#36890;&#36807;&#26500;&#24314;&#36807;&#31243;&#20320;&#33021;&#22815;&#37325;&#26032;&#29983;&#25104;&#20219;&#20309;&#29256;&#26412;&#30340;&#20135;&#21697;&#12290;</p>&#13;
<h3>12. &#25226;Ant&#20316;&#20026;&#8220;&#26368;&#23567;&#20844;&#20998;&#27597;&#8221;</h3>&#13;
<p>&#20551;&#35774;&#20320;&#30340;&#24320;&#21457;&#22242;&#38431;&#20351;&#29992;IDE&#24037;&#20855;&#65292;&#24403;&#31243;&#24207;&#21592;&#36890;&#36807;&#28857;&#20987;&#22270;&#26631;&#23601;&#33021;&#22815;&#26500;&#24314;&#25972;&#20010;&#24212;&#29992;&#26102;&#20026;&#20160;&#20040;&#36824;&#35201;&#20026;Ant&#32780;&#28902;&#24700;&#21602;&#65311;</p>&#13;
<p>IDE&#30340;&#38382;&#39064;&#26159;&#19968;&#20010;&#20851;&#20110;&#22242;&#38431;&#19968;&#33268;&#24615;&#21644;&#37325;&#29616;&#24615;&#30340;&#38382;&#39064;&#12290;&#20960;&#20046;&#25152;&#26377;&#30340;IDE&#35774;&#35745;&#21021;&#34935;&#37117;&#26159;&#20026;&#20102;&#25552;&#39640;&#31243;&#24207;&#21592;&#30340;&#20010;&#20154;&#29983;&#20135;&#29575;&#65292;&#32780;&#19981;&#26159;&#24320;&#21457;&#22242;&#38431;&#30340;&#25345;&#32493;&#26500;&#24314;&#12290;&#20856;&#22411;&#30340;IDE&#35201;&#27714;&#27599;&#20010;&#31243;&#24207;&#21592;&#23450;&#20041;&#33258;&#24049;&#30340;&#39033;&#30446;&#25991;&#20214;&#12290;&#31243;&#24207;&#21592;&#21487;&#33021;&#25317;&#26377;&#19981;&#21516;&#30340;&#30446;&#24405;&#32467;&#26500;&#65292;&#21487;&#33021;&#20351;&#29992;&#19981;&#21516;&#29256;&#26412;&#30340;&#24211;&#25991;&#20214;&#65292;&#36824;&#21487;&#33021;&#24037;&#20316;&#22312;&#19981;&#21516;&#30340;&#24179;&#21488;&#19978;&#12290;&#36825;&#23558;&#23548;&#33268;&#20986;&#29616;&#36825;&#31181;&#24773;&#20917;&#65306;&#22312;Bob&#37027;&#37324;&#36816;&#34892;&#33391;&#22909;&#30340;&#20195;&#30721;&#65292;&#21040;Sally&#37027;&#37324;&#23601;&#26080;&#27861;&#36816;&#34892;&#12290;</p>&#13;
<p>&#19981;&#31649;&#20320;&#30340;&#24320;&#21457;&#22242;&#38431;&#20351;&#29992;&#20309;&#31181;IDE&#65292;&#19968;&#23450;&#35201;&#24314;&#31435;&#25152;&#26377;&#31243;&#24207;&#21592;&#37117;&#33021;&#22815;&#20351;&#29992;&#30340;Ant&#26500;&#24314;&#25991;&#20214;&#12290;&#35201;&#24314;&#31435;&#19968;&#20010;&#31243;&#24207;&#21592;&#22312;&#23558;&#26032;&#20195;&#30721;&#25552;&#20132;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#21069;&#24517;&#39035;&#25191;&#34892;Ant&#26500;&#24314;&#25991;&#20214;&#30340;&#35268;&#21017;&#12290;&#36825;&#23558;&#30830;&#20445;&#20195;&#30721;&#26159;&#32463;&#36807;&#21516;&#19968;&#20010;Ant&#26500;&#24314;&#25991;&#20214;&#26500;&#24314;&#30340;&#12290;&#24403;&#20986;&#29616;&#38382;&#39064;&#26102;&#65292;&#35201;&#20351;&#29992;&#39033;&#30446;&#26631;&#20934;&#30340;Ant&#26500;&#24314;&#25991;&#20214;&#65292;&#32780;&#19981;&#26159;&#36890;&#36807;&#26576;&#20010;IDE&#26469;&#25191;&#34892;&#19968;&#20010;&#24178;&#20928;&#30340;&#26500;&#24314;&#12290;</p>&#13;
<p>&#31243;&#24207;&#21592;&#21487;&#20197;&#33258;&#30001;&#36873;&#25321;&#20219;&#20309;&#20182;&#20204;&#20064;&#24815;&#20351;&#29992;&#30340;IDE&#24037;&#20855;&#25110;&#32534;&#36753;&#22120;&#12290;&#20294;&#26159;Ant&#24212;&#20316;&#20026;&#20844;&#20849;&#22522;&#32447;&#20197;&#20445;&#35777;&#20195;&#30721;&#27704;&#36828;&#26159;&#21487;&#26500;&#24314;&#30340;&#12290;</p>&#13;
<h3>13. &#20351;&#29992;zipfileset&#23646;&#24615;</h3>&#13;
<p>&#20154;&#20204;&#32463;&#24120;&#20351;&#29992;Ant&#20135;&#29983;WAR&#12289;JAR&#12289;ZIP&#21644; EAR&#25991;&#20214;&#12290;&#36825;&#20123;&#25991;&#20214;&#36890;&#24120;&#37117;&#35201;&#27714;&#26377;&#19968;&#20010;&#29305;&#23450;&#30340;&#20869;&#37096;&#30446;&#24405;&#32467;&#26500;&#65292;&#20294;&#20854;&#24448;&#24448;&#19982;&#20320;&#30340;&#28304;&#20195;&#30721;&#21644;&#32534;&#35793;&#29615;&#22659;&#30340;&#30446;&#24405;&#32467;&#26500;&#19981;&#21305;&#37197;&#12290;</p>&#13;
<p>&#19968;&#20010;&#26368;&#24120;&#29992;&#30340;&#26041;&#27861;&#26159;&#20889;&#19968;&#20010;Ant&#20219;&#21153;&#65292;&#25353;&#29031;&#26399;&#26395;&#30340;&#30446;&#24405;&#32467;&#26500;&#25226;&#19968;&#22823;&#22534;&#25991;&#20214;&#25335;&#36125;&#21040;&#20020;&#26102;&#30446;&#24405;&#20013;&#65292;&#28982;&#21518;&#29983;&#25104;&#21387;&#32553;&#25991;&#20214;&#12290;&#36825;&#19981;&#26159;&#26368;&#26377;&#25928;&#30340;&#26041;&#27861;&#12290;&#20351;&#29992;zipfileset&#23646;&#24615;&#26159;&#26356;&#22909;&#30340;&#35299;&#20915;&#26041;&#26696;&#12290;&#23427;&#35753;&#20320;&#20174;&#20219;&#20309;&#20301;&#32622;&#36873;&#25321;&#25991;&#20214;&#65292;&#28982;&#21518;&#25226;&#23427;&#20204;&#25353;&#29031;&#19981;&#21516;&#30446;&#24405;&#32467;&#26500;&#25918;&#36827;&#21387;&#32553;&#25991;&#20214;&#20013;&#12290;&#20197;&#19979;&#26159;&#19968;&#20010;&#20363;&#23376;&#65306;</p>&lt;ear earfile="${dir.dist.server}/payroll.ear"<br>&#160;&#160;&#160; appxml="${dir.resources}/application.xml"&gt;<br>&#160; &lt;fileset dir="${dir.build}" includes="commonServer.jar"/&gt;<br>&#160; &lt;fileset dir="${dir.build}"&gt;<br>&#160;&#160;&#160; &lt;include name="payroll-ejb.jar"/&gt;<br>&#160; &lt;/fileset&gt;<br>&#160; &lt;zipfileset dir="${dir.build}" prefix="lib"&gt;<br>&#160; &#160;&#160;&lt;include name="hr.jar"/&gt;<br>&#160;&#160;&#160; &lt;include name="billing.jar"/&gt;<br>&#160; &lt;/zipfileset&gt;<br>&#160; &lt;fileset dir="."&gt;<br>&#160;&#160;&#160; &lt;include name="lib/jdom.jar"/&gt;<br>&#160;&#160;&#160; &lt;include name="lib/log4j.jar"/&gt;<br>&#160;&#160;&#160; &lt;include name="lib/ojdbc14.jar"/&gt;<br>&#160; &lt;/fileset&gt;<br>&#160; &lt;zipfileset dir="${dir.generated.src}" prefix="META-INF"&gt;<br>&#160;&#160;&#160; &lt;include name="jboss-app.xml"/&gt;<br>&#160; &lt;/zipfileset&gt;<br>&lt;/ear&gt; &#13;
<p>&#22312;&#36825;&#20010;&#20363;&#23376;&#20013;&#65292;&#25152;&#26377;JAR&#25991;&#20214;&#37117;&#25918;&#22312;EAR&#25991;&#20214;&#21253;&#30340;lib&#30446;&#24405;&#20013;&#12290;hr.jar&#21644;billing.jar&#26159;&#20174;&#26500;&#24314;&#30446;&#24405;&#25335;&#36125;&#36807;&#26469;&#30340;&#12290;&#22240;&#27492;&#25105;&#20204;&#20351;&#29992;zipfileset&#23646;&#24615;&#25226;&#23427;&#20204;&#31227;&#21160;&#21040;EAR&#25991;&#20214;&#21253;&#20869;&#37096;&#30340;lib&#30446;&#24405;&#12290;prefix&#23646;&#24615;&#25351;&#23450;&#20102;&#20854;&#22312;EAR&#25991;&#20214;&#20013;&#30340;&#30446;&#26631;&#36335;&#24452;&#12290;</p>&#13;
<h3>14. &#27979;&#35797;Clean&#20219;&#21153;</h3>&#13;
<p>&#20551;&#35774;&#20320;&#30340;&#26500;&#24314;&#25991;&#20214;&#20013;&#26377;clean&#21644;compile&#30340;&#20219;&#21153;&#65292;&#25191;&#34892;&#20197;&#19979;&#30340;&#27979;&#35797;&#12290;&#31532;&#19968;&#27493;&#65292;&#25191;&#34892;ant clean&#65307;&#31532;&#20108;&#27493;&#65292;&#25191;&#34892;ant compile&#65307;&#31532;&#19977;&#27493;&#65292;&#20877;&#25191;&#34892;ant compile&#12290;&#31532;&#19977;&#27493;&#24212;&#35813;&#19981;&#20316;&#20219;&#20309;&#20107;&#24773;&#12290;&#22914;&#26524;&#25991;&#20214;&#20877;&#27425;&#34987;&#32534;&#35793;&#65292;&#35828;&#26126;&#20320;&#30340;&#26500;&#24314;&#25991;&#20214;&#26377;&#38382;&#39064;&#12290;</p>&#13;
<p>&#26500;&#24314;&#25991;&#20214;&#24212;&#35813;&#21482;&#22312;&#19982;&#36755;&#20986;&#25991;&#20214;&#30456;&#20851;&#32852;&#30340;&#36755;&#20837;&#25991;&#20214;&#21457;&#29983;&#21464;&#21270;&#26102;&#25191;&#34892;&#20219;&#21153;&#12290;&#19968;&#20010;&#26500;&#24314;&#25991;&#20214;&#22312;&#19981;&#24517;&#25191;&#34892;&#35832;&#22914;&#32534;&#35793;&#12289;&#25335;&#36125;&#25110;&#20854;&#20182;&#24037;&#20316;&#20219;&#21153;&#30340;&#26102;&#20505;&#25191;&#34892;&#36825;&#20123;&#20219;&#21153;&#26159;&#20302;&#25928;&#30340;&#12290;&#24403;&#39033;&#30446;&#35268;&#27169;&#22686;&#38271;&#26102;&#65292;&#21363;&#20351;&#26159;&#23567;&#30340;&#20302;&#25928;&#24037;&#20316;&#20063;&#20250;&#25104;&#20026;&#22823;&#30340;&#38382;&#39064;&#12290;</p>&#13;
<h3>15. &#36991;&#20813;&#29305;&#23450;&#24179;&#21488;&#30340;Ant&#23553;&#35013;</h3>&#13;
<p>&#19981;&#31649;&#20160;&#20040;&#21407;&#22240;&#65292;&#26377;&#20154;&#21916;&#27426;&#29992;&#31616;&#21333;&#30340;&#12289;&#21517;&#31216;&#21483;&#20570;compile&#20043;&#31867;&#30340;&#25209;&#25991;&#20214;&#25110;&#33050;&#26412;&#35013;&#36733;&#20182;&#20204;&#30340;&#20135;&#21697;&#12290;&#24403;&#20320;&#21435;&#30475;&#33050;&#26412;&#30340;&#20869;&#23481;&#20320;&#20250;&#21457;&#29616;&#20197;&#19979;&#20869;&#23481;&#65306;</p>&#13;
<p>ant compile</p>&#13;
<p>&#20854;&#23454;&#24320;&#21457;&#20154;&#21592;&#37117;&#24456;&#29087;&#24713;Ant&#65292;&#24182;&#19988;&#23436;&#20840;&#33021;&#22815;&#33258;&#24049;&#38190;&#20837;ant compile&#12290;&#35831;&#19981;&#35201;&#20165;&#20165;&#20026;&#20102;&#35843;&#29992;Ant&#32780;&#20351;&#29992;&#29305;&#23450;&#24179;&#21488;&#30340;&#33050;&#26412;&#12290;&#36825;&#21482;&#20250;&#20351;&#20854;&#20182;&#20154;&#22312;&#39318;&#27425;&#20351;&#29992;&#20320;&#30340;&#33050;&#26412;&#26102;&#22686;&#21152;&#23398;&#20064;&#21644;&#29702;&#35299;&#30340;&#28902;&#25200;&#12290;&#38500;&#27492;&#20043;&#22806;&#65292;&#20320;&#19981;&#21487;&#33021;&#25552;&#20379;&#36866;&#29992;&#20110;&#27599;&#20010;&#25805;&#20316;&#31995;&#32479;&#30340;&#33050;&#26412;&#65292;&#36825;&#26159;&#30495;&#27491;&#28902;&#25200;&#20854;&#20182;&#29992;&#25143;&#30340;&#22320;&#26041;&#12290;</p>&#13;
<h3>&#24635;&#32467;</h3>&#13;
<p>&#22826;&#22810;&#30340;&#20844;&#21496;&#20381;&#38752;&#25163;&#24037;&#26041;&#27861;&#21644;&#29305;&#21035;&#31243;&#24207;&#26469;&#32534;&#35793;&#20195;&#30721;&#21644;&#29983;&#25104;&#36719;&#20214;&#21457;&#24067;&#29256;&#26412;&#12290;&#37027;&#20123;&#19981;&#20351;&#29992;Ant&#25110;&#31867;&#20284;&#24037;&#20855;&#23450;&#20041;&#26500;&#24314;&#36807;&#31243;&#30340;&#24320;&#21457;&#22242;&#38431;&#65292;&#33457;&#36153;&#20102;&#22826;&#22810;&#30340;&#26102;&#38388;&#26469;&#25429;&#25417;&#20195;&#30721;&#32534;&#35793;&#36807;&#31243;&#20013;&#20986;&#29616;&#30340;&#38382;&#39064;&#65306;&#22312;&#26576;&#20123;&#24320;&#21457;&#32773;&#37027;&#37324;&#32534;&#35793;&#25104;&#21151;&#30340;&#20195;&#30721;&#65292;&#21040;&#21478;&#19968;&#20123;&#24320;&#21457;&#32773;&#37027;&#37324;&#21364;&#22833;&#36133;&#20102;&#12290;</p>&#13;
<p>&#29983;&#25104;&#24182;&#32500;&#25252;&#26500;&#24314;&#33050;&#26412;&#19981;&#26159;&#19968;&#39033;&#23500;&#26377;&#39749;&#21147;&#30340;&#24037;&#20316;&#65292;&#20294;&#21364;&#26159;&#19968;&#39033;&#24517;&#38656;&#30340;&#24037;&#20316;&#12290;&#19968;&#20010;&#22909;&#30340;Ant&#26500;&#24314;&#25991;&#20214;&#23558;&#20351;&#20320;&#33021;&#22815;&#38598;&#20013;&#21040;&#26356;&#21916;&#27426;&#30340;&#24037;&#20316;&#8212;&#8212;&#20889;&#20195;&#30721;&#20013;&#21435;&#65281;</p>&#13;
<h3>&#21442;&#32771;</h3>&#13;
</div></body></html>