<!DOCTYPE html>
    <html lang="zh-cn">
    <head>
    <meta charset="utf-8"/>
    <title>
    <meta name="authors" content="" />持续集成理论和实践的新进展</title></head><body>From:<a href=http://www.cnblogs.com/itech/archive/2011/07/26/2116999.html#FeedBack>http://www.cnblogs.com/itech/archive/2011/07/26/2116999.html#FeedBack</a><br><br><div><p>&#36716;&#33258;&#65306;&#160;</p><p>http://www.infoq.com/cn/articles/ci-theory-practice</p><p>&#160;</p><p>&#160;</p><p>&#26368;&#36817;&#38647;&#38215;&#21516;&#23398;&#23558;Martin  Fowler&#20808;&#29983;&#30340;&#33879;&#21517;&#35770;&#25991;&#12298;&#25345;&#32493;&#38598;&#25104;&#12299;&#31532;&#20108;&#29256;&#32763;&#35793;&#25104;&#20013;&#25991;&#24182;&#21457;&#24067;&#20986;&#26469;&#65292;&#25472;&#36215;&#20102;&#22269;&#20869;&#23545;&#20110;&#25345;&#32493;&#38598;&#25104;&#29702;&#35770;&#21644;&#23454;&#36341;&#35752;&#35770;&#30340;&#26032;&#30340;&#39640;&#28526;&#12290;&#31508;&#32773;&#22312;&#26412;&#25991;&#20013;&#23558;&#20840;&#38754;&#23545;&#27604;&#25345;&#32493;&#38598;&#25104; &#35770;&#25991;&#21069;&#21518;&#20004;&#29256;&#30340;&#24322;&#21516;&#65292;&#20998;&#26512;&#24182;&#23637;&#31034;ThoughtWorks&#22312;&#25345;&#32493;&#38598;&#25104;&#39046;&#22495;&#30340;&#29702;&#35770;&#21644;&#23454;&#36341;&#26041;&#38754;&#30340;&#30740;&#31350;&#25104;&#26524;&#65292;&#20197;&#22270;&#23545;&#22269;&#20869;&#20225;&#19994;&#23454;&#26045;&#25345;&#32493;&#38598;&#25104;&#36215;&#21040;&#21442;&#32771;&#21644;&#20511;&#37492;&#20316;&#29992;&#12290;&#38656; &#35201;&#35828;&#26126;&#30340;&#26159;&#65292;&#26412;&#25991;&#25152;&#20171;&#32461;&#30340;&#20869;&#23481;&#27605;&#31455;&#38480;&#20110;&#31508;&#32773;&#30340;&#27700;&#24179;&#65292;&#24182;&#19988;&#20027;&#35201;&#26159;ThoughtWorks&#20869;&#37096;&#24320;&#21457;&#21644;&#23545;&#22806;&#21672;&#35810;&#23454;&#36341;&#30340;&#24635;&#32467;&#65292;&#25152;&#20197;&#26410;&#24517;&#23545;&#35835;&#32773;&#25152;&#36935;&#21040;&#30340;&#24773;&#20917;&#26159;&#36866;&#29992; &#30340;&#65292;&#35831;&#33258;&#34892;&#29956;&#21035;&#12290;</p>  		          <p></p>           	 <p>&#12298;&#25345;&#32493;&#38598;&#25104;&#12299;&#31532;&#20108;&#29256;&#34429;&#28982;&#26159;&#26368;&#36817;&#25165;&#32763;&#35793;&#20986;&#26469;&#65292;&#20294;&#26159;&#23454;&#38469;&#19978;Martin  Fowler&#20808;&#29983;&#23436;&#25104;&#27492;&#25991;&#26159;&#22312;5&#24180;&#21069;&#30340;&#20107;&#24773;&#12290;&#36825;&#20116;&#24180;&#24688;&#22909;&#26159;ThoughtWorks&#20013;&#22269;&#20844;&#21496;&#24555;&#36895;&#25104;&#38271;&#30340;&#20116;&#24180;&#12290;&#22312;&#36825;&#20116;&#24180;&#20869;ThoughtWorks&#20013;&#22269;&#22312;&#25345; &#32493;&#38598;&#25104;&#39046;&#22495;&#20063;&#26377;&#24456;&#22810;&#30340;&#21457;&#23637;&#65292;&#36825;&#21253;&#25324;&#65306;&#33879;&#21517;&#30340;&#25345;&#32493;&#38598;&#25104;&#24037;&#20855;Cruise&#20027;&#35201;&#26159;&#30001;&#20013;&#22269;&#20844;&#21496;&#36127;&#36131;&#24320;&#21457;<a href="http://www.infoq.com/cn/articles/ci-theory-practice#FOOTNOTE-1">1</a>;   &#20013;&#22269;&#20844;&#21496;&#24110;&#21161;&#22269;&#20869;&#24456;&#22810;&#22823;&#20013;&#22411;&#20225;&#19994;&#23436;&#25104;&#25345;&#32493;&#38598;&#25104;&#23454;&#26045;&#21644;&#30456;&#20851;&#30340;&#27969;&#31243;&#25913;&#36827;;2009&#24180;&#20013;&#22269;&#20844;&#21496;&#30340;&#24456;&#22810;&#21516;&#20107;&#23545;&#20110;&#25345;&#32493;&#38598;&#25104;&#30340;&#24230;&#37327;&#36827;&#34892;&#20102;&#28145;&#20837;&#30340;&#35752;&#35770;&#24182;&#19988;&#26368;&#32456;&#30001;&#32993;&#20975;&#23558;&#20854; &#23454;&#29616;&#20026;&#19968;&#27454;&#36719;&#20214;iAnalysis;2010&#24180;&#33267;2011&#24180;&#25104;&#21151;&#30340;&#20132;&#20184;&#20102;&#20174;&#38656;&#27714;&#25552;&#20379;&#26041;&#21040;&#22810;&#20010;&#25216;&#26415;&#26381;&#21153;&#25552;&#20379;&#21830;&#30340;&#25345;&#32493;&#38598;&#25104;&#26041;&#26696;&#65292;&#20197;&#21450;&#20225;&#19994;&#32423;&#33258;&#21160;&#21270;&#20013;&#24515;&#26041;&#26696;&#12290;&#25152; &#20197;&#65292;&#26412;&#25991;&#20027;&#35201;&#21253;&#25324;&#20004;&#37096;&#20998;&#20869;&#23481;&#65292;&#19968;&#37096;&#20998;&#26159;&#36890;&#36807;&#23545;&#27604;&#31532;&#19968;&#29256;&#19982;&#31532;&#20108;&#29256;&#30340;&#24322;&#21516;&#20171;&#32461;2000&#24180;&#21040;2006&#24180;&#20043;&#38388;&#25345;&#32493;&#38598;&#25104;&#39046;&#22495;&#30340;&#20027;&#35201;&#21457;&#23637;&#65292;&#21478;&#19968;&#37096;&#20998;&#21017;&#26159;&#20171;&#32461;&#31532;&#20108;&#29256;&#21457;&#34920; &#20043;&#21518;&#25345;&#32493;&#38598;&#25104;&#39046;&#22495;&#30340;&#26032;&#36827;&#23637;&#12290;&#35835;&#32773;&#22914;&#26524;&#20043;&#21069;&#27809;&#26377;&#38405;&#35835;&#36807;&#12298;&#25345;&#32493;&#38598;&#25104;&#12299;&#35770;&#25991;&#30340;&#31532;&#20108;&#29256;&#65292;&#24314;&#35758;&#23558;&#26412;&#25991;&#31532;&#19968;&#37096;&#20998;&#19968;&#21516;&#38405;&#35835;&#65292;&#22240;&#20026;&#26412;&#25991;&#24182;&#38750;&#23545;&#35770;&#25991;&#30340;&#37325;&#36848;&#65292;&#25152;&#20197;&#24456;&#22810;&#22320;&#26041;&#36824;&#38656; &#35201;&#21442;&#32771;&#21407;&#25991;&#20013;&#30340;&#20869;&#23481;&#12290;</p> <h2>&#31532;&#19968;&#37096;&#20998; &#12298;&#25345;&#32493;&#38598;&#25104;&#12299;&#31532;&#19968;&#29256;&#19982;&#31532;&#20108;&#29256;</h2> <p>&#12298;&#25345;&#32493;&#38598;&#25104;&#12299;&#31532;&#19968;&#29256;&#30001;ThoughtWorks&#39318;&#24109;&#31185;&#23398;&#23478;Martin Fowler&#20808;&#29983;&#21644;Matthew Foemmel&#20849;&#21516;&#23436;&#25104;<a href="http://www.infoq.com/cn/articles/ci-theory-practice#FOOTNOTE-2">2</a>&#65292;&#31532;&#20108;&#29256;&#30001;Martin Fowler&#20808;&#29983;&#26356;&#26032;&#12290;</p> <p>&#12298;&#25345;&#32493;&#38598;&#25104;&#12299;&#30340;&#31532;&#19968;&#29256;&#20013;&#24182;&#27809;&#26377;&#32473;&#20986;&#27604;&#36739;&#27491;&#24335;&#30340;&#23450;&#20041;&#65292;&#34429;&#28982;&#20316;&#32773;&#22312;&#25991;&#20013;&#35828;&#26159;&#20511;&#37492;&#20102;XP&#23454;&#36341;&#20013;&#30340;&#26415;&#35821;&#65292;&#20294;&#26159;&#30446;&#21069;&#33021;&#30475;&#21040;&#30340;XP&#23454;&#36341;&#20013;&#23545;&#25345;&#32493;&#38598;&#25104;&#30340;&#23450;&#20041;&#23454;&#38469;&#19978;&#22823;&#22810;&#25968;&#37117;&#26159;&#25351;&#21521;&#20102;Martin&#30340;&#25991;&#31456;&#12290;&#37027;&#20040;&#25105;&#20204;&#36824;&#26159;&#26469;&#30475;&#30475;&#31532;&#20108;&#29256;&#20013;&#32473;&#20986;&#30340;&#23450;&#20041;&#12290;</p> <blockquote> <p>&#25345;&#32493;&#38598;&#25104;&#26159;&#19968;&#31181;&#36719;&#20214;&#24320;&#21457;&#23454;&#36341;&#12290;&#22312;&#25345;&#32493;&#38598;&#25104;&#20013;&#65292;&#22242;&#38431;&#25104;&#21592;&#39057;&#32321;&#38598;&#25104;&#20182;&#20204;&#30340;&#24037;&#20316;&#25104;&#26524;&#65292;&#19968;&#33324;&#27599;&#20154;&#27599;&#22825;&#33267;&#23569;&#38598;&#25104;&#19968;&#27425;&#65292;&#20063;&#21487;&#20197;&#22810;&#27425;&#12290;&#27599;&#27425;&#38598;&#25104;&#20250;&#32463;&#36807;&#33258;&#21160;&#26500;&#24314;&#65288;&#21253; &#25324;&#33258;&#21160;&#27979;&#35797;&#65289;&#30340;&#39564;&#35777;&#65292;&#20197;&#23613;&#24555;&#21457;&#29616;&#38598;&#25104;&#38169;&#35823;&#12290;&#35768;&#22810;&#22242;&#38431;&#21457;&#29616;&#36825;&#31181;&#26041;&#27861;&#21487;&#20197;&#26174;&#33879;&#20943;&#23569;&#38598;&#25104;&#24341;&#36215;&#30340;&#38382;&#39064;&#65292;&#24182;&#21487;&#20197;&#21152;&#24555;&#22242;&#38431;&#21512;&#20316;&#36719;&#20214;&#24320;&#21457;&#30340;&#36895;&#24230;&#12290;<a href="http://www.infoq.com/cn/articles/ci-theory-practice#FOOTNOTE-3">3</a></p> </blockquote> <p>&#31532;&#20108;&#29256;&#30456;&#23545;&#20110;&#31532;&#19968;&#29256;&#22686;&#21152;&#20102;&#19981;&#23569;&#20869;&#23481;&#65292;&#20854;&#20013;&#26368;&#37325;&#35201;&#30340;&#20960;&#28857;&#21253;&#25324;&#65306;</p> <ol><li>&#35814;&#32454;&#20171;&#32461;&#20102;&#20351;&#29992;&#25345;&#32493;&#38598;&#25104;&#36827;&#34892;&#36719;&#20214;&#24320;&#21457;&#30340;&#24037;&#20316;&#27969;&#31243;&#12290;</li><li>&#31361;&#20986;&#20102;&#37197;&#32622;&#31649;&#29702;&#22312;&#25345;&#32493;&#38598;&#25104;&#23454;&#36341;&#20013;&#30340;&#20316;&#29992;&#12290;</li><li>&#25552;&#20986;&#20998;&#38454;&#27573;&#26500;&#24314;&#30340;&#27010;&#24565;&#12290;</li><li>&#22686;&#21152;&#20102;&#25345;&#32493;&#38598;&#25104;&#25253;&#21578;&#30340;&#20869;&#23481;&#12290;</li><li>&#22686;&#21152;&#20102;&#25345;&#32493;&#37096;&#32626;&#30340;&#20869;&#23481;&#12290;</li><li>&#32473;&#20986;&#20102;&#24341;&#20837;&#25345;&#32493;&#38598;&#25104;&#30340;&#24314;&#35758;&#12290;</li></ol> <h3>1) &#25345;&#32493;&#38598;&#25104;&#30340;&#27969;&#31243;</h3> <p>&#22312;&#25345;&#32493;&#38598;&#25104;&#39046;&#22495;&#65292;&#25105;&#20204;&#32463;&#24120;&#20250;&#29992;&#21040;&#30340;&#19968;&#20010;&#26415;&#35821;&#23601;&#26159;&#8220;&#26500;&#24314;&#65288;Build&#65289;&#8221;&#12290;&#24456;&#22810;&#20154;&#35748;&#20026;&#8220;&#26500;&#24314;=&#32534;&#35793;+&#38142;&#25509;&#65288;Build=Compile+Link&#65289;&#8221;&#65292;Martin&#22312;&#31532;&#19968;&#29256;&#20013;&#25351;&#20986;&#19968;&#27425;&#25104;&#21151;&#26500;&#24314;&#21253;&#25324;&#65306;</p> <blockquote> <ul><li>&#25152;&#26377;&#26368;&#26032;&#20195;&#30721;&#20174;&#37197;&#32622;&#31649;&#29702;&#24037;&#20855;&#20013;&#21462;&#20986;&#65288;check out&#25110;&#32773;update&#65289;&#12290;</li><li>&#25152;&#26377;&#30340;&#20195;&#30721;&#20174;&#24178;&#20928;&#30340;&#29366;&#24577;&#24320;&#22987;&#32534;&#35793;&#12290;</li><li>&#23558;&#32534;&#35793;&#32467;&#26524;&#38142;&#25509;&#24182;&#37096;&#32626;&#65292;&#20197;&#22791;&#25191;&#34892;&#12290;</li><li>&#25191;&#34892;&#37096;&#32626;&#30340;&#24212;&#29992;&#24182;&#36816;&#34892;&#27979;&#35797;&#22871;&#12290;</li><li>&#22914;&#26524;&#19978;&#36848;&#25152;&#26377;&#25805;&#20316;&#27809;&#26377;&#20219;&#20309;&#38169;&#35823;&#65292;&#27809;&#26377;&#20154;&#24037;&#24178;&#39044;&#65292;&#24182;&#36890;&#36807;&#20102;&#25152;&#26377;&#27979;&#35797;&#65292;&#25105;&#20204;&#35748;&#20026;&#36825;&#25165;&#26159;&#19968;&#27425;&#25104;&#21151;&#30340;&#26500;&#24314;&#12290;</li></ul> </blockquote> <p>&#23454;&#38469;&#19978;&#65292;&#30446;&#21069;&#24456;&#22810;&#22242;&#38431;&#23545;&#25104;&#21151;&#25345;&#32493;&#38598;&#25104;&#26500;&#24314;&#30340;&#23450;&#20041;&#22522;&#26412;&#19978;&#26159;&#31526;&#21512;&#19978;&#36848;&#23450;&#20041;&#30340;&#12290;&#36825;&#20010;&#23450;&#20041;&#30340;&#29305;&#28857;&#22312;&#20110;&#23427;&#26159;&#30456;&#23545;&#29420;&#31435;&#30340;&#65292;&#23427;&#26159;&#19968;&#20010;&#20174;&#24178;&#20928;&#29366;&#24577;&#30340;&#28304;&#20195;&#30721;&#26368;&#32456;&#33719;&#24471;&#21487;&#36816;&#34892;&#30340;&#36890;&#36807;&#39564;&#35777;&#30340;&#36719;&#20214;&#30340;&#36807;&#31243;&#12290;</p> <p>Martin&#22312;&#31532;&#20108;&#29256;&#20013;&#21017;&#22312;&#25104;&#21151;&#26500;&#24314;&#30340;&#22522;&#30784;&#19978;&#32473;&#20986;&#20102;&#25104;&#21151;&#38598;&#25104;&#30340;&#23450;&#20041;&#12290;&#25104;&#21151;&#38598;&#25104;&#20851;&#27880;&#30340;&#19981;&#26159;&#19968;&#27425;&#8220;&#32534;&#35793;+&#38142;&#25509;+&#37096;&#32626;+&#39564;&#35777;&#8221;&#30340;&#36807;&#31243;&#65292;&#32780;&#26159;&#20174;&#24320;&#21457;&#27969;&#31243;&#30340;&#35282;&#24230;&#20171;&#32461;&#19968;&#27425;&#23436;&#25972;&#30340;&#22312;&#25345;&#32493;&#38598;&#25104;&#32422;&#26463;&#19979;&#30340;&#20195;&#30721;&#25552;&#20132;&#36807;&#31243;<a href="http://www.infoq.com/cn/articles/ci-theory-practice#FOOTNOTE-4">4</a>&#65306;</p> <blockquote> <ul><li>&#23558;&#24050;&#38598;&#25104;&#30340;&#28304;&#20195;&#30721;&#22797;&#21046;&#19968;&#20221;&#21040;&#26412;&#22320;&#35745;&#31639;&#26426;&#12290;</li><li>&#20462;&#25913;&#20135;&#21697;&#20195;&#30721;&#21644;&#28155;&#21152;&#20462;&#25913;&#33258;&#21160;&#21270;&#27979;&#35797;&#12290;</li><li>&#22312;&#33258;&#24049;&#30340;&#35745;&#31639;&#26426;&#19978;&#21551;&#21160;&#19968;&#20010;&#33258;&#21160;&#21270;&#26500;&#24314;&#12290;</li><li>&#26500;&#24314;&#25104;&#21151;&#21518;&#65292;&#25226;&#21035;&#20154;&#30340;&#20462;&#25913;&#26356;&#26032;&#21040;&#25105;&#30340;&#24037;&#20316;&#25335;&#36125;&#20013;&#12290;</li><li>&#20877;&#37325;&#26032;&#20570;&#26500;&#24314;&#12290;</li><li>&#25226;&#20462;&#25913;&#25552;&#20132;&#21040;&#28304;&#30721;&#20179;&#24211;&#12290;</li><li>&#22312;&#38598;&#25104;&#35745;&#31639;&#26426;&#19978;&#24182;&#22522;&#20110;&#20027;&#32447;&#30340;&#20195;&#30721;&#20877;&#20570;&#19968;&#27425;&#26500;&#24314;&#12290;</li><li>&#21482;&#26377;&#36825;&#27425;&#26500;&#24314;&#25104;&#21151;&#20102;&#65292;&#25165;&#35828;&#26126;&#25913;&#21160;&#34987;&#25104;&#21151;&#30340;&#38598;&#25104;&#20102;&#12290;</li></ul> </blockquote> <p>&#19979;&#22270;&#23637;&#31034;&#20102;Martin&#23545;&#25104;&#21151;&#38598;&#25104;&#30340;&#23450;&#20041;&#65306;</p> <p><img alt="" src="http://images.cnblogs.com/cnblogs_com/itech/build/cc00.png" height="102" width="600"><br></p> <p>&#24403;&#28982;&#22312;&#31532;&#19968;&#29256;&#30340;&#8220;&#20195;&#30721;&#25552;&#20132;&#8221;&#36825;&#19968;&#33410;&#65292;Martin&#20063;&#25552;&#21040;&#20102;&#26412;&#22320;&#26500;&#24314;&#30340;&#27010;&#24565;&#65292;&#21482;&#26159;&#19981;&#22914;&#31532;&#20108;&#29256;&#36825;&#20040;&#26126;&#30830;&#12290;</p> <h3><br>2) &#37197;&#32622;&#31649;&#29702;</h3> <p>Martin&#22312;&#31532;&#19968;&#29256;&#20013;&#26377;&#20004;&#22788;&#25552;&#21450;&#37197;&#32622;&#31649;&#29702;&#65292;&#20998;&#21035;&#26159;&#65306;&#21333;&#19968;&#20195;&#30721;&#28304;&#65288;Single Source Point&#65289;&#21644;&#20195;&#30721;&#25552;&#20132;&#65288;Checking  In&#65289;&#12290;&#31532;&#20108;&#29256;&#20013;&#21017;&#21253;&#25324;&#65306;&#36890;&#36807;&#25345;&#32493;&#38598;&#25104;&#26500;&#24314;&#29305;&#24615;&#65288;Building a Feature with Continuous  Integration&#65289;&#12289;&#21482;&#32500;&#25252;&#19968;&#20010;&#20195;&#30721;&#20179;&#24211;&#65288;Maintain a Single Source  Repository&#65289;&#12289;&#27599;&#20154;&#27599;&#22825;&#37117;&#35201;&#21521;&#20027;&#32447;&#25552;&#20132;&#20195;&#30721;&#65288;Everyone Commits To The Mainline Every  day&#65289;&#12289;&#27599;&#27425;&#25552;&#20132;&#37117;&#24212;&#22312;&#38598;&#25104;&#35745;&#31639;&#26426;&#19978;&#37325;&#26032;&#26500;&#24314;&#20027;&#32447;&#65288;Every Commit Should Build the Mainline on an  Integration Machine&#65289;&#12290;&#19981;&#20165;&#26465;&#30446;&#25968;&#37327;&#19978;&#22686;&#21152;&#26126;&#26174;&#65292;&#20316;&#32773;&#25552;&#20986;&#30340;&#24456;&#22810;&#23454;&#36341;&#37117;&#26159;&#22522;&#20110;&#37197;&#32622;&#31649;&#29702;&#26469;&#35762;&#30340;&#12290;</p> <h4>&#24037;&#20855;</h4> <p>&#37197;&#32622;&#31649;&#29702;&#26159;&#25345;&#32493;&#38598;&#25104;&#30340;&#36755;&#20837;&#12290;&#22312;&#31532;&#19968;&#29256;&#20013;&#20316;&#32773;&#25152;&#25512;&#33616;&#30340;&#37197;&#32622;&#31649;&#29702;&#24037;&#20855;&#26159;CVS&#65292;&#21040;&#31532;&#20108;&#29256;&#20013;&#20316;&#32773;&#25512;&#33616;&#30340;&#37197;&#32622;&#31649;&#29702;&#24037;&#20855;&#24050;&#32463;&#25442;&#25104;&#20102;SVN<a href="http://www.infoq.com/cn/articles/ci-theory-practice#FOOTNOTE-5">5</a>&#65288;&#21442;&#35265;&#31532;&#20108;&#37096;&#20998;&#20013;&#30340;&#37197;&#32622;&#31649;&#29702;&#24037;&#20855;&#37096;&#20998;&#65289;&#12290;</p> <h4>&#20998;&#25903;&#31574;&#30053;</h4> <p>&#23454;&#29616;&#36827;&#24230;&#19982;&#36136;&#37327;&#30340;&#24179;&#34913;&#26159;&#37197;&#32622;&#31649;&#29702;&#30340;&#37325;&#35201;&#30446;&#30340;&#12290;Martin&#22312;&#31532;&#20108;&#29256;&#20013;&#23545;&#28389;&#29992;&#20998;&#25903;&#32473;&#20986;&#20102;&#35686;&#21578;&#65306;</p> <blockquote>&#23613;&#37327;&#20943;&#23569;&#20998;&#25903;&#25968;&#37327;&#12290;&#20856;&#22411;&#30340;&#24773;&#20917;&#26159;&#20445;&#25345;&#19968;&#26465;&#20027;&#32447;&#65292;......&#65292;&#27599;&#20010;&#20154;&#37117;&#20174;&#36825;&#26465;&#20027;&#32447;&#24320;&#22987;&#33258;&#24049;&#30340;&#24037;&#20316;&#12290;&#65288;&#23545;&#20043;&#21069;&#21457;&#24067;&#29256;&#26412;&#36827;&#34892;Bug&#20462;&#27491;&#25110;&#32773;&#20020;&#26102;&#24615;&#30340;&#23454;&#39564;&#37117;&#26159;&#21019;&#24314;&#20998;&#25903;&#30340;&#27491;&#24403;&#29702;&#30001;&#12290;&#65289;</blockquote> <p>&#20294;&#26159;&#36825;&#37324;&#32473;&#20986;&#30340;&#24314;&#35758;&#23545;&#20110;&#22823;&#22411;&#22242;&#38431;&#26469;&#35828;&#24182;&#19981;&#21313;&#20998;&#21512;&#36866;&#12290;&#25105;&#20204;&#23558;&#22312;&#31532;&#20108;&#37096;&#20998;&#23545;&#20110;&#37197;&#32622;&#31649;&#29702;&#30340;&#20998;&#25903;&#31574;&#30053;&#36827;&#34892;&#35814;&#32454;&#25551;&#36848;&#12290;</p> <h4>&#20869;&#23481;</h4> <p>Martin&#22312;&#31532;&#19968;&#29256;&#20013;&#32473;&#20986;&#30340;&#21407;&#21017;&#26159;&#65306;</p> <blockquote>&#20219;&#20309;&#20154;&#37117;&#21487;&#20197;&#25214;&#21040;&#19968;&#21488;&#24178;&#20928;&#30340;&#26426;&#22120;&#65292;&#36830;&#19978;&#32593;&#65292;&#36890;&#36807;&#19968;&#20010;&#21629;&#20196;&#23601;&#21487;&#20197;&#21462;&#24471;&#35201;&#26500;&#24314;&#25152;&#24320;&#21457;&#30340;&#31995;&#32479;&#38656;&#35201;&#30340;&#25152;&#26377;&#28304;&#25991;&#20214;&#12290;</blockquote> <p>&#31532;&#20108;&#29256;&#20013;&#30340;&#21407;&#21017;&#22686;&#21152;&#20102;&#23545;&#26500;&#24314;&#30340;&#25903;&#25345;<a href="http://www.infoq.com/cn/articles/ci-theory-practice#FOOTNOTE-6">6</a>&#65306;</p> <blockquote>&#20219;&#20309;&#20154;&#37117;&#21487;&#20197;&#25214;&#21040;&#19968;&#21488;&#24178;&#20928;&#30340;&#26426;&#22120;&#65292;&#20570;&#19968;&#27425;&#21462;&#20986;&#65288;checkout&#65289;&#21160;&#20316;&#65292;&#28982;&#21518;&#23545;&#31995;&#32479;&#25191;&#34892;&#19968;&#27425;&#23436;&#25972;&#30340;&#26500;&#24314;&#12290;</blockquote> <h3>3) &#20998;&#38454;&#27573;&#26500;&#24314;&#65288;Staged Build&#65289;</h3> <p>&#20998;&#38454;&#27573;&#26500;&#24314;&#26159;Cruise&#65288;&#24050;&#32463;&#26356;&#21517;&#20026;Go&#65289;&#24341;&#20837;&#30340;&#37325;&#35201;&#27010;&#24565;&#12290;&#20854;&#20027;&#35201;&#30340;&#24847;&#20041;&#22312;&#20110;&#65306;</p> <ul><li>&#20998;&#31163;&#20851;&#27880;&#24230;&#19981;&#21516;&#30340;&#39564;&#35777;&#38454;&#27573;&#65292;&#27604;&#22914;Commit Build&#21644;Regression Tests&#65292;&#22242;&#38431;&#20250;&#23545;&#19981;&#21516;&#30340;&#39564;&#35777;&#38454;&#27573;&#37319;&#21462;&#19981;&#21516;&#30340;&#31574;&#30053;</li><li>&#26500;&#24314;&#27969;&#31243;&#21487;&#35270;&#21270;</li><li>&#36890;&#36807;&#20998;&#38454;&#27573;&#24182;&#21457;&#26500;&#24314;&#26469;&#32553;&#30701;&#21453;&#39304;&#21608;&#26399;</li></ul> <p>&#24403;&#26500;&#24314;&#30340;&#26102;&#38388;&#36807;&#38271;&#26102;&#65292;&#25105;&#20204;&#36890;&#24120;&#20250;&#35201;&#27714;&#24320;&#21457;&#20154;&#21592;&#21482;&#36816;&#34892;&#36895;&#24230;&#36739;&#24555;&#30340;&#20215;&#20540;&#36739;&#39640;&#30340;&#26500;&#24314;&#38454;&#27573;&#23601;&#21487;&#20197;&#32487;&#32493;&#33258;&#24049;&#30340;&#24320;&#21457;&#20219;&#21153;&#65292;&#32780;&#19981;&#24517;&#31561;&#24453;&#28459;&#38271;&#30340;&#27425;&#32423;&#26500;&#24314;&#23436;&#25104;&#12290;&#36825;&#37324;&#20316;&#32773;&#25552;&#21040;ThoughtWorks&#19981;&#21516;&#30340;&#22242;&#38431;&#26377;&#24456;&#22810;&#26377;&#36259;&#30340;&#23454;&#36341;&#65292;&#25105;&#20204;&#23558;&#22312;&#31532;&#20108;&#37096;&#20998;&#21521;&#35835;&#32773;&#20171;&#32461;&#20854;&#20013;&#30340;&#19968;&#37096;&#20998;&#12290;</p> <h3>&#25253;&#21578;</h3> <p>&#20316;&#32773;&#22312;&#31532;&#20108;&#29256;&#20013;&#19987;&#38376;&#25343;&#20986;&#19968;&#33410;&#8220;&#27599;&#20010;&#20154;&#37117;&#33021;&#30475;&#21040;&#36827;&#24230;&#65288;Everyone Can See What's Happening&#65289;&#8221;&#26469;&#20171;&#32461;&#26377;&#20851;&#25345;&#32493;&#38598;&#25104;&#25253;&#21578;&#30340;&#20869;&#23481;&#12290;&#22240;&#20026;&#65306;</p> <blockquote>&#25345;&#32493;&#38598;&#25104;&#30340;&#30446;&#30340;&#26159;&#20026;&#20102;&#27807;&#36890;&#12290;</blockquote> <p>&#36825;&#26159;&#31532;&#20108;&#29256;&#30456;&#23545;&#20110;&#31532;&#19968;&#29256;&#26469;&#35828;&#19968;&#20010;&#38750;&#24120;&#26126;&#26174;&#30340;&#21464;&#21270;&#12290;&#22312;&#31532;&#19968;&#29256;&#20013;&#36890;&#30693;&#30340;&#25163;&#27573;&#36824;&#20027;&#35201;&#26159;&#30005;&#23376;&#37038;&#20214;&#65292;&#23454;&#38469;&#19978;&#22312;&#20316;&#32773;&#25776;&#20889;&#31532;&#20108;&#29256;&#30340;&#26102;&#20505;&#65292;ThoughtWorks&#24050;&#32463;&#19981;&#36190;&#25104;&#23558;&#30005;&#23376;&#37038;&#20214;&#20316;&#20026;&#20027;&#35201;&#30340;&#25345;&#32493;&#38598;&#25104;&#36890;&#30693;&#24037;&#20855;&#20102;&#12290;&#26356;&#22909;&#30340;&#27807;&#36890;&#24037;&#20855;&#21253;&#25324;&#38899;&#20048;&#12289;&#29076;&#23721;&#28783;&#12289;&#26174;&#31034;&#22120;&#31561;&#12290;</p> <p>&#23545;&#20110;&#27807;&#36890;&#30340;&#37325;&#35270;&#20174;&#24037;&#20855;&#30340;&#35282;&#24230;&#20063;&#21487;&#20197;&#20307;&#29616;&#20986;&#26469;&#12290;Cruise  Control&#26368;&#20027;&#35201;&#20570;&#30340;&#20107;&#24773;&#26159;&#20219;&#21153;&#35843;&#24230;&#65292;&#22312;&#25253;&#21578;&#37096;&#20998;&#20570;&#30340;&#30456;&#23545;&#26469;&#35828;&#38750;&#24120;&#31895;&#31961;&#65292;&#27604;&#36739;&#26377;&#20215;&#20540;&#30340;&#25253;&#21578;&#22823;&#37096;&#20998;&#26159;&#20174;Cruise&#31227;&#26893;&#36807;&#21435;&#30340;&#12290;Cruise&#22312;&#20174;&#19968;&#24320;&#22987; &#23601;&#38750;&#24120;&#37325;&#35270;&#36825;&#19968;&#28857;&#65292;&#36890;&#36807;Cruise&#20320;&#21487;&#20197;&#38750;&#24120;&#28165;&#26224;&#22320;&#30693;&#36947;&#65292;&#20195;&#30721;&#21457;&#29983;&#20102;&#20160;&#20040;&#21464;&#21270;&#12289;&#27491;&#22312;&#36827;&#34892;&#30340;&#26500;&#24314;&#30340;&#29366;&#24577;&#21644;&#21382;&#21490;&#26500;&#24314;&#30340;&#29366;&#24577;&#12290;&#32593;&#39029;&#30340;&#24418;&#24335;&#23545;&#20110;&#20998;&#24067;&#24335;&#22242;&#38431;&#26469;&#35828;&#20855; &#26377;&#19981;&#21487;&#26367;&#20195;&#30340;&#20248;&#21183;&#12290;</p> <p>&#27491;&#22914;&#25105;&#20204;&#21069;&#38754;&#25152;&#35828;&#30340;&#65292;&#38899;&#20048;&#12289;&#29076;&#23721;&#28783;&#31561;&#29289;&#29702;&#25163;&#27573;&#65292;&#20855;&#26377;&#26356;&#24378;&#30340;&#20449;&#24687;&#36752;&#23556;&#33021;&#21147;&#12290;&#31449;&#36215;&#26469;&#24448;&#21608;&#22260;&#30475;&#19968;&#30475;&#23601;&#30693;&#36947;&#21738;&#20010;&#22242;&#38431;&#30340;&#26500;&#24314;&#25104;&#21151;&#20102;&#65292;&#21738;&#20010;&#22833;&#36133;&#20102;&#12290;</p> <h3>4) &#25345;&#32493;&#37096;&#32626;</h3> <p>&#25345;&#32493;&#38598;&#25104;&#23454;&#36341;&#26377;&#19968;&#20010;&#22522;&#26412;&#30340;&#24605;&#24819;&#23601;&#26159;&#65306;&#36234;&#26159;&#30171;&#33510;&#30340;&#20107;&#24773;&#65292;&#36234;&#35201;&#32463;&#24120;&#20570;&#12290;&#38598;&#25104;&#20043;&#21518;&#26356;&#20196;&#20154;&#24515;&#24778;&#32966;&#39076;&#30340;&#20107;&#24773;&#23601;&#26159;&#8212;&#8212;&#37096;&#32626;&#12290;&#37096;&#32626;&#21040;&#29983;&#20135;&#29615;&#22659;&#30340;&#27969;&#31243;&#36890;&#24120;&#35201;&#20005;&#26684;&#24471;&#22810;&#65292;&#28982;&#32780;&#25152;&#26377;&#30340;&#24037;&#20316;&#24517;&#39035;&#32463;&#21382;&#20102;&#29983;&#20135;&#29615;&#22659;&#30340;&#39564;&#35777;&#25165;&#31639;&#26159;&#25104;&#21151;&#30340;&#65292;&#25152;&#20197;&#8212;&#8212;&#25345;&#32493;&#37096;&#32626;&#25165;&#26159;&#29579;&#36947;&#12290;Martin&#22312;&#31532;&#20108;&#29256;&#20013;&#24314;&#35758;&#65306;</p> <blockquote>&#20320;&#24212;&#35813;&#26377;&#19968;&#20010;&#33050;&#26412;&#24110;&#21161;&#20320;&#24456;&#23481;&#26131;&#22320;&#23558;&#31995;&#32479;&#37096;&#32626;&#21040;&#29983;&#20135;&#29615;&#22659;&#20013;&#21435;&#12290;......&#21516;&#26102;&#35201;&#29305;&#21035;&#32771;&#34385;&#30340;&#26159;&#35201;&#33021;&#22815;&#33258;&#21160;&#22238;&#28378;&#12290;</blockquote> <h3>&#24341;&#20837;&#25345;&#32493;&#38598;&#25104;&#30340;&#24314;&#35758;</h3> <p>&#20316;&#32773;&#22312;&#31532;&#20108;&#29256;&#20013;&#29305;&#21035;&#32473;&#20986;&#20102;&#36880;&#27493;&#24341;&#20837;&#25345;&#32493;&#38598;&#25104;&#30340;&#24314;&#35758;&#12290;&#21253;&#25324;&#65306;</p> <blockquote> <ol><li>&#24341;&#20837;&#29256;&#26412;&#25511;&#21046;&#12290;</li><li>&#23454;&#29616;&#33258;&#21160;&#21270;&#26500;&#24314;&#12290;</li><li>&#28155;&#21152;&#33258;&#21160;&#21270;&#27979;&#35797;&#12290;</li><li>&#21152;&#24555;&#25552;&#20132;&#26500;&#24314;&#12290;</li><li>&#23547;&#25214;&#24110;&#21161;&#12290;&#65288;&#27604;&#22914;ThoughtWorks&#65289;</li></ol> </blockquote> <h2><br>&#31532;&#20108;&#37096;&#20998; &#25345;&#32493;&#38598;&#25104;&#39046;&#22495;&#30340;&#26032;&#36827;&#23637;</h2> <p>&#27491;&#22914;&#21069;&#25991;&#25152;&#35828;&#65292;ThoughtWorks&#20013;&#22269;&#20844;&#21496;&#22312;&#36807;&#21435;&#30340;&#20960;&#24180;&#37324;&#38754;&#23545;&#20110;&#25345;&#32493;&#38598;&#25104;&#23454;&#36341;&#21644;&#24110;&#21161;&#23458;&#25143;&#23454;&#26045;&#25345;&#32493;&#38598;&#25104;&#37117;&#31215;&#32047;&#20102;&#24456;&#22810;&#30340;&#32463;&#39564;&#65292;&#21516;&#26102;&#22312;&#29702;&#35770;&#20307;&#31995;&#26041;&#38754;&#20063;&#26356;&#21152;&#20016;&#23500;&#23436;&#25972;&#12290;&#36825;&#20063;&#20351;ThoughtWorks&#22312;&#36825;&#20010;&#39046;&#22495;&#32487;&#32493;&#20445;&#25345;&#20102;&#34892;&#19994;&#39046;&#20808;&#30340;&#20301;&#32622;&#12290;</p> <p>&#27491;&#22914;&#25105;&#20204;&#22312;&#31532;&#19968;&#37096;&#20998;&#35762;&#21040;&#30340;&#65292;&#25345;&#32493;&#38598;&#25104;&#19981;&#24212;&#35813;&#21482;&#20316;&#20026;&#19968;&#20010;&#23396;&#31435;&#30340;&#23454;&#36341;&#26469;&#24212;&#29992;&#12290;&#25105;&#20204;&#30340;&#32463;&#39564;&#34920;&#26126;&#22914;&#26524;&#21482;&#25226;&#25345;&#32493;&#38598;&#25104;&#20316;&#20026;&#19968;&#20010;&#23396;&#31435;&#30340;&#23454;&#36341;&#24212;&#29992;&#24456;&#38590;&#20174;&#25345;&#32493;&#38598;&#25104;&#38271;&#26399; &#21463;&#30410;&#12290;&#25345;&#32493;&#38598;&#25104;&#24448;&#24448;&#36827;&#20837;&#8220;&#38271;&#32418;&#8221;&#25110;&#32773;&#8220;&#38271;&#32511;&#8221;&#30340;&#19981;&#27491;&#24120;&#30340;&#29366;&#24577;&#12290;&#38271;&#32418;&#24847;&#21619;&#30528;&#31995;&#32479;&#38271;&#26399;&#26080;&#27861;&#38598;&#25104;&#65307;&#38271;&#32511;&#21017;&#24448;&#24448;&#24847;&#21619;&#30528;&#32570;&#23569;&#36275;&#22815;&#30340;&#39564;&#35777;&#12290;&#20026;&#20102;&#26415;&#35821;&#19978;&#30340;&#28548;&#28165;&#65292;&#25105;&#20204;&#26126;&#30830; &#22320;&#23558;&#25345;&#32493;&#38598;&#25104;&#30340;&#23450;&#20041;&#21306;&#20998;&#20026;&#29421;&#20041;&#30340;&#25345;&#32493;&#38598;&#25104;&#21644;&#24191;&#20041;&#30340;&#25345;&#32493;&#38598;&#25104;&#12290;</p> <blockquote>&#29421;&#20041;&#30340;&#25345;&#32493;&#38598;&#25104;&#65306;&#22522;&#20110;&#26576;&#31181;&#25110;&#32773;&#26576;&#20123;&#21464;&#21270;&#23545;&#31995;&#32479;&#36827;&#34892;&#30340;&#32463;&#24120;&#24615;&#30340;&#26500;&#24314;&#27963;&#21160;&#12290;</blockquote> <blockquote>&#24191;&#20041;&#30340;&#25345;&#32493;&#38598;&#25104;&#65306;&#36719;&#20214;&#24320;&#21457;&#22242;&#38431;&#22312;&#19978;&#36848;&#27963;&#21160;&#30340;&#32422;&#26463;&#19979;&#25152;&#37319;&#29992;&#30340;&#24320;&#21457;&#27969;&#31243;&#12290;</blockquote> <h3>1) &#29421;&#20041;&#30340;&#25345;&#32493;&#38598;&#25104;</h3> <p>&#19968;&#33324;&#26469;&#35828;&#65292;&#29421;&#20041;&#30340;&#25345;&#32493;&#38598;&#25104;&#21253;&#25324;&#22914;&#19979;&#20960;&#20010;&#26041;&#38754;&#65306;&#25345;&#32493;&#26816;&#26597;&#12289;&#25345;&#32493;&#32534;&#35793;&#65288;&#38142;&#25509;&#65289;&#12289;&#25345;&#32493;&#39564;&#35777;&#12289;&#25345;&#32493;&#37096;&#32626;&#12289;&#25345;&#32493;&#22522;&#30784;&#35774;&#26045;&#12289;&#25345;&#32493;&#25253;&#21578;&#31561;6&#20010;&#26041;&#38754;&#12290;</p> <h4>&#25345;&#32493;&#26816;&#26597;</h4> <p>&#25345;&#32493;&#26816;&#26597;&#30340;&#30446;&#30340;&#26159;&#20445;&#35777;&#20195;&#30721;&#39118;&#26684;&#19968;&#33268;&#65292;&#20027;&#35201;&#20851;&#27880;&#20110;&#20195;&#30721;&#30340;&#38745;&#24577;&#36136;&#37327;&#21644;&#20869;&#37096;&#36136;&#37327;&#65292;&#27604;&#22914;&#21464;&#37327;&#21629;&#21517;&#26041;&#24335;&#12289;&#22823;&#25324;&#21495;&#20301;&#32622;&#31561;&#31561;&#12290;&#22823;&#37096;&#20998;&#30340;&#29616;&#20195;&#38598;&#25104;&#24320;&#21457;&#29615;&#22659;&#65288;IDE&#65289; &#37117;&#20855;&#22791;&#23454;&#26102;&#26816;&#26597;&#20195;&#30721;&#36136;&#37327;&#30340;&#21151;&#33021;&#12290;&#20026;&#20102;&#20445;&#35777;&#20027;&#32447;&#19978;&#30340;&#20195;&#30721;&#36136;&#37327;&#33021;&#22815;&#36798;&#21040;&#19968;&#33268;&#30340;&#26631;&#20934;&#65292;&#24212;&#24403;&#22312;&#25345;&#32493;&#38598;&#25104;&#33050;&#26412;&#20013;&#21152;&#20837;&#38745;&#24577;&#26816;&#26597;&#38454;&#27573;&#12290;&#27604;&#22914;&#65292;Java&#30340;PMD&#12289;  FindBugs&#31561;&#31561;&#12290;</p> <h4>&#25345;&#32493;&#32534;&#35793;</h4> <p>&#25345;&#32493;&#32534;&#35793;&#26159;&#19968;&#20010;&#24456;&#26420;&#32032;&#30340;&#24819;&#27861;&#65292;&#23601;&#26159;&#20445;&#35777;&#20027;&#32447;&#19978;&#30340;&#20195;&#30721;&#22987;&#32456;&#22788;&#20110;&#21487;&#32534;&#35793;&#30340;&#29366;&#24577;&#12290;&#20294;&#26159;&#36825;&#23545;&#20110;&#24456;&#22810;&#22823;&#20013;&#22411;&#22242;&#38431;&#26469;&#35828;&#21364;&#24182;&#38750;&#24819;&#24403;&#28982;&#30340;&#31616;&#21333;&#12290;&#36825;&#26159;&#22240;&#20026;&#24456;&#22810;&#22242;&#38431;&#24182;&#26410; &#37319;&#29992;&#38598;&#20307;&#20195;&#30721;&#25152;&#26377;&#26435;&#31574;&#30053;&#65292;&#23548;&#33268;&#23384;&#22312;&#20381;&#36182;&#30340;&#22242;&#38431;&#30340;&#20195;&#30721;&#26080;&#27861;&#32534;&#35793;&#12290;&#38024;&#23545;&#36825;&#26679;&#30340;&#38382;&#39064;&#65292;&#19968;&#26041;&#38754;&#25105;&#20204;&#24314;&#35758;&#37319;&#29992;&#38598;&#20307;&#20195;&#30721;&#25152;&#26377;&#26435;&#65307;&#21478;&#19968;&#26041;&#38754;&#65292;&#23545;&#20110;&#30830;&#23454;&#22240;&#20026;&#23433;&#20840;&#21407;&#22240;&#38656;&#35201;&#38548; &#31163;&#30340;&#20195;&#30721;&#24212;&#35813;&#36793;&#30028;&#12289;&#26126;&#30830;&#25509;&#21475;&#65292;&#24456;&#23569;&#23384;&#22312;&#22823;&#37096;&#20998;&#20195;&#30721;&#38656;&#35201;&#23545;&#22823;&#37096;&#20998;&#20154;&#20445;&#23494;&#30340;&#24773;&#20917;&#12290;</p> <p>&#25345;&#32493;&#26816;&#26597;&#21644;&#25345;&#32493;&#32534;&#35793;&#26159;&#25345;&#32493;&#38598;&#25104;&#20013;&#26368;&#22522;&#26412;&#30340;&#39564;&#35777;&#25163;&#27573;&#12290;</p> <h4>&#25345;&#32493;&#39564;&#35777;</h4> <p>&#25345;&#32493;&#39564;&#35777;&#30340;&#30446;&#30340;&#26159;&#26816;&#26597;&#20027;&#32447;&#19978;&#30340;&#20195;&#30721;&#26159;&#21542;&#33021;&#22815;&#23454;&#29616;&#25152;&#35201;&#27714;&#30340;&#21151;&#33021;&#65292;&#25110;&#32773;&#24050;&#26377;&#30340;&#21151;&#33021;&#26159;&#21542;&#34987;&#30772;&#22351;&#12290;&#22312;&#22823;&#37096;&#20998;&#30340;&#26500;&#24314;&#20013;&#65292;&#39564;&#35777;&#37096;&#20998;&#26159;&#32791;&#26102;&#26368;&#38271;&#12289;&#25104;&#26412;&#26368;&#39640;&#30340;&#37096;&#20998;&#65292; &#20294;&#21516;&#26102;&#20063;&#26159;&#25910;&#30410;&#26368;&#22823;&#30340;&#37096;&#20998;&#12290;&#22312;&#36825;&#20010;&#38454;&#27573;&#65292;&#25105;&#20204;&#30475;&#21040;&#30340;&#20027;&#35201;&#38382;&#39064;&#26159;&#39564;&#35777;&#19981;&#20805;&#20998;&#21644;&#39564;&#35777;&#26102;&#38388;&#36807;&#38271;&#12290;&#38024;&#23545;&#36825;&#26679;&#30340;&#38382;&#39064;&#65292;&#25105;&#20204;&#36890;&#24120;&#37319;&#29992;&#20998;&#23618;&#20998;&#32423;&#30340;&#25345;&#32493;&#38598;&#25104;&#31574;&#30053;&#12290;&#21518;&#38754;&#26377;&#35814; &#32454;&#30340;&#25551;&#36848;&#12290;</p> <h4>&#25345;&#32493;&#37096;&#32626;</h4> <p>&#23545;&#20110;&#22823;&#22411;&#36719;&#20214;&#24212;&#29992;&#26469;&#35828;&#65292;&#37096;&#32626;&#24448;&#24448;&#26159;&#19968;&#20010;&#36153;&#26102;&#36153;&#21147;&#21448;&#23481;&#26131;&#20986;&#38169;&#30340;&#27493;&#39588;&#65292;&#22240;&#20026;&#36825;&#37324;&#38754;&#28041;&#21450;&#21040;&#25968;&#25454;&#36801;&#31227;&#12289;&#29256;&#26412;&#20860;&#23481;&#31561;&#21508;&#31181;&#26840;&#25163;&#30340;&#38382;&#39064;&#12290;&#25345;&#32493;&#37096;&#32626;&#30340;&#24605;&#24819;&#26159;&#23558;&#36825;&#20123;&#24037;&#20316;&#26631;&#20934;&#21270;&#33258;&#21160;&#21270;&#65292;&#20351;&#20854;&#33021;&#22815;&#21487;&#38752;&#22320;&#12289;&#33258;&#21160;&#22320;&#12289;&#24555;&#36895;&#22320;&#36816;&#34892;&#12290;&#25345;&#32493;&#37096;&#32626;&#26159;&#24403;&#21069;DevOps&#36816;&#21160;&#20013;&#30340;&#28909;&#38376;&#35805;&#39064;&#20043;&#19968;&#12290;</p> <h4>&#25345;&#32493;&#22522;&#30784;&#35774;&#26045;&#38598;&#25104;</h4> <p>&#29616;&#20195;&#22823;&#22411;&#36719;&#20214;&#24320;&#21457;&#65292;&#23588;&#20854;&#26159;&#20114;&#32852;&#32593;&#24212;&#29992;&#24320;&#21457;&#20013;&#32463;&#24120;&#20381;&#36182;&#20110;&#19968;&#20123;&#24120;&#35265;&#30340;&#22522;&#30784;&#35774;&#26045;&#8212;&#8212;&#27604;&#22914;Spring&#12289;Tomcat&#12289;Database&#31561;&#31561;&#12290;&#36825;&#20123;&#22522;&#30784;&#35774;&#26045;&#21457;&#29983;&#21464;&#21270;&#30340;&#26102;&#20505;&#65292;&#25105;&#20204;&#24212;&#24403;&#21450;&#26102;&#22320;&#35302;&#21457;&#25345;&#32493;&#38598;&#25104;&#65292;&#20197;&#30830;&#20445;&#25105;&#20204;&#30340;&#31995;&#32479;&#26159;&#33021;&#22815;&#19982;&#26032;&#30340;&#22522;&#30784;&#35774;&#26045;&#19968;&#36215;&#24037;&#20316;&#30340;&#12290;</p> <h4>&#25345;&#32493;&#25253;&#21578;</h4> <p>&#25253;&#21578;&#26159;&#23558;&#25345;&#32493;&#38598;&#25104;&#30340;&#29366;&#24577;&#20197;&#36866;&#24403;&#30340;&#24418;&#24335;&#23637;&#29616;&#32473;&#24178;&#31995;&#20154;&#30340;&#22522;&#26412;&#25163;&#27573;&#12290;&#25253;&#21578;&#26159;&#25345;&#32493;&#38598;&#25104;&#30340;&#26228;&#38632;&#34920;&#65292;&#25152;&#20197;&#23427;&#24517;&#39035;&#30452;&#35266;&#12289;&#26131;&#25026;&#65292;&#32780;&#19988;&#23545;&#20851;&#27880;&#28857;&#19981;&#21516;&#30340;&#35282;&#33394;&#23637;&#29616;&#19981;&#21516;&#30340;&#20869; &#23481;&#21644;&#31890;&#24230;&#12290;&#27604;&#22914;&#65292;&#24320;&#21457;&#20154;&#21592;&#21487;&#33021;&#26356;&#20851;&#24515;&#38169;&#35823;&#30340;&#26085;&#24535;&#65307;&#39033;&#30446;&#32463;&#29702;&#21487;&#33021;&#26356;&#20851;&#24515;&#27979;&#35797;&#35206;&#30422;&#29575;&#65307;&#20135;&#21697;&#32463;&#29702;&#21487;&#33021;&#26356;&#20851;&#24515;&#25345;&#32493;&#38598;&#25104;&#36890;&#36807;&#29575;&#30340;&#36235;&#21183;&#31561;&#31561;&#12290;</p> <h3>2) &#24191;&#20041;&#30340;&#25345;&#32493;&#38598;&#25104;&#21450;&#25345;&#32493;&#38598;&#25104;&#31574;&#30053;</h3> <p>&#24403;&#35201;&#25226;&#25345;&#32493;&#38598;&#25104;&#23454;&#36341;&#24212;&#29992;&#21040;&#22242;&#38431;&#30340;&#26102;&#20505;&#65292;&#26377;&#24456;&#22810;&#39069;&#22806;&#30340;&#25216;&#26415;&#25110;&#32773;&#38750;&#25216;&#26415;&#22240;&#32032;&#38656;&#35201;&#32771;&#34385;&#12290;</p> <h4>&#32452;&#32455;&#32467;&#26500;</h4> <p>&#25345;&#32493;&#38598;&#25104;&#26159;&#19968;&#20010;&#37325;&#35201;&#30340;&#27807;&#36890;&#24037;&#20855;&#65292;&#32780;&#24320;&#21457;&#36807;&#31243;&#20013;&#20004;&#20010;&#26368;&#38656;&#35201;&#32039;&#23494;&#27807;&#36890;&#30340;&#35282;&#33394;&#23601;&#26159;&#24320;&#21457;&#21644;&#27979;&#35797;&#12290;&#22312;&#25105;&#20204;&#24120;&#35265;&#30340;&#32452;&#32455;&#32467;&#26500;&#20013;&#24320;&#21457;&#21644;&#27979;&#35797;&#24448;&#24448;&#38582;&#23646;&#20110;&#19981;&#21516;&#30340;&#37096;&#38376;&#65292;&#29978; &#33267;&#36825;&#20123;&#37096;&#38376;&#38582;&#23646;&#20110;&#19981;&#21516;&#30340;&#39640;&#32423;&#32463;&#29702;&#12290;&#36825;&#24448;&#24448;&#20250;&#32473;&#25345;&#32493;&#38598;&#25104;&#30340;&#25512;&#24191;&#24102;&#26469;&#24456;&#22823;&#30340;&#38459;&#21147;&#12290;&#36825;&#26159;&#22240;&#20026;&#25345;&#32493;&#38598;&#25104;&#20174;&#29615;&#22659;&#25645;&#24314;&#21040;&#36816;&#34892;&#32500;&#25252;&#37117;&#38656;&#35201;&#20004;&#31181;&#35282;&#33394;&#30340;&#36890;&#21147;&#21512;&#20316;&#12290;&#25105;&#20204;&#30340;&#32463;&#39564; &#26159;&#36825;&#31867;&#28041;&#21450;&#21040;&#20154;&#21147;&#36164;&#28304;&#30340;&#20107;&#24773;&#38500;&#38750;&#26576;&#19968;&#32423;&#8220;&#20849;&#21516;&#30340;&#22823;&#32769;&#26495;&#8221;&#20986;&#38754;&#65292;&#21542;&#21017;&#26159;&#24456;&#38590;&#21327;&#35843;&#30340;&#12290;&#8220;&#20511;&#35843;&#8221;&#36825;&#26679;&#30340;&#26041;&#24335;&#24448;&#24448;&#19981;&#33021;&#20445;&#35777;&#25928;&#26524;&#12290;</p> <h4>&#27969;&#31243;</h4> <p>&#25918;&#21040;&#22242;&#38431;&#30340;&#35282;&#24230;&#30475;&#24453;&#27969;&#31243;&#24212;&#24403;&#26356;&#21152;&#20851;&#27880;&#20110;&#21508;&#20010;&#25104;&#21592;&#20043;&#38388;&#30340;&#37197;&#21512;&#12290;&#27599;&#20010;&#24320;&#21457;&#20154;&#21592;&#25552;&#20132;&#20195;&#30721;&#20043;&#21069;&#24212;&#24403;&#30830;&#20445;&#26159;&#32463;&#36807;&#26412;&#22320;&#26500;&#24314;&#30340;&#65307;&#24320;&#21457;&#20154;&#21592;&#22312;&#25552;&#20132;&#20043;&#21069;&#24212;&#35813;&#30830;&#35748;&#20027;&#32447;&#19978;&#30340;&#20195;&#30721;&#26159;&#36890;&#36807;&#20102;&#25345;&#32493;&#38598;&#25104;&#30340;&#65307;&#27979;&#35797;&#20154;&#21592;&#27979;&#35797;&#30340;&#29256;&#26412;&#24212;&#35813;&#26159;&#36890;&#36807;&#20102;&#26576;&#27425;&#25345;&#32493;&#38598;&#25104;&#30340;&#65292;&#24182;&#19988;&#26377;&#30456;&#24212;&#30340;&#20855;&#20307;&#29256;&#26412;&#20449;&#24687;&#12290;</p> <p>&#20026;&#20102;&#20445;&#38556;&#27969;&#31243;&#30340;&#39034;&#21033;&#25191;&#34892;&#65292;&#25105;&#20204;&#36824;&#32463;&#24120;&#37319;&#29992;&#25345;&#32493;&#38598;&#25104;&#30475;&#26495;&#12289;&#25552;&#20132;&#20196;&#29260;&#31561;&#36741;&#21161;&#25163;&#27573;&#12290;</p> <h4>&#29615;&#22659;</h4> <p>&#29615;&#22659;&#26159;&#25351;&#25345;&#32493;&#38598;&#25104;&#36816;&#34892;&#26102;&#25152;&#20381;&#36182;&#30340;&#36719;&#20214;&#21644;&#30828;&#20214;&#30340;&#38598;&#21512;&#12290;&#25105;&#20204;&#32463;&#24120;&#36935;&#21040;&#30340;&#19968;&#20010;&#38382;&#39064;&#26159;&#65292;&#36719;&#20214;&#22312;&#19968;&#21488;&#26426;&#22120;&#19978;&#33021;&#22815;&#36890;&#36807;&#25345;&#32493;&#38598;&#25104;&#30340;&#39564;&#35777;&#65292;&#32780;&#22312;&#21478;&#19968;&#21488;&#26426;&#22120;&#19978;&#21017;&#19981;&#33021;&#36890; &#36807;&#12290;&#36825;&#36890;&#24120;&#26159;&#22240;&#20026;&#25105;&#20204;&#23545;&#25345;&#32493;&#38598;&#25104;&#29615;&#22659;&#30340;&#23450;&#20041;&#19981;&#26126;&#30830;&#36896;&#25104;&#30340;&#12290;&#25152;&#20197;&#22312;&#25645;&#24314;&#25345;&#32493;&#38598;&#25104;&#21644;&#22312;&#32452;&#32455;&#20869;&#25512;&#24191;&#25345;&#32493;&#38598;&#25104;&#30340;&#26102;&#20505;&#65292;&#25105;&#20204;&#38656;&#35201;&#29305;&#21035;&#27880;&#24847;&#25345;&#32493;&#38598;&#25104;&#29615;&#22659;&#30340;&#26631;&#20934;&#21270;&#65292;&#26126;&#30830; &#25351;&#20986;&#25345;&#32493;&#38598;&#25104;&#36816;&#34892;&#26102;&#20381;&#36182;&#21738;&#20123;&#31532;&#19977;&#26041;&#24211;&#65292;&#26426;&#22120;&#37197;&#32622;&#22914;&#20309;&#65292;&#31471;&#21475;&#21644;&#32593;&#32476;&#29366;&#20917;&#22914;&#20309;&#31561;&#31561;&#12290;</p> <p>&#25105;&#20204;&#32463;&#24120;&#37319;&#29992;&#23558;&#25345;&#32493;&#38598;&#25104;&#29615;&#22659;&#21152;&#20837;&#37197;&#32622;&#31649;&#29702;&#30340;&#26041;&#24335;&#26469;&#35299;&#20915;&#29615;&#22659;&#26631;&#20934;&#21270;&#30340;&#38382;&#39064;&#12290;</p> <h4>&#20998;&#23618;</h4> <p>&#22312;&#22823;&#22411;&#22242;&#38431;&#65288;&#36229;&#36807;100&#20154;&#65289;&#20013;&#65292;&#25153;&#24179;&#30340;&#24320;&#21457;&#32452;&#32455;&#32467;&#26500;&#26159;&#36816;&#34892;&#36215;&#26469;&#26159;&#27604;&#36739;&#22256;&#38590;&#30340;&#12290;&#24120;&#35265;&#30340;&#20570;&#27861;&#26159;&#25353;&#29031;&#29305;&#24615;&#65292;&#23558;&#22242;&#38431;&#21010;&#20998;&#20026;10&#20154;&#24038;&#21491;&#30340;&#23567;&#22242;&#38431;&#12290;&#19968;&#33324;&#26469;&#35828;&#65292;&#22914; &#26524;&#22242;&#38431;&#25968;&#37327;&#36229;&#36807;10&#20010;&#65292;&#36824;&#20250;&#20877;&#22686;&#21152;&#19968;&#23618;&#26550;&#26500;&#12290;&#36825;&#26102;&#20505;&#65292;&#37197;&#32622;&#31649;&#29702;&#30340;&#31574;&#30053;&#20063;&#24212;&#24403;&#20570;&#20986;&#35843;&#25972;&#12290;&#24120;&#35265;&#30340;&#20570;&#27861;&#26159;&#20026;&#27599;&#20010;&#22242;&#38431;&#25289;&#20986;&#19968;&#20010;&#20998;&#25903;&#65292;&#35774;&#32622;&#19968;&#20010;&#38598;&#25104;&#20998;&#25903;&#29992;&#20110;&#23558;&#21508;&#20010;&#29305; &#24615;&#20998;&#25903;&#30340;&#20869;&#23481;&#25972;&#21512;&#22312;&#19968;&#36215;&#12290;&#38656;&#35201;&#27880;&#24847;&#30340;&#26159;&#65292;&#36825;&#37324;&#27599;&#20010;&#20998;&#25903;&#37117;&#24212;&#35813;&#20855;&#22791;&#25152;&#26377;&#20195;&#30721;&#30340;&#35775;&#38382;&#26435;&#38480;&#65292;&#20063;&#23601;&#26159;&#25152;&#26377;&#20998;&#25903;&#26159;&#21516;&#26681;&#30340;&#12289;&#31561;&#20215;&#30340;&#12290;</p><p><img alt="" src="http://images.cnblogs.com/cnblogs_com/itech/build/cc01.png" height="183" width="400">&#160;</p> <p><br></p> <p><strong><br></strong><a href="http://damonpoole.blogspot.com/2008/01/multi-stage-continuous-integration-part_05.html"><strong></strong></a></p> <h4>&#27979;&#35797;&#20998;&#32423;</h4> <p>&#22312;&#23454;&#26045;&#25345;&#32493;&#38598;&#25104;&#30340;&#26102;&#23545;&#20110;&#27979;&#35797;&#30340;&#31867;&#22411;&#24212;&#35813;&#26377;&#27604;&#36739;&#26126;&#30830;&#30340;&#23450;&#20041;&#12290;&#19968;&#33324;&#26469;&#35828;&#65292;&#25105;&#20204;&#32463;&#24120;&#25226;&#27979;&#35797;&#20998;&#20026;&#19977;&#32423;&#8212;&#8212;&#21333;&#20803;&#27979;&#35797;&#12289;&#38598;&#25104;&#27979;&#35797;&#21644;&#31995;&#32479;&#27979;&#35797;&#12290;&#36825;&#26159;&#19968;&#20010;&#24456;&#22823;&#30340;&#35805; &#39064;&#65292;&#36825;&#37324;&#21482;&#26159;&#35828;&#26126;&#27492;&#22788;&#30340;&#21333;&#20803;&#27979;&#35797;&#24182;&#19981;&#26159;&#25351;&#38024;&#23545;&#20989;&#25968;&#30340;&#27979;&#35797;&#12290;&#34429;&#28982;&#21333;&#20803;&#27979;&#35797;&#20027;&#35201;&#26159;&#20989;&#25968;&#22522;&#26412;&#30340;&#27979;&#35797;&#65292;&#20294;&#26159;&#27599;&#20010;&#21333;&#20803;&#27979;&#35797;&#24212;&#35813;&#38024;&#23545;&#30340;&#26159;&#29305;&#24615;&#25110;&#32773;&#23545;&#24212;&#20195;&#30721;&#22312;&#23454;&#29616;&#35813;&#29305;&#24615; &#19978;&#25152;&#21457;&#25381;&#30340;&#20316;&#29992;&#12290;</p> <p>&#21333;&#20803;&#27979;&#35797;&#30340;&#36816;&#34892;&#36895;&#24230;&#36890;&#24120;&#38750;&#24120;&#24555;&#65292;&#24212;&#35813;&#22312;&#25968;&#31186;&#21040;&#25968;&#20998;&#38047;&#12290;&#21333;&#20803;&#27979;&#35797;&#24212;&#35813;&#35206;&#30422;&#32477;&#22823;&#37096;&#20998;&#30340;&#29305;&#24615;&#38656;&#27714;&#12290;&#38598;&#25104;&#27979;&#35797;&#21333;&#20010;&#27979;&#35797;&#30340;&#36816;&#34892;&#36895;&#24230;&#36890;&#24120;&#20250;&#27604;&#21333;&#20803;&#27979;&#35797;&#24930;&#19968;&#20010;&#25968;&#37327; &#32423;&#65292;&#27604;&#22914;&#23384;&#22312;&#25991;&#20214;&#35835;&#20889;&#25110;&#32773;&#20854;&#20182;&#30340;IO&#21644;&#32593;&#32476;&#25805;&#20316;&#12290;&#38598;&#25104;&#27979;&#35797;&#20027;&#35201;&#29992;&#20110;&#20445;&#35777;&#31995;&#32479;&#30340;&#21508;&#20010;&#32452;&#20214;&#20043;&#38388;&#30340;&#35843;&#29992;&#26159;&#24037;&#20316;&#30340;&#12290;&#31995;&#32479;&#27979;&#35797;&#30340;&#36816;&#34892;&#36895;&#24230;&#19968;&#33324;&#20250;&#27604;&#38598;&#25104;&#27979;&#35797;&#24930;&#65292;&#36890;&#24120;&#38656; &#35201;&#23558;&#25972;&#20010;&#31995;&#32479;&#36816;&#34892;&#36215;&#26469;&#65292;&#27604;&#22914;Web&#24320;&#21457;&#20013;&#30340;selenium&#27979;&#35797;&#12290;&#31995;&#32479;&#27979;&#35797;&#20027;&#35201;&#29992;&#20110;&#27979;&#35797;&#31995;&#32479;&#30340;&#27491;&#30830;&#36335;&#24452;&#65288;Happy  Path&#65289;&#21487;&#20197;&#24037;&#20316;&#12290;&#26377;&#30340;&#22242;&#38431;&#20250;&#24320;&#21457;&#24456;&#22810;&#22522;&#20110;&#25972;&#20010;&#31995;&#32479;&#30340;&#22238;&#24402;&#27979;&#35797;&#65292;&#20063;&#23646;&#20110;&#31995;&#32479;&#27979;&#35797;&#12290;&#23601;&#22330;&#26223;&#30340;&#35206;&#30422;&#32780;&#35328;&#65292;&#21333;&#20803;&#27979;&#35797;&gt;&#38598;&#25104;&#27979;&#35797;&gt;&#31995;&#32479;&#27979;&#35797;&#65292;&#20174;&#36816;&#34892; &#26102;&#38388;&#26469;&#30475;&#21017;&#30456;&#21453;&#12290;</p> <p><img alt="" src="http://images.cnblogs.com/cnblogs_com/itech/build/cc02.png" height="427" width="436"><br></p> <h3>3) &#25345;&#32493;&#38598;&#25104;&#30340;&#25104;&#29087;&#24230;&#35780;&#20272;</h3> <p>&#22312;&#24110;&#21161;&#23458;&#25143;&#23454;&#26045;&#21644;&#25512;&#24191;&#25345;&#32493;&#38598;&#25104;&#30340;&#36807;&#31243;&#20013;&#25105;&#20204;&#36880;&#28176;&#24635;&#32467;&#20986;&#19968;&#20123;&#21407;&#21017;&#65292;&#24110;&#21161;&#23458;&#25143;&#35780;&#20272;&#29616;&#29366;&#65292;&#20998;&#26512;&#21644;&#35774;&#35745;&#26410;&#26469;&#30340;&#30446;&#26631;&#12290;&#35813;&#35780;&#20272;&#26041;&#27861;&#20511;&#37492;&#20102;ThoughtWorks&#25935;&#25463;&#25104;&#29087;&#24230;&#27169;&#22411;&#20013;&#26377;&#20851;&#37197;&#32622;&#31649;&#29702;&#12289;&#27979;&#35797;&#12289;&#26500;&#24314;&#31561;&#20869;&#23481;&#65292;&#24182;&#20570;&#20102;&#36866;&#24403;&#30340;&#31616;&#21270;&#12290;</p> <p>&#26500;&#24314;&#65306; </p>                           &#32423;&#21035;             <p>&#160;</p>                          &#25551;&#36848;             <p>&#160;</p>                                            3+&#65306;&#23545;&#22806;&#38450;&#24481;&#30340;             <p>&#160;</p>                          &#22242;&#38431;&#33021;&#22815;&#26681;&#25454;&#33258;&#24049;&#30340;&#38656;&#35201;&#65292;&#21327;&#35843;&#20854;&#20182;&#22242;&#38431;&#30340;&#25345;&#32493;&#38598;&#25104;&#65292;&#24403;&#20381;&#36182;&#30340;&#20854;&#20182;&#22242;&#38431;&#30340;&#20195;&#30721;&#21644;&#32452;&#20214;&#25110;&#32773;&#31532;&#19977;&#26041;&#24211;&#21644;&#22522;&#30784;&#35774;&#26045;&#21457;&#29983;&#25913;&#21464;&#26102;&#33258;&#21160;&#36827;&#34892;&#26500;&#24314;&#12290;&#22242;&#38431;&#23545;&#20110;&#22806;&#37096;&#20381;&#36182;&#30340;&#21487;&#38752;&#24615;&#26377;&#20449;&#24515;&#12290;             <p>&#160;</p>                                            3&#65306;&#23545;&#20869;&#38450;&#24481;&#30340;             <p>&#160;</p>                          &#26500;&#24314;&#26159;&#33258;&#21160;&#30340;&#12290;&#30001;&#27979;&#35797;&#21644;&#26816;&#26597;&#26469;&#20445;&#35777;&#22242;&#38431;&#20869;&#37096;&#30340;&#24320;&#21457;&#36136;&#37327;&#12290;&#25345;&#32493;&#38598;&#25104;&#30340;&#20462;&#22797;&#20855;&#26377;&#26368;&#39640;&#30340;&#20248;&#20808;&#32423;&#12290;&#22242;&#38431;&#23545;&#25345;&#32493;&#38598;&#25104;&#30340;&#32467;&#26524;&#26377;&#20449;&#24515;&#12290;             <p>&#160;</p>                                            2&#65306;&#39057;&#32321;&#30340;             <p>&#160;</p>                          &#26500;&#24314;&#26159;&#33258;&#21160;&#30340;&#65292;&#32780;&#19988;&#26500;&#24314;&#30340;&#36895;&#24230;&#36739;&#24555;&#12290;&#26500;&#24314;&#30340;&#35302;&#21457;&#26465;&#20214;&#26159;&#26126;&#30830;&#30340;&#65292;&#36890;&#24120;&#27599;&#27425;&#20195;&#30721;&#25552;&#20132;&#37117;&#20250;&#35302;&#21457;&#26500;&#24314;&#12290;&#22242;&#38431;&#20013;&#30340;&#27599;&#20010;&#20154;&#37117;&#20250;&#35302;&#21457;&#26500;&#24314;&#65292;&#24182;&#19988;&#20102;&#35299;&#26500;&#24314;&#30340;&#29366;&#24577;&#12290;             <p>&#160;</p>                                            1&#65306;&#37325;&#22797;&#25191;&#34892;             <p>&#160;</p>                          &#26500;&#24314;&#26159;&#33258;&#21160;&#30340;&#65292;&#20294;&#26159;&#25191;&#34892;&#30340;&#19981;&#22815;&#39057;&#32321;&#12290;&#26500;&#24314;&#30340;&#35302;&#21457;&#26159;&#38543;&#26426;&#30340;&#25110;&#32773;&#39057;&#29575;&#26159;&#38750;&#24120;&#20302;&#30340;&#65288;&#20302;&#20110;&#27599;&#22825;&#19968;&#27425;&#65289;&#12290;&#26500;&#24314;&#30340;&#36895;&#24230;&#36890;&#24120;&#38750;&#24120;&#24930;&#65292;&#27604;&#22914;&#19968;&#27425;&#26500;&#24314;&#36229;&#36807;&#21322;&#20010;&#23567;&#26102;&#12290;             <p>&#160;</p>                                            0&#65306;&#21487;&#37325;&#22797;&#30340;             <p>&#160;</p>                          &#20027;&#35201;&#20381;&#36182;&#20110;&#25163;&#21160;&#30340;&#26041;&#24335;&#26500;&#24314;&#36719;&#20214;&#65292;&#20294;&#26159;&#27599;&#27425;&#26500;&#24314;&#30340;&#26041;&#24335;&#37117;&#26159;&#30456;&#21516;&#30340;&#25110;&#32773;&#30456;&#20284;&#30340;&#12290;&#36890;&#24120;&#26377;&#30456;&#20851;&#30340;&#25991;&#26723;&#30340;&#25351;&#23548;&#12290;&#32463;&#24120;&#22242;&#38431;&#25351;&#23450;&#26576;&#20010;&#20154;&#36127;&#36131;&#26500;&#24314;&#36719;&#20214;&#65292;&#34429;&#28982;&#22823;&#37096;&#20998;&#20154;&#37117;&#33021;&#22815;&#20570;&#36825;&#20214;&#20107;&#24773;&#12290;             <p>&#160;</p>                                            -1&#65306;&#25163;&#21160;&#30340;             <p>&#160;</p>                          &#20027;&#35201;&#20381;&#36182;&#20110;&#25163;&#21160;&#30340;&#26041;&#24335;&#38598;&#25104;&#36719;&#20214;&#12290;&#27599;&#27425;&#38598;&#25104;&#30340;&#26041;&#24335;&#21487;&#33021;&#19981;&#19968;&#26679;&#12290;&#32463;&#24120;&#22242;&#38431;&#20013;&#21482;&#26377;&#20010;&#21035;&#20154;&#33021;&#22815;&#23558;&#36719;&#20214;&#38598;&#25104;&#36215;&#26469;&#12290;             <p>&#160;</p>                              <p>&#27979;&#35797;&#65306; </p>                           &#32423;&#21035;             <p>&#160;</p>                          &#25551;&#36848;             <p>&#160;</p>                                            3+&#65306;&#20840;&#38754;&#38598;&#25104;&#30340;             <p>&#160;</p>                          &#20840;&#22242;&#38431;&#23545;&#27979;&#35797;&#36127;&#36131;&#12290;&#27979;&#35797;&#39537;&#21160;&#25972;&#20010;&#24320;&#21457;&#36807;&#31243;&#12290;&#27979;&#35797;&#19982;&#26500;&#24314;&#23436;&#20840;&#38598;&#25104;&#12290;             <p>&#160;</p>                                            3&#65306;&#27979;&#35797;&#39537;&#21160;&#30340;             <p>&#160;</p>                          &#19994;&#21153;&#20998;&#26512;&#20154;&#21592;&#21644;&#24320;&#21457;&#20154;&#21592;&#22343;&#21442;&#19982;&#27979;&#35797;&#12290;&#27979;&#35797;&#22312;&#26500;&#24314;&#36807;&#31243;&#20013;&#33258;&#21160;&#25191;&#34892;&#12290;&#24320;&#21457;&#20154;&#21592;&#23454;&#36341;&#27979;&#35797;&#39537;&#21160;&#24320;&#21457;&#12290;             <p>&#160;</p>                                            2&#65306;&#38598;&#25104;&#30340;             <p>&#160;</p>                          &#24320;&#21457;&#20154;&#21592;&#21442;&#19982;&#27979;&#35797;&#12290;&#37096;&#20998;&#27979;&#35797;&#38598;&#25104;&#22312;&#26500;&#24314;&#36807;&#31243;&#20013;&#25191;&#34892;&#12290;&#22823;&#37096;&#20998;&#27979;&#35797;&#22312;&#36719;&#20214;&#24320;&#21457;&#36807;&#31243;&#20013;&#25191;&#34892;&#12290;             <p>&#160;</p>                                            1&#65306;&#20849;&#20139;&#30340;             <p>&#160;</p>                          &#24320;&#21457;&#20154;&#21592;&#21442;&#19982;&#27979;&#35797;&#12290;&#27979;&#35797;&#24182;&#26410;&#38598;&#25104;&#22312;&#26500;&#24314;&#36807;&#31243;&#20013;&#12290;&#37096;&#20998;&#27979;&#35797;&#22312;&#36719;&#20214;&#24320;&#21457;&#36807;&#31243;&#20013;&#25191;&#34892;&#65292;&#22823;&#37096;&#20998;&#27979;&#35797;&#22312;&#36719;&#20214;&#24320;&#21457;&#32467;&#26463;&#21518;&#25191;&#34892;&#12290;             <p>&#160;</p>                                            0&#65306;&#23457;&#26597;&#30340;             <p>&#160;</p>                          &#27979;&#35797;&#30001;&#19987;&#38376;&#30340;&#27979;&#35797;&#20154;&#21592;&#36127;&#36131;&#12290;&#26377;&#37096;&#20998;&#27979;&#35797;&#26159;&#22312;&#36719;&#20214;&#24320;&#21457;&#36807;&#31243;&#20013;&#25191;&#34892;&#12290;&#20294;&#22823;&#37096;&#20998;&#27979;&#35797;&#22312;&#36719;&#20214;&#24320;&#21457;&#32467;&#26463;&#21518;&#25191;&#34892;&#12290;             <p>&#160;</p>                                            -1&#65306;&#29420;&#31435;&#30340;             <p>&#160;</p>                          &#27979;&#35797;&#30001;&#19987;&#38376;&#30340;&#27979;&#35797;&#20154;&#21592;&#36127;&#36131;&#12290;&#20165;&#22312;&#36719;&#20214;&#24320;&#21457;&#32467;&#26463;&#21518;&#25191;&#34892;&#12290;             <p>&#160;</p>                              <p>&#37197;&#32622;&#31649;&#29702;&#65306; </p>                           &#32423;&#21035;             <p>&#160;</p>                          &#25551;&#36848;             <p>&#160;</p>                                            3+&#65306;&#20225;&#19994;&#32423;&#30340;             <p>&#160;</p>                          &#20225;&#19994;&#26377;&#32479;&#19968;&#30340;&#37197;&#32622;&#31649;&#29702;&#31574;&#30053;&#12290;             <p>&#160;</p>                                            3&#65306;&#36328;&#39033;&#30446;&#30340;             <p>&#160;</p>                          &#37197;&#32622;&#31649;&#29702;&#22312;&#22810;&#20010;&#39033;&#30446;&#20043;&#38388;&#21327;&#35843;&#12290;             <p>&#160;</p>                                            2&#65306;&#33258;&#21160;&#30340;             <p>&#160;</p>                          &#37197;&#32622;&#31649;&#29702;&#31574;&#30053;&#19982;&#25345;&#32493;&#38598;&#25104;&#31574;&#30053;&#32039;&#23494;&#32467;&#21512;&#65292;&#22242;&#38431;&#25104;&#21592;&#26377;&#39057;&#32321;&#25552;&#20132;&#30340;&#24847;&#35782;&#12290;&#19968;&#33324;&#37319;&#29992;&#20048;&#35266;&#38145;&#31574;&#30053;&#65292;&#21407;&#23376;&#25552;&#20132;&#12290;             <p>&#160;</p>                                            1&#65306;&#38598;&#25104;&#30340;             <p>&#160;</p>                          &#29256;&#26412;&#31649;&#29702;&#19979;&#30340;&#20869;&#23481;&#26159;&#21463;&#25511;&#30340;&#12290;&#36890;&#24120;&#22312;&#29256;&#26412;&#31649;&#29702;&#20013;&#30340;&#20195;&#30721;&#26159;&#21487;&#20197;&#32534;&#35793;&#30340;&#12290;&#24320;&#21457;&#20154;&#21592;&#33021;&#22815;&#35775;&#38382;&#21040;&#33258;&#24049;&#24037;&#20316;&#25152;&#38656;&#35201;&#30340;&#20195;&#30721;&#12290;&#24320;&#21457;&#20154;&#21592;&#25353;&#29031;&#19968;&#23450;&#30340;&#35268;&#21017;&#35775;&#38382;&#37197;&#32622;&#31649;&#29702;&#24037;&#20855;&#21644;&#25552;&#20132;&#20195;&#30721;&#12290;&#19968;&#33324;&#37319;&#29992;&#24754;&#35266;&#38145;&#31574;&#30053;&#12290;&#29256;&#26412;&#31649;&#29702;&#24037;&#20855;&#21644;&#26500;&#24314;&#36807;&#31243;&#38598;&#25104;&#22312;&#19968;&#36215;&#30340;&#12290;             <p>&#160;</p>                                            0&#65306;&#22522;&#26412;&#30340;             <p>&#160;</p>                          &#26377;&#22522;&#26412;&#30340;&#29256;&#26412;&#31649;&#29702;&#12290;&#20294;&#29256;&#26412;&#31649;&#29702;&#19979;&#30340;&#20869;&#23481;&#19981;&#20840;&#38754;&#65292;&#25110;&#32773;&#19981;&#36275;&#20197;&#25903;&#25745;&#22242;&#38431;&#30340;&#24320;&#21457;&#12290;             <p>&#160;</p>                                            -1&#65306;&#26080;&#37197;&#32622;&#31649;&#29702;             <p>&#160;</p>                          &#27809;&#26377;&#37197;&#32622;&#31649;&#29702;&#12290;&#25110;&#32773;&#20351;&#29992;&#26041;&#24335;&#23436;&#20840;&#38169;&#35823;&#12290;             <p>&#160;</p>                              <h3>4) &#24120;&#29992;&#23454;&#36341;&#21644;&#24037;&#20855;</h3> <h4>&#25345;&#32493;&#38598;&#25104;&#30475;&#26495;<a href="http://www.infoq.com/cn/articles/ci-theory-practice#FOOTNOTE-7">7</a></h4> <p><img alt="" src="http://images.cnblogs.com/cnblogs_com/itech/build/cc03.png" height="337" width="449"><br></p> <p><strong>&#38382;&#39064;&#65306;</strong></p> <p>&#25105;&#20204;&#38656;&#35201;&#35753;&#25972;&#20010;&#22242;&#38431;&#33021;&#22815;&#26041;&#20415;&#24555;&#25463;&#30340;&#20102;&#35299;&#25345;&#32493;&#38598;&#25104;&#30340;&#29366;&#24577;&#12290;</p> <p><strong>&#19978;&#19979;&#25991;&#65306;</strong></p> <p>&#22312;&#23436;&#25104;&#20102;&#22522;&#26412;&#30340;&#26500;&#24314;&#22522;&#30784;&#35774;&#26045;&#30340;&#25645;&#24314;&#20043;&#21518;&#65292;&#25105;&#20204;&#38656;&#35201;&#35753;&#22242;&#38431;&#25104;&#21592;&#21450;&#26102;&#33719;&#24471;&#25345;&#32493;&#38598;&#25104;&#30340;&#29366;&#24577;&#20449;&#24687;&#12290;&#20256;&#32479;&#30340;&#37038;&#20214;&#26041;&#24335;&#21487;&#33021;&#20250;&#20351;&#20154;&#21388;&#28902;&#65292;&#25110;&#32773;&#38169;&#36807;&#37325;&#35201;&#30340;&#26500;&#24314;&#20449;&#24687;&#12290;</p> <p><strong>&#35299;&#20915;&#26041;&#26696;&#21644;&#23454;&#29616;&#65306;</strong></p> <p>&#23433;&#35013;&#19968;&#20010;&#26174;&#31034;&#22120;&#65292;&#23558;&#26500;&#24314;&#30340;&#29366;&#24577;&#20449;&#24687;&#20197;&#31616;&#26126;&#30340;&#26041;&#24335;&#23637;&#31034;&#22312;&#26174;&#31034;&#22120;&#19978;&#12290;&#23558;&#26174;&#31034;&#22120;&#25918;&#32622;&#22312;&#22242;&#38431;&#25152;&#26377;&#25104;&#21592;&#37117;&#33021;&#22815;&#24456;&#23481;&#26131;&#30475;&#21040;&#30340;&#22320;&#26041;&#12290;</p> <h4>&#20010;&#20154;&#26500;&#24314;&#20013;&#24515;</h4> <p><strong>&#38382;&#39064;&#65306;</strong></p> <p>&#22312;&#26576;&#20123;&#24773;&#20917;&#19979;&#65292;&#26500;&#24314;&#29615;&#22659;&#30340;&#25104;&#26412;&#24456;&#39640;&#65292;&#32780;&#25105;&#20204;&#38656;&#35201;&#27599;&#19968;&#20010;&#24320;&#21457;&#20154;&#21592;&#25552;&#20132;&#20043;&#21069;&#23436;&#25104;&#19968;&#27425;&#20010;&#20154;&#26500;&#24314;&#12290;</p> <p><strong>&#19978;&#19979;&#25991;&#65306;</strong></p> <p>&#26377;&#20123;&#27979;&#35797;&#26159;&#20381;&#36182;&#20110;&#35774;&#22791;&#30340;&#65292;&#32780;&#36825;&#20123;&#35774;&#22791;&#38750;&#24120;&#26114;&#36149;&#65292;&#24182;&#19988;&#37197;&#32622;&#22797;&#26434;&#65292;&#25152;&#20197;&#26080;&#27861;&#32473;&#27599;&#20010;&#24320;&#21457;/&#27979;&#35797;&#20154;&#21592;&#19968;&#22871;&#26500;&#24314;&#29615;&#22659;&#12290;&#25105;&#20204;&#21457;&#29616;&#26681;&#25454;&#26412;&#22320;&#26500;&#24314;&#30340;&#29702;&#35770;&#27169;&#22411;&#65292;&#27599;&#20010;&#20154;&#30340;&#25552;&#20132;&#24212;&#35813;&#26159;&#20018;&#34892;&#30340;&#65292;&#36825;&#26679;&#25105;&#20204;&#23454;&#38469;&#19978;&#21487;&#20197;&#20570;&#21040;&#35753;&#36825;&#20123;&#20154;&#20849;&#20139;&#19968;&#22871;&#29615;&#22659;&#65292;&#20294;&#26159;&#20174;&#36923;&#36753;&#19978;&#23601;&#20687;&#26159;&#27599;&#20010;&#20154;&#26377;&#19968;&#22871;&#33258;&#24049;&#30340;&#29615;&#22659;&#19968;&#26679;&#12290;</p> <p><strong>&#35299;&#20915;&#26041;&#26696;&#65306;</strong></p> <p>&#22312;&#36816;&#34892;&#20010;&#20154;&#26500;&#24314;&#30340;&#26102;&#20505;&#23558;&#26412;&#22320;&#30340;&#20195;&#30721;&#21516;&#27493;&#21040;&#19968;&#21488;&#20849;&#20139;&#30340;&#26426;&#22120;&#19978;&#25191;&#34892;&#26500;&#24314;&#65292;&#26500;&#24314;&#23436;&#25104;&#21518;&#32467;&#26524;&#21453;&#39304;&#32473;&#25552;&#20132;&#36825;&#27425;&#20010;&#20154;&#26500;&#24314;&#30340;&#20154;&#12290;</p> <p><strong>&#23454;&#29616;&#65306;</strong></p> <p>&#20010;&#20154;&#26500;&#24314;&#20013;&#24515;&#30340;&#23454;&#29616;&#26377;&#24456;&#22810;&#31181;&#26041;&#26696;&#12290;&#36825;&#20123;&#26041;&#26696;&#30340;&#21306;&#21035;&#20027;&#35201;&#22312;&#20110;&#22914;&#20309;&#23558;&#20195;&#30721;&#21516;&#27493;&#21040;&#20010;&#20154;&#26500;&#24314;&#20013;&#24515;&#26381;&#21153;&#22120;&#19978;&#12290;&#20004;&#31181;&#24120;&#35265;&#30340;&#26041;&#24335;&#65306;&#19968;&#20010;&#26159;&#20351;&#29992;rsync&#25110;&#32773;&#31867;&#20284;&#26041;&#24335;&#21516;&#27493;&#65307;&#21478;&#19968;&#20010;&#26159;&#20351;&#29992;&#20998;&#24067;&#24335;&#37197;&#32622;&#31649;&#29702;&#24037;&#20855;&#22914;git/hg&#21516;&#27493;&#12290;&#20854;&#25299;&#25169;&#32467;&#26500;&#22914;&#19979;&#65306;</p> <p><img alt="" src="http://images.cnblogs.com/cnblogs_com/itech/build/cc04.png" height="179" width="400"><br></p> <p>&#31532;&#19968;&#31181;&#26041;&#24335;&#30456;&#23545;&#29420;&#31435;&#28789;&#27963;&#65307;&#31532;&#20108;&#31181;&#26041;&#24335;&#31283;&#23450;&#12289;&#39640;&#25928;&#65292;&#20294;&#26159;&#23545;&#20110;&#37197;&#32622;&#31649;&#29702;&#24037;&#20855;&#26377;&#20381;&#36182;&#12290;</p> <p><strong>&#21518;&#26524;&#65306;</strong></p> <p>&#20010;&#20154;&#26500;&#24314;&#20013;&#24515;&#33410;&#30465;&#20102;&#22823;&#37327;&#30340;&#35745;&#31639;&#36164;&#28304;&#65292;&#21516;&#26102;&#20063;&#23481;&#26131;&#20351;&#24471;&#20013;&#24515;&#26381;&#21153;&#22120;&#25104;&#20026;&#21333;&#28857;&#22833;&#36133;&#30340;&#28304;&#22836;&#12290;&#19968;&#26086;&#20013;&#24515;&#26381;&#21153;&#22120;&#20986;&#29616;&#38382;&#39064;&#65292;&#21487;&#33021;&#20250;&#23548;&#33268;&#22242;&#38431;&#30340;&#27969;&#31243;&#21463;&#21040;&#36739;&#22823;&#24433;&#21709;&#12290;</p> <h4>&#25552;&#20132;&#20196;&#29260;</h4> <p><strong>&#38382;&#39064;&#65306;</strong></p> <p>&#22312;&#23454;&#26045;&#26412;&#22320;&#26500;&#24314;&#30340;&#26102;&#20505;&#65292;&#21521;&#30446;&#26631;&#20998;&#25903;&#30340;&#25552;&#20132;&#24212;&#35813;&#26159;&#20018;&#34892;&#30340;&#65292;&#20197;&#36991;&#20813;&#26500;&#24314;&#34987;&#30772;&#22351;&#21518;&#38590;&#20197;&#23450;&#20301;&#38382;&#39064;&#26469;&#28304;&#12290;&#20294;&#26159;&#22242;&#38431;&#24448;&#24448;&#32570;&#20047;&#19968;&#31181;&#26377;&#25928;&#30340;&#26426;&#21046;&#26469;&#20445;&#35777;&#36825;&#31181;&#20018;&#34892;&#12290;</p> <p><strong>&#19978;&#19979;&#25991;&#65306;</strong></p> <p>&#26377;&#20123;&#22242;&#38431;&#35797;&#22270;&#36890;&#36807;&#25216;&#26415;&#30340;&#25163;&#27573;&#26469;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#65292;&#27604;&#22914;&#36890;&#36807;&#37197;&#32622;&#31649;&#29702;&#19978;&#30340;&#38145;&#26426;&#21046;&#65292;&#36825;&#31181;&#26041;&#24335;&#21644;&#20048;&#35266;&#38145;&#27169;&#24335;&#26377;&#36739;&#22823;&#20914;&#31361;&#12290;&#26377;&#20123;&#22242;&#38431;&#36890;&#36807;&#22242;&#38431;&#20869;&#37096;&#27807;&#36890;&#30340;&#26041;&#24335;&#35299;&#20915;&#65292; &#27604;&#22914;&#35841;&#25552; &#20132;&#20043;&#21069;&#37117;&#20250;&#36890;&#30693;&#21035;&#20154;&#65292;&#25110;&#32773;&#36890;&#36807;&#25345;&#32493;&#38598;&#25104;&#30417;&#35270;&#22120;&#26469;&#20102;&#35299;&#24403;&#21069;&#30340;&#26500;&#24314;&#29366;&#24577;&#65292;&#20197;&#20915;&#23450;&#33258;&#24049;&#26159;&#21542;&#21487;&#20197;&#25552;&#20132;&#12290;&#36825;&#20123;&#26041;&#24335;&#21508;&#33258;&#26377;&#21508;&#33258;&#30340;&#36866;&#29992;&#24773;&#24418;&#65292;&#36739;&#23481;&#26131;&#29702;&#35299;&#12290;</p> <p><strong>&#35299;&#20915;&#26041;&#26696;&#21644;&#23454;&#29616;&#65306;</strong></p> <p>&#20351;&#29992;&#19968;&#20010;&#23454;&#29289;&#20316;&#20026;&#20196;&#29260;&#65292;&#20934;&#22791;&#25552;&#20132;&#30340;&#20195;&#30721;&#30340;&#20154;&#39318;&#20808;&#21462;&#24471;&#20196;&#29260;&#65292;&#24403;&#20195;&#30721;&#25552;&#20132;&#23436;&#25104;&#65288;&#21253;&#25324;&#30456;&#24212;&#30340;&#25552;&#20132;&#26500;&#24314;&#65289;&#20043;&#21518;&#65292;&#23558;&#20196;&#29260;&#20132;&#36824;&#12290;&#20196;&#29260;&#35201;&#37266;&#30446;&#65292;&#24182;&#19988;&#31227;&#21160;&#26041;&#20415;&#12290;&#23567;&#22411;&#22870;&#26479;&#12289;&#27611;&#32466;&#29609;&#20855;&#12289;&#36739;&#22823;&#30340;&#22836;&#39280;&#65288;&#22914;&#19979;&#22270;&#65289;&#37117;&#26159;&#19981;&#38169;&#30340;&#20196;&#29260;&#12290;</p> <p><img alt="" src="http://images.cnblogs.com/cnblogs_com/itech/build/cc05.png" height="268" width="404"><br></p> <h4>&#20998;&#38454;&#27573;&#26500;&#24314;</h4> <p><strong>&#38382;&#39064;&#65306;</strong></p> <p>&#22312;&#26576;&#20123;&#22242;&#38431;&#20013;&#23436;&#25972;&#26500;&#24314;&#25152;&#33457;&#36153;&#30340;&#26102;&#38388;&#21487;&#33021;&#24456;&#38271;&#65292;&#22914;&#26524;&#27599;&#27425;&#25552;&#20132;&#37117;&#36816;&#34892;&#23436;&#25972;&#30340;&#26500;&#24314;&#20250;&#28010;&#36153;&#24456;&#22810;&#26102;&#38388;&#12290;</p> <p><strong>&#19978;&#19979;&#25991;&#65306;</strong></p> <p>&#38543;&#30528;&#25345;&#32493;&#38598;&#25104;&#30340;&#26085;&#30410;&#23436;&#21892;&#65292;&#25105;&#20204;&#24448;&#24448;&#20250;&#21457;&#29616;&#39564;&#35777;&#25152;&#33457;&#36153;&#30340;&#26102;&#38388;&#36234;&#26469;&#36234;&#38271;&#65292;&#32780;&#22823;&#37096;&#20998;&#39564;&#35777;&#36235;&#20110;&#31283;&#23450;&#65292;&#22833;&#36133;&#30340;&#24773;&#20917;&#24456;&#23569;&#35265;&#12290;&#36890;&#36807;&#25216;&#26415;&#25163;&#27573;&#32553;&#30701;&#26500;&#24314;&#26102;&#38388;&#26159;&#35299;&#20915;&#38382;&#39064;&#30340;&#26681;&#26412;&#21150;&#27861;&#65292;&#20294;&#26159;&#32553;&#30701;&#26500;&#24314;&#26102;&#38388;&#26159;&#19968;&#20010;&#32791;&#26102;&#32791;&#21147;&#30340;&#24037;&#20316;&#65292;&#24456;&#38590;&#30701;&#26399;&#20869;&#35265;&#25928;&#12290;</p> <p><strong>&#35299;&#20915;&#26041;&#26696;&#21644;&#23454;&#29616;&#65306;</strong></p> <p>&#23558;&#26500;&#24314;&#20998;&#20026;&#20960;&#20010;&#38454;&#27573;&#25191;&#34892;&#65292;&#22312;&#26412;&#22320;&#26500;&#24314;&#20013;&#20165;&#25191;&#34892;&#36895;&#24230;&#27604;&#36739;&#24555;&#12289;&#21487;&#20449;&#24230;&#27604;&#36739;&#39640;&#12289;&#20986;&#38169;&#27010;&#29575;&#27604;&#36739;&#22823;&#30340;&#39564;&#35777;&#12290;&#21033;&#29992;&#26202;&#19978;&#25110;&#32773;&#20854;&#20182;&#21512;&#36866;&#30340;&#26102;&#38388;&#25191;&#34892;&#20840;&#38754;&#30340;&#39564;&#35777;&#8212;&#8212;&#25105;&#20204;&#36825;&#27425;&#26500;&#24314;&#31216;&#20026;&#20840;&#37327;&#26500;&#24314;&#12290;&#38656;&#35201;&#27880;&#24847;&#30340;&#26159;&#65292;&#36825;&#31181;&#24773;&#20917;&#19979;&#20173;&#28982;&#35201;&#20445;&#35777;&#25552;&#20132;&#26500;&#24314;&#21644;&#26412;&#22320;&#26500;&#24314;&#30340;&#19968;&#33268;&#24615;&#12290;</p> <p><img alt="" src="http://images.cnblogs.com/cnblogs_com/itech/build/cc06.jpg" height="341" width="522"><br></p> <h4>iAnalysis</h4> <p>iAnalysis&#26159;&#19968;&#27454;&#36731;&#37327;&#32423;&#30340;&#25345;&#32493;&#38598;&#25104;&#25253;&#21578;&#24037;&#20855;&#12290;&#35813;&#24037;&#20855;&#30340;&#26680;&#24515;&#24605;&#24819;&#26159;&#23558;&#25345;&#32493;&#38598;&#25104;&#26500;&#24314;&#36807;&#31243;&#20013;&#20135;&#29983;&#30340;&#25968;&#25454;&#20197;&#36235;&#21183;&#21644;&#23545;&#27604;&#30340;&#26041;&#24335;&#23637;&#31034;&#20986;&#26469;&#12290;&#27491;&#22914;&#21069;&#25991;&#25152; &#35828;&#65292;&#25105;&#20204;&#22312;2009&#24180;&#30340;ThoughtWorks  Away-Day&#19978;&#35752;&#35770;&#20102;&#25935;&#25463;&#24230;&#37327;&#30340;&#35805;&#39064;&#65292;&#22823;&#23478;&#26368;&#21518;&#19968;&#33268;&#35748;&#20026;&#65292;&#25968;&#25454;&#26377;&#20004;&#31181;&#26368;&#22522;&#26412;&#30340;&#29992;&#27861;&#8212;&#8212;&#27178;&#21521;&#23545;&#27604;&#21644;&#32437;&#21521;&#23545;&#27604;&#12290;&#27178;&#21521;&#23545;&#27604;&#23601;&#26159;&#19981;&#21516;&#30340;&#20154;&#12289;&#19981;&#21516;&#30340;&#22242;&#38431;&#20043;&#38388;&#23545; &#27604;&#65307;&#32437;&#21521;&#23545;&#27604;&#23601;&#26159;&#29616;&#22312;&#21644;&#36807;&#21435;&#23545;&#27604;&#12290;iAnalysis&#27491;&#26159;&#36825;&#31181;&#24605;&#24819;&#30340;&#20307;&#29616;&#12290;</p> <p><img alt="" src="http://images.cnblogs.com/cnblogs_com/itech/build/cc07.png" height="507" width="526"><br></p> <p><strong>&#20851;&#20110;&#20316;&#32773;</strong></p> <p>&#32918;&#40527;&#65292;ThoughtWorks&#36164;&#28145;&#21672;&#35810;&#24072;&#65292;&#31243;&#24207;&#21592;&#65292;&#25935;&#25463;&#36807;&#31243;&#25945;&#32451;&#12290;&#25317;&#26377;7&#24180;&#20197;&#19978;&#36719;&#20214;&#24320;&#21457;&#23454;&#36341;&#32463;&#39564;&#65292;&#22810;&#27425;&#25285;&#20219;&#22823;&#20013;&#22411;&#20225;&#19994;&#25935;&#25463;&#27969;&#31243;&#25913;&#36827;&#21672;&#35810;&#21644;&#22521;&#35757;&#65292;&#26381; &#21153;&#23545;&#35937;&#28041;&#21450;&#36890;&#20449;&#35774;&#22791;&#21046;&#36896;&#12289;&#36890;&#20449;&#36816;&#33829;&#12289;&#20114;&#32852;&#32593;&#34892;&#19994;&#31561;&#12290;&#20182;&#20851;&#27880;&#20110;&#35774;&#35745;&#27169;&#24335;&#12289;&#26550;&#26500;&#27169;&#24335;&#12289;&#25935;&#25463;&#36719;&#20214;&#24320;&#21457;&#31561;&#39046;&#22495;&#65292;&#24182;&#33268;&#21147;&#20110;&#36719;&#20214;&#24320;&#21457;&#26368;&#20339;&#23454;&#36341;&#30340;&#25512;&#24191;&#21644;&#24212;&#29992;&#12290;&#20182;&#26366;&#21442;&#19982;&#32763; &#35793;&#12298;Visual Studio 2005&#25216;&#26415;&#22823;&#20840;&#12299;&#65292;&#20027;&#25345;&#32763;&#35793;&#12298;&#38754;&#21521;&#27169;&#24335;&#30340;&#36719;&#20214;&#26550;&#26500;&#12299;&#31532;&#22235;&#21367;&#21644;&#31532;&#20116;&#21367;&#31561;&#22270;&#20070;&#12290;</p>  <p>1  &#30446;&#21069;Cruise&#30340;&#24320;&#21457;&#20219;&#21153;&#24050;&#32463;&#19981;&#22312;&#20013;&#22269;&#20844;&#21496;&#20102;&#12290;</p> <p>2  &#23454;&#38469;&#19978;&#36825;&#31687;&#25991;&#31456;&#20171;&#32461;&#30340;&#26159;Matthew&#25152;&#22312;&#22242;&#38431;&#22312;2000&#24180;&#26089;&#20123;&#26102;&#20505;&#24050;&#32463;&#22312;&#20351;&#29992;&#30340;&#23454;&#36341;&#65292;ThoughtWorks&#20013;&#22269;&#20844;&#21496;&#30340;&#24635;&#32463;&#29702;&#37101;&#26195;&#20808;&#29983;&#24403;&#26102;&#20063;&#22312;&#36825;&#20010;&#22242; &#38431;&#12290;</p> <p>3  &#20026;&#20102;&#19982;ThoughtWorks&#24120;&#29992;&#30340;&#26415;&#35821;&#20445;&#25345;&#19968;&#33268;&#65292;&#37096;&#20998;&#26415;&#35821;&#19982;&#38647;&#38215;&#21644;&#29066;&#33410;&#21516;&#23398;&#25152;&#35793;&#30053;&#26377;&#24046;&#21035;&#65292;&#19979;&#21516;&#12290;</p> <p>4  &#31508;&#32773;&#23545;&#20854;&#26684;&#24335;&#30053;&#20316;&#22788;&#29702;&#65292;&#19982;&#21407;&#25991;&#31245;&#26377;&#20986;&#20837;&#12290;</p> <p>5  Martin&#26368;&#36817;&#22312;&#33258;&#24049;&#30340;&#19968;&#31687;&#21338;&#23458;&#19978;&#23545;&#20960;&#31181;&#27969;&#34892;&#30340;&#37197;&#32622;&#31649;&#29702;&#24037;&#20855;&#20570;&#20102;&#23545;&#27604;&#12290;</p> <p>6  &#27880;&#24847;&#65292;&#26412;&#25991;&#24182;&#38750;&#20026;&#25351;&#20986;&#31532;&#19968;&#29256;&#30340;&#32570;&#38519;&#65292;&#21482;&#26159;&#36890;&#36807;&#23545;&#27604;&#26469;&#35828;&#26126;&#20316;&#32773;&#35770;&#25991;&#20013;&#37325;&#28857;&#30340;&#21464;&#21270;&#12290;</p> <p>7  &#36825;&#37324;&#21482;&#26159;&#20511;&#29992;&#8220;&#30475;&#26495;&#8221;&#36825;&#20010;&#35789;&#30340;&#23383;&#38754;&#21547;&#20041;&#65292;&#19982;&#31934;&#30410;&#20013;&#30340;&#30475;&#26495;&#26377;&#21306;&#21035;&#12290;</p><p>&#160;</p><p>&#23436;&#65281; <br></p></div></body></html>