<!DOCTYPE html>
    <html lang="zh-cn">
    <head>
    <meta charset="utf-8"/>
    <title>
    <meta name="authors" content="" />持续集成（第二版）[来自：Martin Fowler]</title></head><body>From:<a href=http://www.cnblogs.com/itech/archive/2010/07/12/1775785.html>http://www.cnblogs.com/itech/archive/2010/07/12/1775785.html</a><br><br><div><h3>&#25345;&#32493;&#38598;&#25104;&#65288;&#31532;&#20108;&#29256;&#65289;</h3>                                          <p>&#20316;&#32773;&#65306;<a href="http://www.martinfowler.com/" target="_blank">Martin Fowler</a></p> <p>&#35793;&#32773;&#65306;<a href="http://www.georgelei.net/" target="_blank">&#38647;&#38215;</a> </p> <p><br> </p> <blockquote><p>&#25345;&#32493;&#38598;&#25104; &#26159;&#19968;&#31181;&#36719;&#20214;&#24320;&#21457;&#23454;&#36341;&#12290;&#22312;&#25345;&#32493;&#38598;&#25104;&#20013;&#65292;&#22242;&#38431;&#25104;&#21592;&#39057;&#32321;&#38598;&#25104;&#20182;&#20204;&#30340;&#24037;&#20316;&#25104;&#26524;&#65292;&#19968;&#33324;&#27599;&#20154;&#27599;&#22825;&#33267;&#23569;&#38598;&#25104;&#19968;&#27425;&#65292;&#20063;&#21487;&#20197;&#22810;&#27425;&#12290;&#27599;&#27425;&#38598;&#25104;&#20250;&#32463;&#36807;&#33258;&#21160;&#26500;&#24314;&#65288;&#21253;&#25324;&#33258;&#21160;&#27979;&#35797;&#65289;&#30340; &#26816;&#39564;&#65292;&#20197;&#23613;&#24555;&#21457;&#29616;&#38598;&#25104;&#38169;&#35823;&#12290;&#35768;&#22810;&#22242;&#38431;&#21457;&#29616;&#36825;&#31181;&#26041;&#27861;&#21487;&#20197;&#26174;&#33879;&#20943;&#23569;&#38598;&#25104;&#24341;&#36215;&#30340;&#38382;&#39064;&#65292;&#24182;&#21487;&#20197;&#21152;&#24555;&#22242;&#38431;&#21512;&#20316;&#36719;&#20214;&#24320;&#21457;&#30340;&#36895;&#24230;&#12290;&#36825;&#31687;&#25991;&#31456;&#31616;&#35201;&#20171;&#32461;&#20102;&#25345;&#32493;&#38598;&#25104;&#30340;&#25216;&#24039;&#21644;&#23427; &#26368;&#26032;&#30340;&#24212;&#29992;&#12290;</p> </blockquote> <p><br> </p> <p>&#26368;&#21518;&#26356;&#25913;&#20110;&#65306;<a href="http://www.martinfowler.com/articles/continuousIntegration.html#SignificantRevisions" target="_blank">2006&#24180;5&#26376;1&#26085;</a></p> <p><br> </p> <p>&#30446;&#24405;</p> <p><br>  </p> <p>&#29992;&#25345;&#32493;&#38598;&#25104;&#26500;&#24314;&#29305;&#24615;</p> <p>&#25345;&#32493;&#38598;&#25104;&#23454;&#36341;</p> <p>&#12288;&#12288;&#21482;&#32500;&#25252;&#19968;&#20010;&#28304;&#30721;&#20179;&#24211;</p> <p>&#12288;&#12288;&#33258;&#21160;&#21270; build</p>  <p>&#12288;&#12288;&#35753;&#20320;&#30340;build&#33258;&#34892;&#27979;&#35797;</p> <p>&#12288;&#12288;&#27599;&#20154;&#27599;&#22825;&#37117;&#35201;&#21521;mainline&#25552;&#20132;&#20195;&#30721;</p> <p>&#12288;&#12288;&#27599;&#27425;&#25552;&#20132;&#37117;&#24212;&#22312;&#38598;&#25104;&#35745;&#31639;&#26426;&#19978;&#37325;&#26032; &#26500;&#24314; mainline</p> <p>&#12288;&#12288;&#20445;&#25345;&#24555;&#36895; build</p> <p>&#12288;&#12288;&#22312;&#27169;&#25311;&#29983;&#20135;&#29615;&#22659;&#20013;&#36827;&#34892;&#27979;&#35797;</p> <p>&#12288;&#12288;&#35753;&#27599;&#20010;&#20154;&#37117;&#33021;&#36731;&#26131;&#33719; &#24471;&#26368;&#26032;&#30340;&#21487;&#25191;&#34892;&#25991;&#20214;</p> <p>&#12288;&#12288;&#27599;&#20010;&#20154;&#37117;&#33021;&#30475;&#21040;&#36827;&#24230;</p> <p>&#12288;&#12288;&#33258;&#21160;&#21270;&#37096;&#32626;</p> <p>&#25345;&#32493;&#38598;&#25104;&#30340;&#30410;&#22788;</p> <p>&#24341;&#20837;&#25345;&#32493;&#38598;&#25104;</p>  <p>&#26368;&#21518;&#30340;&#24605;&#32771;</p> <p>&#24310;&#20280;&#38405;&#35835;</p> <p><br> </p>&#25105;&#36824;&#21487;&#20197;&#29983;&#21160;&#35760;&#36215;&#31532;&#19968;&#27425;&#30475;&#21040;&#22823;&#22411;&#36719;&#20214;&#24037;&#31243;&#30340;&#24773;&#26223;&#12290;&#25105;&#24403;&#26102;&#22312;&#19968;&#23478;&#22823;&#22411;&#33521;&#22269;&#30005;&#23376;&#20844;&#21496;&#30340;QA&#37096;&#38376;&#23454;&#20064;&#12290;&#25105;&#30340;&#32463;&#29702;&#24102;&#25105;&#29087;&#24713;&#20844;&#21496;&#29615;&#22659;&#65292;&#25105;&#20204;&#36827;&#21040;&#19968;&#38388;&#24040;&#22823;&#30340;&#65292;&#20805;&#28385;&#20102;&#21387;&#25233;&#24863;&#21644;&#26684;&#23376;&#38388;&#30340;&#30340;&#20179;&#24211;&#12290;&#25105;&#34987;&#21578;&#30693;&#36825;&#20010;&#39033;&#30446;&#24050;&#32463; &#24320;&#21457;&#20102;&#22909;&#20960;&#24180;&#65292;&#29616;&#22312;&#27491;&#22312;&#38598;&#25104;&#38454;&#27573;&#65292;&#24182;&#24050;&#32463;&#38598;&#25104;&#20102;&#22909;&#20960;&#20010;&#26376;&#12290;&#25105;&#30340;&#21521;&#23548;&#36824;&#21578;&#35785;&#25105;&#27809;&#20154;&#30693;&#36947;&#38598;&#25104;&#35201;&#22810;&#20037;&#25165;&#33021;&#32467;&#26463;&#12290;&#20174;&#27492;&#25105;&#23398;&#21040;&#20102;&#36719;&#20214;&#24320;&#21457;&#30340;&#19968;&#20010;&#24815;&#20363;&#65306;&#38598;&#25104;&#26159;&#19968;&#20010;&#24456;&#32791; &#26102;&#24182;&#38590;&#20197;&#39044;&#27979;&#30340;&#36807;&#31243;&#12290;&#20294;&#26159;&#20107;&#23454;&#24182;&#38750;&#24635;&#26159;&#22914;&#27492;&#65292;&#25105;&#30340; ThoughWorks  &#21516;&#20107;&#25152;&#20570;&#30340;&#39033;&#30446;&#65292;&#20197;&#21450;&#24456;&#22810;&#20854;&#23427;&#36941;&#24067;&#19990;&#30028;&#21508;&#22320;&#30340;&#36719;&#20214;&#39033;&#30446;&#65292;&#37117;&#19981;&#20250;&#25226;&#38598;&#25104;&#24403;&#22238;&#20107;&#12290;&#20219;&#20309;&#19968;&#20010;&#24320;&#21457;&#32773;&#26412;&#22320;&#30340;&#20195;&#30721;&#21644;&#39033;&#30446;&#20849;&#20139;&#22522;&#20934;&#20195;&#30721;&#30340;&#24046;&#21035;&#20165;&#20165;&#21482;&#26377;&#20960;&#23567;&#26102;&#30340;&#24037;&#20316;&#32780;&#24050;&#65292;&#32780;&#19988;&#36825;&#21482;&#35201;&#20960;&#20998;&#38047;&#30340;&#26102;&#38388;&#23601;&#21487;&#20197;&#34987;&#38598;&#25104;&#22238;&#21435;&#12290;&#20219;&#20309;&#38598;&#25104;&#38169;&#35823;&#37117;&#21487;&#20197;&#24456;&#24555;&#34987;&#21457;&#29616;&#65292;&#24182;&#34987;&#24555;&#36895;&#20462;&#22797;&#12290;&#36825;&#40092;&#26126;&#30340;&#24046;&#21035;&#24182;&#38750;&#28304;&#20110;&#26114;&#36149;&#21644;&#22797;&#26434;&#30340;&#24037;&#20855;&#12290;&#20854;&#20013;&#30340;&#31934;&#21326;&#34164;&#21547;&#20110;&#19968;&#20010;&#31616;&#21333;&#30340;&#23454;&#36341;&#65306;&#20351;&#29992;&#32479;&#19968;&#30340;&#20195;&#30721;&#20179;&#24211;&#24182;&#39057;&#32321;&#38598;&#25104;&#65288;&#36890;&#24120;&#27599;&#22825;&#19968;&#27425;&#65289;&#12290; <p>&#25105;&#36824;&#21487;&#20197;&#29983;&#21160;&#35760;&#36215;&#31532;&#19968;&#27425;&#30475;&#21040;&#22823;&#22411;&#36719;&#20214;&#24037;&#31243;&#30340;&#24773;&#26223;&#12290;&#25105;&#24403;&#26102;&#22312;&#19968;&#23478;&#22823;&#22411;&#33521;&#22269;&#30005;&#23376;&#20844;&#21496;&#30340;QA&#37096;&#38376;&#23454;&#20064;&#12290;&#25105;&#30340;&#32463;&#29702;&#24102;&#25105;&#29087;&#24713;&#20844;&#21496;&#29615;&#22659;&#65292;&#25105;&#20204;&#36827;&#21040;&#19968;&#38388;&#24040;&#22823;&#30340;&#65292;&#20805;&#28385;&#20102;&#21387;&#25233;&#24863;&#21644;&#26684;&#23376;&#38388;&#30340;&#30340;&#20179;&#24211;&#12290;&#25105;&#34987;&#21578;&#30693;&#36825;&#20010;&#39033;&#30446;&#24050;&#32463; &#24320;&#21457;&#20102;&#22909;&#20960;&#24180;&#65292;&#29616;&#22312;&#27491;&#22312;&#38598;&#25104;&#38454;&#27573;&#65292;&#24182;&#24050;&#32463;&#38598;&#25104;&#20102;&#22909;&#20960;&#20010;&#26376;&#12290;&#25105;&#30340;&#21521;&#23548;&#36824;&#21578;&#35785;&#25105;&#27809;&#20154;&#30693;&#36947;&#38598;&#25104;&#35201;&#22810;&#20037;&#25165;&#33021;&#32467;&#26463;&#12290;&#20174;&#27492;&#25105;&#23398;&#21040;&#20102;&#36719;&#20214;&#24320;&#21457;&#30340;&#19968;&#20010;&#24815;&#20363;&#65306;&#38598;&#25104;&#26159;&#19968;&#20010;&#24456;&#32791; &#26102;&#24182;&#38590;&#20197;&#39044;&#27979;&#30340;&#36807;&#31243;&#12290;&#20294;&#26159;&#20107;&#23454;&#24182;&#38750;&#24635;&#26159;&#22914;&#27492;&#65292;&#25105;&#30340; ThoughWorks &#21516;&#20107;&#25152;&#20570;&#30340;&#39033;&#30446;&#65292;&#20197;&#21450;&#24456;&#22810;&#20854;&#23427;&#36941;&#24067;&#19990;&#30028;&#21508;&#22320;&#30340;&#36719;&#20214;&#39033;&#30446;&#65292;&#37117;&#19981;&#20250;&#25226;&#38598;&#25104;&#24403;&#22238;&#20107;&#12290;&#20219;&#20309;&#19968;&#20010;&#24320;&#21457;&#32773;&#26412;&#22320;&#30340;&#20195;&#30721;&#21644;&#39033;&#30446;&#20849;&#20139;&#22522;&#20934;&#20195;&#30721;&#30340;&#24046;&#21035;&#20165;&#20165;&#21482;&#26377;&#20960;&#23567;&#26102;&#30340;&#24037;&#20316;&#32780;&#24050;&#65292;&#32780;&#19988;&#36825;&#21482;&#35201;&#20960;&#20998;&#38047;&#30340;&#26102;&#38388;&#23601;&#21487;&#20197;&#34987;&#38598;&#25104;&#22238;&#21435;&#12290;&#20219;&#20309;&#38598;&#25104;&#38169;&#35823;&#37117;&#21487;&#20197;&#24456;&#24555;&#34987;&#21457;&#29616;&#65292;&#24182;&#34987;&#24555;&#36895;&#20462;&#22797;&#12290;&#36825;&#40092;&#26126;&#30340;&#24046;&#21035;&#24182;&#38750;&#28304;&#20110;&#26114;&#36149;&#21644;&#22797;&#26434;&#30340;&#24037;&#20855;&#12290;&#20854;&#20013;&#30340;&#31934;&#21326;&#34164;&#21547;&#20110;&#19968;&#20010;&#31616;&#21333;&#30340;&#23454;&#36341;&#65306;&#20351;&#29992;&#32479;&#19968;&#30340;&#20195;&#30721;&#20179;&#24211;&#24182;&#39057;&#32321;&#38598;&#25104;&#65288;&#36890;&#24120;&#27599;&#22825;&#19968;&#27425;&#65289;&#12290;</p><p><br> </p> <p>&#24403;&#25105;&#21521;&#21035;&#20154;&#20171;&#32461;&#25345;&#32493;&#38598;&#25104;&#26041;&#27861;&#26102;&#65292;&#20154;&#20204;&#36890;&#24120;&#20250;&#26377; &#20004;&#31181;&#21453;&#24212;&#65306;&#8220;&#36825;&#65288;&#22312;&#25105;&#20204;&#36825;&#20799;&#65289;&#19981;&#31649;&#29992;&#8221;&#21644;&#8220;&#20570;&#20102;&#20063;&#19981;&#21487;&#33021;&#26377;&#20160;&#20040;&#19981;&#21516;&#8221;&#12290;&#20294;&#22914;&#26524;&#20182;&#20204;&#30495;&#30340;&#35797;&#36807;&#20102;&#65292;&#23601;&#20250;&#21457;&#29616;&#25345;&#32493;&#38598;&#25104;&#20854;&#23454;&#27604;&#21548;&#36215;&#26469;&#35201;&#31616;&#21333;&#65292;&#24182;&#19988;&#33021;&#32473;&#24320;&#21457;&#36807;&#31243;&#24102;&#26469; &#24040;&#22823;&#30340;&#25913;&#21464;&#12290;&#22240;&#27492;&#31532;&#19977;&#31181;&#24120;&#35265;&#30340;&#21453;&#24212;&#26159;&#65306;&#8220;&#25105;&#20204;&#23601;&#26159;&#36825;&#20040;&#20570;&#30340;&#65292;&#20570;&#24320;&#21457;&#24590;&#21487;&#33021;&#19981;&#29992;&#23427;&#21602;&#65311;&#8221;</p> <p><br> </p> <p>&#8220;&#25345;&#32493;&#38598;&#25104;&#8221;&#19968;&#35789;&#26469;&#28304;&#20110; &#26497;&#38480;&#32534;&#31243;&#65288;Extreme Programming&#65289;&#65292;&#20316;&#20026;&#23427;&#30340;12&#20010;&#23454;&#36341;&#20043;&#19968;&#20986;&#29616;&#12290;&#24403;&#25105;&#24320;&#22987;&#22312; ThoughWorks  &#24320;&#22987;&#39038;&#38382;&#32844;&#19994;&#29983;&#28079;&#26102;&#65292;&#25105;&#40723;&#21169;&#25105;&#25152;&#21442;&#19982;&#30340;&#39033;&#30446;&#20351;&#29992;&#36825;&#31181;&#25216;&#24039;&#12290;Matthew Foemmel  &#23558;&#25105;&#25277;&#35937;&#30340;&#25351;&#23548;&#24605;&#24819;&#36716;&#21270;&#20026;&#20855;&#20307;&#30340;&#34892;&#21160;&#12290;&#25105;&#20204;&#30475;&#21040;&#20102;&#39033;&#30446;&#20174;&#23569;&#32780;&#32321;&#26434;&#30340;&#38598;&#25104;&#36827;&#27493;&#21040;&#25105;&#25152;&#25551;&#36848;&#30340;&#19981;&#24403;&#22238;&#20107;&#12290;Metthew&#21644;&#25105;&#23558;&#25105;&#20204;&#30340;&#32463;&#39564;&#20889;&#36827;&#20102;&#36825;&#31687;&#35770;&#25991;&#30340;&#31532;&#19968;&#29256; &#37324;&#12290;&#36825;&#31687;&#35770;&#25991;&#21518;&#26469;&#25104;&#20102;&#25105;&#32593;&#31449;&#37324;&#26368;&#21463;&#27426;&#36814;&#30340;&#25991;&#31456;&#20043;&#19968;&#12290;</p><p>&#160;</p>&#23613;&#31649;&#25345;&#32493;&#38598;&#25104;&#19981;&#38656;&#35201;&#20160;&#20040;&#29305;&#21035;&#30340;&#24037;&#20855;&#65292;&#25105;&#20204;&#21457;&#29616;&#20351;&#29992;&#19968;&#20010;&#25345;&#32493;&#38598;&#25104;&#26381;&#21153;&#22120;&#36719;&#20214;&#36824;&#26159;&#24456;&#26377;&#25928;&#26524; &#30340;&#12290;&#26368;&#20986;&#21517;&#30340;&#25345;&#32493;&#38598;&#25104;&#26381;&#21153;&#22120;&#36719;&#20214;&#26159; CruiseControl&#65292;&#36825;&#26159;&#19968;&#20010;&#24320;&#28304;&#24037;&#20855;&#65292;&#26368;&#26089;&#30001; ThoughWorks  &#30340;&#20960;&#20010;&#20154;&#24320;&#21457;&#65292;&#29616;&#22312;&#30001;&#31038;&#21306;&#32500;&#25252;&#12290;&#20043;&#21518;&#36824;&#26377;&#35768;&#22810;&#20854;&#20182;&#25345;&#32493;&#38598;&#25104;&#26381;&#21153;&#22120;&#36719;&#20214;&#20986;&#29616;&#65292;&#26377;&#20123;&#26159;&#24320;&#28304;&#30340;&#65292;&#26377;&#20123;&#21017;&#26159;&#21830;&#19994;&#36719;&#20214;&#65292;&#27604;&#22914; ThoughtWorks  Studio &#30340; <a></a><p>&#23613;&#31649;&#25345;&#32493;&#38598;&#25104;&#19981;&#38656;&#35201;&#20160;&#20040;&#29305;&#21035;&#30340;&#24037;&#20855;&#65292;&#25105;&#20204;&#21457;&#29616;&#20351;&#29992;&#19968;&#20010;&#25345;&#32493;&#38598;&#25104;&#26381;&#21153;&#22120;&#36719;&#20214;&#36824;&#26159;&#24456;&#26377;&#25928;&#26524; &#30340;&#12290;&#26368;&#20986;&#21517;&#30340;&#25345;&#32493;&#38598;&#25104;&#26381;&#21153;&#22120;&#36719;&#20214;&#26159; CruiseControl&#65292;&#36825;&#26159;&#19968;&#20010;&#24320;&#28304;&#24037;&#20855;&#65292;&#26368;&#26089;&#30001; ThoughWorks &#30340;&#20960;&#20010;&#20154;&#24320;&#21457;&#65292;&#29616;&#22312;&#30001;&#31038;&#21306;&#32500;&#25252;&#12290;&#20043;&#21518;&#36824;&#26377;&#35768;&#22810;&#20854;&#20182;&#25345;&#32493;&#38598;&#25104;&#26381;&#21153;&#22120;&#36719;&#20214;&#20986;&#29616;&#65292;&#26377;&#20123;&#26159;&#24320;&#28304;&#30340;&#65292;&#26377;&#20123;&#21017;&#26159;&#21830;&#19994;&#36719;&#20214;&#65292;&#27604;&#22914; ThoughtWorks Studio &#30340; <a href="http://studios.thoughtworks.com/cruise-continuous-integration" target="_blank">Cruise</a> </p><p><br> </p> <h2>&#29992;&#25345;&#32493;&#38598;&#25104;&#26500;&#24314;&#29305;&#24615;</h2> <p><br> </p>  <p>&#23545;&#25105;&#26469;&#35828;&#65292;&#35299;&#37322;&#25345;&#32493;&#38598;&#25104;&#26368;&#31616;&#21333;&#30340;&#26041;&#27861;&#23601;&#26159;&#29992;&#19968;&#20010;&#31616;&#21333;&#30340;&#20363;&#23376;&#26469;&#31034;&#33539;&#24320;&#21457;&#19968;&#20010;&#23567;  feature&#12290;&#29616;&#22312;&#20551;&#35774;&#25105;&#35201;&#23436;&#25104;&#19968;&#20010;&#36719;&#20214;&#30340;&#19968;&#37096;&#20998;&#21151;&#33021;&#65292;&#20855;&#20307;&#20219;&#21153;&#26159;&#20160;&#20040;&#24182;&#19981;&#37325;&#35201;&#65292;&#25105;&#20204;&#20808;&#20551;&#35774;&#36825;&#20010; feature  &#24456;&#23567;&#65292;&#21482;&#29992;&#20960;&#20010;&#23567;&#26102;&#23601;&#21487;&#20197;&#23436;&#25104;&#12290;&#65288;&#25105;&#20204;&#31245;&#21518;&#20250;&#30740;&#31350;&#26356;&#22823;&#30340;&#20219;&#21153;&#30340;&#24773;&#20917;&#12290;&#65289;</p> <p><br> </p> <p>&#19968;&#24320;&#22987;&#65292;&#25105;&#23558;&#24050;&#38598;&#25104;&#30340;&#28304;&#20195;&#30721;&#22797;&#21046;&#19968;&#20221;&#21040; &#26412;&#22320;&#35745;&#31639;&#26426;&#12290;&#36825;&#21487;&#20197;&#36890;&#36807;&#20174;&#28304;&#30721;&#31649;&#29702;&#31995;&#32479;&#30340; mainline &#19978; check out &#19968;&#20221;&#28304;&#20195;&#30721;&#20570;&#21040;&#12290;</p> <p><br> </p> <p>&#22914;&#26524; &#20320;&#29992;&#36807;&#20219;&#20309;&#28304;&#20195;&#30721;&#31649;&#29702;&#31995;&#32479;&#65292;&#29702;&#35299;&#19978;&#38754;&#30340;&#25991;&#23383;&#24212;&#35813;&#19981;&#25104;&#38382;&#39064;&#12290;&#20294;&#22914;&#26524;&#20320;&#27809;&#29992;&#36807;&#65292;&#21487;&#33021;&#20250;&#26377;&#35835;&#22825;&#20070;&#30340;&#24863;&#35273;&#12290;&#25152;&#20197;&#25105;&#20204;&#20808;&#24555;&#36895;&#35299;&#37322;&#19968;&#20010;&#36825;&#20123;&#27010;&#24565;&#12290;&#28304;&#20195;&#30721;&#31649;&#29702;&#31995;&#32479;&#23558;&#39033;&#30446; &#30340;&#25152;&#26377;&#28304;&#20195;&#30721;&#37117;&#20445;&#23384;&#22312;&#19968;&#20010;&#8220;&#20179;&#24211;&#65288;repository&#65289;&#8221;&#20013;&#12290;&#31995;&#32479;&#30340;&#24403;&#21069;&#29366;&#24577;&#36890;&#24120;&#34987;&#31216;&#20026;&#8220;mainline&#8221;&#12290;&#24320;&#21457;&#32773;&#38543;&#26102;&#37117;&#21487;&#20197;&#25226;mainline&#22797;&#21046; &#19968;&#20221;&#21040;&#20182;&#20204;&#33258;&#24049;&#30340;&#35745;&#31639;&#26426;&#65292;&#36825;&#20010;&#36807;&#31243;&#34987;&#31216;&#20026;&#8220;check out&#8221;&#12290;&#24320;&#21457;&#32773;&#35745;&#31639;&#26426;&#19978;&#30340;&#25335;&#36125;&#34987;&#31216;&#20026;&#8220;&#24037;&#20316;&#25335;&#36125;&#65288;working  copy&#65289;&#8221;&#12290;&#65288;&#32477;&#22823;&#37096;&#20998;&#24773;&#20917;&#19979;&#65292;&#20320;&#26368;&#32456;&#37117;&#20250;&#25226;&#24037;&#20316;&#25335;&#36125;&#30340;&#20869;&#23481;&#25552;&#20132;&#21040;mainline&#19978;&#21435;&#65292;&#25152;&#20197;&#20004;&#32773;&#23454;&#38469;&#19978;&#24212;&#35813;&#24046;&#19981;&#22810;&#12290;&#65289;</p> <p><br> </p>  <p>&#29616;&#22312;&#25105;&#25343;&#21040;&#20102;&#24037;&#20316;&#25335;&#36125;&#65292;&#25509;&#19979;&#26469;&#38656;&#35201;&#20570;&#19968;&#20123;&#20107;&#24773;&#26469;&#23436;&#25104;&#20219;&#21153;&#12290;&#36825;&#21253;&#25324;&#20462;&#25913;&#20135;&#21697;&#20195;&#30721;&#21644;&#28155;&#21152;&#20462;&#25913;&#33258;&#21160;&#21270;&#27979;&#35797;&#12290;&#22312;&#25345;&#32493;&#38598;&#25104;&#20013;&#65292;&#36719;&#20214;&#24212;&#35813;&#21253;&#21547;&#23436;&#21892;&#30340;&#21487;&#33258;&#21160;&#36816;&#34892; &#30340;&#27979;&#35797;&#65292;&#25105;&#31216;&#20043;&#20026;&#33258;&#27979;&#35797;&#20195;&#30721;&#12290;&#36825;&#19968;&#33324;&#38656;&#35201;&#29992;&#21040;&#26576;&#19968;&#20010;&#27969;&#34892;&#30340; XUnit &#27979;&#35797;&#26694;&#26550;&#12290;</p> <p><br> </p> <p>&#19968;&#26086;&#23436;&#25104;&#20102;&#20462;&#25913;&#65292;&#25105;&#23601;&#20250;&#22312; &#33258;&#24049;&#30340;&#35745;&#31639;&#26426;&#19978;&#21551;&#21160;&#19968;&#20010;&#33258;&#21160;&#21270; build&#12290;&#36825;&#20250;&#23558;&#25105;&#30340;&#24037;&#20316;&#25335;&#36125;&#20013;&#30340;&#28304;&#20195;&#30721;&#32534;&#35793;&#24182;&#38142;&#25509;&#25104;&#20026;&#19968;&#20010;&#21487;&#25191;&#34892;&#25991;&#20214;&#65292;&#24182;&#22312;&#20043;&#19978;&#36816;&#34892;&#33258;&#21160;&#21270;&#27979;&#35797;&#12290;&#21482;&#26377;&#24403;&#25152;&#26377;&#30340;  build &#21644;&#27979;&#35797;&#37117;&#23436;&#25104;&#24182;&#27809;&#26377;&#20219;&#20309;&#38169;&#35823;&#26102;&#65292;&#36825;&#20010; build &#36807;&#31243;&#25165;&#21487;&#20197;&#35748;&#20026;&#26159;&#25104;&#21151;&#30340;&#12290;</p> <p><br> </p> <p>&#24403;&#25105; build  &#25104;&#21151;&#21518;&#65292;&#25105;&#23601;&#21487;&#20197;&#32771;&#34385;&#23558;&#25913;&#21160;&#25552;&#20132;&#21040;&#28304;&#30721;&#20179;&#24211;&#12290;&#20294;&#40635;&#28902;&#30340;&#24773;&#20917;&#22312;&#20110;&#21035;&#20154;&#21487;&#33021;&#24050;&#32463;&#22312;&#25105;&#20043;&#21069;&#20462;&#25913;&#36807;  mainline&#12290;&#36825;&#26102;&#25105;&#38656;&#35201;&#39318;&#20808;&#25226;&#21035;&#20154;&#30340;&#20462;&#25913;&#26356;&#26032;&#21040;&#25105;&#30340;&#24037;&#20316;&#25335;&#36125;&#20013;&#65292;&#20877;&#37325;&#26032;&#20570;  build&#12290;&#22914;&#26524;&#21035;&#20154;&#30340;&#20195;&#30721;&#21644;&#25105;&#30340;&#26377;&#20914;&#31361;&#65292;&#23601;&#20250;&#22312;&#32534;&#35793;&#25110;&#27979;&#35797;&#30340;&#36807;&#31243;&#20013;&#24341;&#36215;&#38169;&#35823;&#12290;&#25105;&#26377;&#36131;&#20219;&#25913;&#27491;&#36825;&#20123;&#38382;&#39064;&#65292;&#24182;&#37325;&#22797;&#36825;&#19968;&#36807;&#31243;&#65292;&#30452;&#21040;&#25105;&#30340;&#24037;&#20316;&#25335;&#36125;&#33021;&#36890;&#36807;  build &#24182;&#21644; mainline &#30340;&#20195;&#30721;&#21516;&#27493;&#12290;</p> <p><br> </p> <p>&#19968;&#26086;&#25105;&#26412;&#22320;&#30340;&#20195;&#30721;&#33021;&#36890;&#36807; build&#65292;&#24182;&#21644;  mainline &#21516;&#27493;&#65292;&#25105;&#23601;&#21487;&#20197;&#25226;&#25105;&#30340;&#20462;&#25913;&#25552;&#20132;&#21040;&#28304;&#30721;&#20179;&#24211;&#12290;</p> <p><br> </p> <p>&#28982;&#32780;&#65292;&#25552;&#20132;&#23436;&#20195;&#30721;&#19981;&#34920;&#31034;&#23601;&#23436;&#20107;&#22823;&#21513;&#20102;&#12290;&#25105;&#20204;&#36824;&#35201; &#20570;&#19968;&#36941;&#38598;&#25104; build&#65292;&#36825;&#27425;&#22312;&#38598;&#25104;&#35745;&#31639;&#26426;&#19978;&#24182;&#35201;&#22522;&#20110; mainline &#30340;&#20195;&#30721;&#12290;&#21482;&#26377;&#36825;&#27425; build  &#25104;&#21151;&#20102;&#65292;&#25105;&#30340;&#20462;&#25913;&#25165;&#31639;&#21578;&#19968;&#27573;&#33853;&#12290;&#22240;&#20026;&#24635;&#26377;&#21487;&#33021;&#25105;&#24536;&#20102;&#20160;&#20040;&#19996;&#35199;&#22312;&#33258;&#24049;&#30340;&#26426;&#22120;&#19978;&#32780;&#27809;&#26377;&#26356;&#26032;&#21040;&#28304;&#30721;&#20179;&#24211;&#12290;&#21482;&#26377;&#25105;&#25552;&#20132;&#30340;&#25913;&#21160;&#34987;&#25104;&#21151;&#30340;&#38598;&#25104;&#20102;&#65292;&#25105;&#30340;&#24037;&#20316;&#25165;&#33021;&#32467;&#26463;&#12290;&#36825; &#21487;&#20197;&#30001;&#25105;&#25163;&#24037;&#36816;&#34892;&#65292;&#20063;&#21487;&#20197;&#30001; Cruise &#33258;&#21160;&#36816;&#34892;&#12290;</p> <p><br> </p> <p>&#22914;&#26524;&#20004;&#20010;&#24320;&#21457;&#32773;&#30340;&#20462;&#25913;&#23384;&#22312;&#20914;&#31361;&#65292;&#36825;&#36890;&#24120;&#20250;&#34987;&#31532;&#20108;&#20010;&#20154;&#25552; &#20132;&#20195;&#30721;&#21069;&#26412;&#22320;&#20570; build &#26102;&#21457;&#29616;&#12290;&#21363;&#20351;&#36825;&#26102;&#20389;&#24184;&#36807;&#20851;&#65292;&#25509;&#19979;&#26469;&#30340;&#38598;&#25104; build  &#20063;&#20250;&#22833;&#36133;&#25481;&#12290;&#19981;&#31649;&#24590;&#26679;&#65292;&#38169;&#35823;&#37117;&#20250;&#34987;&#24456;&#24555;&#26816;&#27979;&#20986;&#26469;&#12290;&#27492;&#26102;&#39318;&#35201;&#30340;&#20219;&#21153;&#23601;&#26159;&#25913;&#27491;&#38169;&#35823;&#24182;&#35753; build  &#24674;&#22797;&#27491;&#24120;&#12290;&#22312;&#25345;&#32493;&#38598;&#25104;&#29615;&#22659;&#37324;&#65292;&#20320;&#24517;&#39035;&#23613;&#21487;&#33021;&#24555;&#22320;&#20462;&#22797;&#27599;&#19968;&#20010;&#38598;&#25104; build&#12290;&#22909;&#30340;&#22242;&#38431;&#24212;&#35813;&#27599;&#22825;&#37117;&#26377;&#22810;&#20010;&#25104;&#21151;&#30340; build&#12290;&#38169;&#35823;&#30340; build  &#21487;&#20197;&#20986;&#29616;&#65292;&#20294;&#24517;&#39035;&#23613;&#24555;&#24471;&#21040;&#20462;&#22797;&#12290;</p> <p><br> </p> <p>&#36825;&#26679;&#20570;&#30340;&#32467;&#26524;&#26159;&#20320;&#24635;&#33021;&#24471;&#21040;&#19968;&#20010;&#31283;&#23450;&#30340;&#36719;&#20214;&#65292;&#23427;&#21487;&#33021;&#26377;&#19968;&#20123;  bug&#65292;&#20294;&#21487;&#20197;&#27491;&#24120;&#24037;&#20316;&#12290;&#27599;&#20010;&#20154;&#37117;&#22522;&#20110;&#30456;&#21516;&#30340;&#31283;&#23450;&#20195;&#30721;&#36827;&#34892;&#24320;&#21457;&#65292;&#32780;&#19988;&#19981;&#20250;&#31163;&#24471;&#22826;&#36828;&#65292;&#21542;&#21017;&#23601;&#20250;&#19981;&#24471;&#19981;&#33457;&#24456;&#38271;&#26102;&#38388;&#38598;&#25104;&#22238;&#21435;&#12290;Bug&#34987;&#21457;&#29616;&#24471;&#36234;&#24555;&#65292;&#33457;&#22312;&#25913;&#27491;&#19978;&#30340; &#26102;&#38388;&#23601;&#36234;&#30701;&#12290;</p> <p><br> </p> <h2>&#25345;&#32493;&#38598;&#25104;&#23454;&#36341;</h2> <p><br> </p> <p>&#20174;&#19978;&#38754;&#30340;&#25925;&#20107;&#25105;&#20204;&#22823;&#27010;&#20102;&#35299;&#20102;&#25345;&#32493;&#38598; &#25104;&#26159;&#22914;&#20309;&#22312;&#25105;&#20204;&#30340;&#26085;&#24120;&#24037;&#20316;&#20013;&#21457;&#25381;&#20316;&#29992;&#30340;&#12290;&#20294;&#35753;&#19968;&#20999;&#27491;&#24120;&#36816;&#34892;&#36215;&#26469;&#36824;&#38656;&#35201;&#25484;&#25569;&#26356;&#22810;&#30340;&#30693;&#35782;&#12290;&#25105;&#25509;&#19979;&#26469;&#20250;&#38598;&#20013;&#35762;&#35299;&#19968;&#19979;&#39640;&#25928;&#25345;&#32493;&#38598;&#25104;&#30340;&#20851;&#38190;&#23454;&#36341;&#12290;</p> <p><br>  </p> <h3>&#21482;&#32500;&#25252;&#19968;&#20010;&#28304;&#30721;&#20179;&#24211;</h3> <p><br> </p> <p>&#22312;&#36719;&#20214;&#39033;&#30446;&#37324;&#38656;&#35201;&#24456;&#22810;&#25991;&#20214;&#21327;&#35843;&#19968;&#33268;&#25165;&#33021; build  &#20986;&#20135;&#21697;&#12290;&#36319;&#36394;&#25152;&#26377;&#36825;&#20123;&#25991;&#20214;&#26159;&#19968;&#39033;&#22256;&#38590;&#30340;&#24037;&#20316;&#65292;&#23588;&#20854;&#26159;&#24403;&#26377;&#24456;&#22810;&#20154;&#19968;&#36215;&#24037;&#20316;&#26102;&#12290;&#25152;&#20197;&#65292;&#19968;&#28857;&#20063;&#19981;&#22855;&#24618;&#65292;&#36719;&#20214;&#24320;&#21457;&#32773;&#20204;&#36825;&#20123;&#24180;&#19968;&#30452;&#22312;&#30740;&#21457;&#36825;&#26041;&#38754;&#30340;&#24037;&#20855;&#12290;&#36825;&#20123;&#24037;&#20855;&#31216;&#20026; &#28304;&#20195;&#30721;&#31649;&#29702;&#24037;&#20855;&#65292;&#25110;&#37197;&#32622;&#31649;&#29702;&#65292;&#25110;&#29256;&#26412;&#31649;&#29702;&#31995;&#32479;&#65292;&#25110;&#28304;&#30721;&#20179;&#24211;&#65292;&#25110;&#21508;&#31181;&#20854;&#23427;&#21517;&#23383;&#12290;&#22823;&#37096;&#20998;&#24320;&#21457;&#39033;&#30446;&#20013;&#23427;&#20204;&#26159;&#19981;&#21487;&#20998;&#21106;&#30340;&#19968;&#37096;&#20998;&#12290;&#20294;&#21487;&#24796;&#30340;&#26159;&#65292;&#24182;&#38750;&#25152;&#26377;&#39033;&#30446;&#37117;&#26159;&#22914; &#27492;&#12290;&#34429;&#28982;&#24456;&#32597;&#35265;&#65292;&#20294;&#25105;&#30830;&#23454;&#21442;&#21152;&#36807;&#19968;&#20123;&#39033;&#30446;&#65292;&#23427;&#20204;&#30452;&#25509;&#25226;&#20195;&#30721;&#23384;&#21040;&#26412;&#22320;&#39537;&#21160;&#22120;&#21644;&#20849;&#20139;&#30446;&#24405;&#20013;&#65292;&#20081;&#24471;&#19968;&#22604;&#31946;&#28034;&#12290;</p> <p><br> </p> <p>&#25152;&#20197;&#65292; &#20316;&#20026;&#19968;&#20010;&#26368;&#22522;&#26412;&#30340;&#35201;&#27714;&#65292;&#20320;&#24517;&#39035;&#26377;&#19968;&#20010;&#36215;&#30721;&#30340;&#28304;&#20195;&#30721;&#31649;&#29702;&#31995;&#32479;&#12290;&#25104;&#26412;&#19981;&#20250;&#26159;&#38382;&#39064;&#65292;&#22240;&#20026;&#26377;&#24456;&#22810;&#20248;&#31168;&#30340;&#24320;&#28304;&#24037;&#20855;&#21487;&#29992;&#12290;&#24403;&#21069;&#36739;&#22909;&#30340;&#24320;&#28304;&#24037;&#20855;&#26159; <a href="http://subversion.tigris.org/" target="_blank">Subversion</a>&#12290;&#65288;&#26356; &#32769;&#30340;&#21516;&#26679;&#24320;&#28304;&#30340; <a href="http://www.nongnu.org/cvs/" target="_blank">CVS</a> &#20173;&#34987;&#24191;&#27867;&#20351;&#29992;&#65292;&#21363;&#20351;&#26159; CVS &#20063;&#27604;&#20160;&#20040;&#37117;&#19981;&#29992;&#24378;&#24471;&#22810;&#65292;&#20294; Subversion  &#26356;&#20808;&#36827;&#20063;&#26356;&#24378;&#22823;&#12290;&#65289;&#26377;&#36259;&#30340;&#26159;&#65292;&#25105;&#20174;&#19982;&#24320;&#21457;&#32773;&#20204;&#30340;&#20132;&#35848;&#20013;&#20102;&#35299;&#21040;&#65292;&#24456;&#22810;&#21830;&#19994;&#28304;&#20195;&#30721;&#31649;&#29702;&#24037;&#20855;&#20854;&#23454;&#19981;&#27604; Subversion  &#26356;&#22909;&#12290;&#21482;&#26377;&#19968;&#20010;&#21830;&#19994;&#36719;&#20214;&#26159;&#22823;&#23478;&#19968;&#33268;&#21516;&#24847;&#20540;&#24471;&#33457;&#38065;&#30340;&#65292;&#36825;&#23601;&#26159; <a href="http://www.perforce.com/" target="_blank">Perforce</a>&#12290;</p> <p><br>  </p> <p>&#19968;&#26086;&#20320;&#26377;&#20102;&#28304;&#20195;&#30721;&#31649;&#29702;&#31995;&#32479;&#65292;&#20320;&#35201;&#30830;&#20445;&#25152;&#26377;&#20154;&#37117;&#30693;&#36947;&#21040;&#21738;&#37324;&#21435;&#21462;&#20195;&#30721;&#12290;&#19981;&#24212;&#20986;&#29616;&#36825;&#26679;&#30340;&#38382;&#39064;&#65306;&#8220;&#25105;&#24212;&#35813;&#21040;&#21738;&#37324;&#21435;&#25214;xxx&#25991;&#20214;&#65311;&#8221;  &#25152;&#26377;&#19996;&#35199;&#37117;&#24212;&#35813;&#23384;&#22312;&#28304;&#30721;&#20179;&#24211;&#37324;&#12290;</p> <p><br> </p> <p>&#21363;&#20415;&#23545;&#20110;&#29992;&#20102;&#28304;&#30721;&#20179;&#24211;&#30340;&#22242;&#38431;&#65292;&#25105;&#36824;&#26159;&#35266;&#23519;&#21040;&#19968;&#20010;&#24456;&#26222;&#36941;&#30340;&#38169;&#35823;&#65292;&#23601;&#26159;&#20182;&#20204;&#27809;&#26377;&#25226; &#25152;&#26377;&#19996;&#35199;&#37117;&#25918;&#22312;&#28304;&#30721;&#20179;&#24211;&#37324;&#12290;&#19968;&#33324;&#20154;&#20204;&#37117;&#20250;&#25226;&#20195;&#30721;&#25918;&#36827;&#21435;&#65292;&#20294;&#36824;&#26377;&#35768;&#22810;&#20854;&#23427;&#25991;&#20214;&#65292;&#21253;&#25324;&#27979;&#35797;&#33050;&#26412;&#65292;&#37197;&#32622;&#25991;&#20214;&#65292;&#25968;&#25454;&#24211;Schema&#65292;&#23433;&#35013;&#33050;&#26412;&#65292;&#36824;&#26377;&#31532;&#19977;&#26041;&#30340;&#24211;&#65292;&#25152; &#26377;&#36825;&#20123;build&#26102;&#38656;&#35201;&#30340;&#25991;&#20214;&#37117;&#24212;&#35813;&#25918;&#22312;&#28304;&#30721;&#20179;&#24211;&#37324;&#12290;&#25105;&#30693;&#36947;&#19968;&#20123;&#39033;&#30446;&#29978;&#33267;&#25226;&#32534;&#35793;&#22120;&#20063;&#25918;&#21040;&#28304;&#30721;&#20179;&#24211;&#37324;&#65288;&#29992;&#26469;&#23545;&#20184;&#26089;&#24180;&#38388;&#37027;&#20123;&#33707;&#21517;&#20854;&#22937;&#30340;C++&#32534;&#35793;&#22120;&#24456;&#26377;&#25928;&#65289;&#12290; &#19968;&#20010;&#22522;&#26412;&#21407;&#21017;&#26159;&#65306;&#20320;&#24517;&#39035;&#33021;&#22815;&#22312;&#19968;&#21488;&#24178;&#20928;&#30340;&#35745;&#31639;&#26426;&#19978;&#37325;&#20570;&#25152;&#26377;&#36807;&#31243;&#65292;&#21253;&#25324;checkout&#21644;&#23436;&#20840;build&#12290;&#21482;&#26377;&#26497;&#23569;&#37327;&#30340;&#36719;&#20214;&#38656;&#35201;&#34987;&#39044;&#35013;&#22312;&#36825;&#21488;&#24178;&#20928;&#26426;&#22120;&#19978;&#65292;&#36890; &#24120;&#26159;&#37027;&#20123;&#21448;&#22823;&#21448;&#31283;&#23450;&#65292;&#23433;&#35013;&#36215;&#26469;&#24456;&#22797;&#26434;&#30340;&#36719;&#20214;&#65292;&#27604;&#22914;&#25805;&#20316;&#31995;&#32479;&#65292;Java&#24320;&#21457;&#29615;&#22659;&#65292;&#25110;&#25968;&#25454;&#24211;&#31995;&#32479;&#12290;</p> <p><br> </p> <p>&#20320;&#24517;&#39035;&#25226; build&#38656;&#35201;&#30340;&#25152;&#26377;&#25991;&#20214;&#37117;&#25918;&#36827;&#28304;&#20195;&#30721;&#31649;&#29702;&#31995;&#32479;&#65292;&#27492;&#22806;&#36824;&#35201;&#25226;&#20154;&#20204;&#24037;&#20316;&#38656;&#35201;&#30340;&#20854;&#20182;&#19996;&#35199;&#20063;&#25918;&#36827;&#21435;&#12290;IDE&#37197;&#32622;&#25991;&#20214;&#23601;&#24456;&#36866;&#21512;&#25918;&#36827;&#21435;&#65292;&#22240;&#20026;&#22823;&#23478;&#20849;&#20139;&#21516;&#26679;&#30340;IDE&#37197; &#32622;&#21487;&#20197;&#35753;&#24037;&#20316;&#26356;&#31616;&#21333;&#12290;</p> <p><br> </p> <p>&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#30340;&#20027;&#35201;&#21151;&#33021;&#20043;&#19968;&#23601;&#26159;&#21019;&#24314; branch  &#20197;&#31649;&#29702;&#24320;&#21457;&#27969;&#12290;&#36825;&#26159;&#20010;&#24456;&#26377;&#29992;&#30340;&#21151;&#33021;&#65292;&#29978;&#33267;&#21487;&#20197;&#35828;&#26159;&#19968;&#20010;&#22522;&#30784;&#29305;&#24615;&#65292;&#20294;&#23427;&#21364;&#32463;&#24120;&#34987;&#28389;&#29992;&#12290;&#20320;&#26368;&#22909;&#36824;&#26159;&#23613;&#37327;&#23569;&#29992;&#160;branch&#12290;&#19968;&#33324;&#26377;&#19968;&#20010;mainline&#23601;&#22815; &#20102;&#65292;&#36825;&#26159;&#19968;&#26465;&#33021;&#21453;&#26144;&#39033;&#30446;&#24403;&#21069;&#24320;&#21457;&#29366;&#20917;&#30340;&#160;branch&#12290;&#22823;&#37096;&#20998;&#24773;&#20917;&#19979;&#65292;&#22823;&#23478;&#37117;&#24212;&#35813;&#20174;mainline&#20986;&#21457;&#24320;&#22987;&#33258;&#24049;&#30340;&#24037;&#20316;&#12290;&#65288;&#21512;&#29702;&#30340;&#21019;&#24314;&#160;branch&#160;&#30340; &#29702;&#30001;&#20027;&#35201;&#21253;&#25324;&#32473;&#24050;&#21457;&#24067;&#30340;&#20135;&#21697;&#20570;&#32500;&#25252;&#21644;&#20020;&#26102;&#24615;&#30340;&#23454;&#39564;&#12290;&#65289;</p> <p><br> </p> <p>&#19968;&#33324;&#26469;&#35828;&#65292;&#20320;&#35201;&#25226;build&#20381;&#36182;&#30340;&#25152;&#26377;&#25991;&#20214;&#25918;&#36827;&#20195;&#30721;&#31649;&#29702; &#31995;&#32479;&#20013;&#65292;&#20294;&#19981;&#35201;&#25918;build&#30340;&#32467;&#26524;&#12290;&#26377;&#20123;&#20154;&#20064;&#24815;&#25226;&#26368;&#32456;&#20135;&#21697;&#20063;&#37117;&#25918;&#36827;&#20195;&#30721;&#31649;&#29702;&#31995;&#32479;&#20013;&#65292;&#25105;&#35748;&#20026;&#36825;&#26159;&#19968;&#31181;&#22351;&#21619;&#36947;&#8212;&#8212;&#36825;&#24847;&#21619;&#30528;&#21487;&#33021;&#26377;&#19968;&#20123;&#28145;&#23618;&#27425;&#30340;&#38382;&#39064;&#65292;&#24456;&#21487;&#33021;&#26159;&#26080; &#27861;&#21487;&#38752;&#22320;&#37325;&#26032;build&#19968;&#20010;&#20135;&#21697;&#12290;</p> <p><br> </p> <h3>&#33258;&#21160;&#21270;build</h3> <p><br> </p> <p>&#36890;&#24120;&#26469; &#35828;&#65292;&#30001;&#28304;&#20195;&#30721;&#36716;&#21464;&#25104;&#19968;&#20010;&#21487;&#36816;&#34892;&#30340;&#31995;&#32479;&#26159;&#19968;&#20010;&#22797;&#26434;&#30340;&#36807;&#31243;&#65292;&#29301;&#25199;&#21040;&#32534;&#35793;&#65292;&#31227;&#21160;&#25991;&#20214;&#65292;&#23558; schema  &#35013;&#36733;&#21040;&#25968;&#25454;&#24211;&#65292;&#35832;&#22914;&#27492;&#31867;&#12290;&#20294;&#26159;&#65292;&#21516;&#36719;&#20214;&#24320;&#21457;&#20013;&#30340;&#20854;&#23427;&#31867;&#20284;&#20219;&#21153;&#19968;&#26679;&#65292;&#36825;&#20063;&#21487;&#20197;&#34987;&#33258;&#21160;&#21270;&#65292;&#20063;&#24517;&#39035;&#34987;&#33258;&#21160;&#21270;&#12290;&#35201;&#20154;&#24037;&#26469;&#38190;&#20837;&#21508;&#31181;&#22855;&#24618;&#30340;&#21629;&#20196;&#21644;&#28857;&#20987;&#21508;&#31181;&#23545;&#35805;&#26694;&#32431;&#31929;&#26159; &#28010;&#36153;&#26102;&#38388;&#65292;&#20063;&#23481;&#26131;&#28363;&#29983;&#38169;&#35823;&#12290;</p> <p><br> </p> <p>&#22312;&#22823;&#37096;&#20998;&#24320;&#21457;&#24179;&#21488;&#19978;&#37117;&#33021;&#25214;&#21040;&#33258;&#21160;&#21270; build &#29615;&#22659;&#30340;&#24433;&#23376;&#12290;&#27604;&#22914;  make&#65292;&#36825;&#22312; Unix &#31038;&#21306;&#24050;&#32463;&#29992;&#20102;&#20960;&#21313;&#24180;&#20102;&#65292;Java &#31038;&#21306;&#20063;&#24320;&#21457;&#20986;&#20102; Ant&#65292;.NET &#31038;&#21306;&#20197;&#21069;&#29992; Nant&#65292;&#29616;&#22312;&#29992;  MSBuild&#12290;&#19981;&#31649;&#20320;&#22312;&#20160;&#20040;&#24179;&#21488;&#19978;&#65292;&#37117;&#35201;&#30830;&#20445;&#21482;&#29992;&#19968;&#26465;&#21629;&#20196;&#23601;&#21487;&#20197;&#36816;&#34892;&#36825;&#20123;&#33050;&#26412;&#65292;&#20174;&#32780; build &#24182;&#36816;&#34892;&#31995;&#32479;&#12290;</p> <p><br> </p> <p>&#19968; &#20010;&#24120;&#35265;&#30340;&#38169;&#35823;&#26159;&#27809;&#26377;&#25226;&#25152;&#26377;&#20107;&#37117;&#25918;&#36827;&#33258;&#21160;&#21270; build&#12290;&#27604;&#22914;&#65306;Build &#20063;&#24212;&#35813;&#21253;&#25324;&#20174;&#28304;&#30721;&#20179;&#24211;&#20013;&#21462;&#20986;&#25968;&#25454;&#24211; schema  &#24182;&#22312;&#25191;&#34892;&#29615;&#22659;&#20013;&#35774;&#32622;&#30340;&#36807;&#31243;&#12290;&#25105;&#35201;&#37325;&#30003;&#19968;&#19979;&#21069;&#38754;&#35828;&#36807;&#30340;&#21407;&#21017;&#65306;&#20219;&#20309;&#20154;&#37117;&#24212;&#35813;&#33021;&#20174;&#19968;&#20010;&#24178;&#20928;&#30340;&#35745;&#31639;&#26426;&#19978; check out  &#28304;&#20195;&#30721;&#65292;&#28982;&#21518;&#25970;&#20837;&#19968;&#26465;&#21629;&#20196;&#65292;&#23601;&#21487;&#20197;&#24471;&#21040;&#33021;&#22312;&#36825;&#21488;&#26426;&#22120;&#19978;&#36816;&#34892;&#30340;&#31995;&#32479;&#12290;</p> <p><br> </p> <p>Build  &#33050;&#26412;&#26377;&#24456;&#22810;&#19981;&#21516;&#30340;&#36873;&#25321;&#65292;&#20381;&#23427;&#20204;&#25152;&#23646;&#30340;&#24179;&#21488;&#21644;&#31038;&#21306;&#32780;&#23450;&#65292;&#20294;&#20063;&#27809;&#26377;&#20160;&#20040;&#23450;&#21183;&#12290;&#23613;&#31649;&#22823;&#37096;&#20998;&#30340; Java &#39033;&#30446;&#37117;&#29992; Ant&#65292;&#36824;&#26159;&#26377;&#19968;&#20123;&#39033;&#30446;&#29992;  Ruby&#65288;Ruby Rake &#26159;&#19968;&#20010;&#19981;&#38169;&#30340; build &#33050;&#26412;&#24037;&#20855;&#65289;&#12290;&#25105;&#20204;&#20063;&#26366;&#32463;&#29992; Ant &#33258;&#21160;&#21270;&#26089;&#26399;&#30340; Microsoft COM  &#39033;&#30446;&#65292;&#20107;&#23454;&#35777;&#26126;&#24456;&#26377;&#20215;&#20540;&#12290;</p> <p><br> </p> <p>&#19968;&#20010;&#22823;&#22411; build  &#36890;&#24120;&#20250;&#24456;&#32791;&#26102;&#65292;&#22914;&#26524;&#21482;&#20570;&#20102;&#24456;&#23567;&#30340;&#20462;&#25913;&#65292;&#20320;&#19981;&#20250;&#24819;&#33457;&#26102;&#38388;&#21435;&#37325;&#22797;&#25152;&#26377;&#30340;&#27493;&#39588;&#12290;&#25152;&#20197;&#19968;&#20010;&#22909;&#30340; build  &#24037;&#20855;&#24212;&#35813;&#20250;&#20998;&#26512;&#21738;&#20123;&#27493;&#39588;&#21487;&#20197;&#36339;&#36807;&#12290;&#19968;&#20010;&#36890;&#29992;&#30340;&#21150;&#27861;&#26159;&#27604;&#36739;&#28304;&#25991;&#20214;&#21644;&#30446;&#26631;&#25991;&#20214;&#30340;&#20462;&#25913;&#26102;&#38388;&#65292;&#24182;&#21482;&#32534;&#35793;&#37027;&#20123;&#36739;&#26032;&#30340;&#28304;&#25991;&#20214;&#12290;&#22788;&#29702;&#20381;&#36182;&#20851;&#31995;&#35201;&#40635;&#28902;&#19968;&#20123;&#65306;&#22914;&#26524;&#19968;&#20010;&#30446;&#26631;&#25991; &#20214;&#20462;&#25913;&#20102;&#65292;&#25152;&#26377;&#20381;&#36182;&#23427;&#30340;&#37096;&#20998;&#37117;&#35201;&#37325;&#26032;&#29983;&#25104;&#12290;&#32534;&#35793;&#22120;&#21487;&#33021;&#20250;&#24110;&#20320;&#22788;&#29702;&#36825;&#20123;&#20107;&#24773;&#65292;&#20063;&#21487;&#33021;&#19981;&#20250;&#12290;</p> <p><br> </p> <p>&#26681;&#25454;&#20320;&#30340;&#38656;&#35201;&#65292;&#20320;&#21487;&#33021; &#20250;&#24819; build &#20986;&#21508;&#31181;&#19981;&#21516;&#30340;&#19996;&#35199;&#12290;&#20320;&#21487;&#20197;&#21516;&#26102; build &#31995;&#32479;&#20195;&#30721;&#21644;&#27979;&#35797;&#20195;&#30721;&#65292;&#20063;&#21487;&#20197;&#21482; build &#31995;&#32479;&#20195;&#30721;&#12290;&#19968;&#20123;&#32452;&#20214;&#21487;&#20197;&#34987;&#21333;&#29420;  build&#12290;Build &#33050;&#26412;&#24212;&#35813;&#20801;&#35768;&#20320;&#22312;&#19981;&#21516;&#30340;&#24773;&#20917;&#20013; build &#19981;&#21516;&#30340; target&#12290;</p> <p><br> </p> <p>&#25105;&#20204;&#35768;&#22810;&#20154;&#37117;&#29992;  IDE&#65292;&#35768;&#22810; IDE &#37117;&#20869;&#32622;&#21253;&#21547;&#26576;&#31181; build &#31649;&#29702;&#21151;&#33021;&#12290;&#28982;&#32780;&#65292;&#30456;&#24212;&#30340;&#37197;&#32622;&#25991;&#20214;&#24448;&#24448;&#26159;&#36825;&#20123; IDE &#30340;&#19987;&#26377;&#26684;&#24335;&#65292;&#32780;&#19988;&#24448;&#24448;&#19981;&#22815;&#20581;&#22766;&#65292;&#23427;&#20204;&#31163;&#20102;  IDE &#23601;&#26080;&#27861;&#24037;&#20316;&#12290;&#22914;&#26524;&#21482;&#26159; IDE &#29992;&#25143;&#33258;&#24049;&#19968;&#20010;&#20154;&#24320;&#21457;&#30340;&#35805;&#65292;&#36825;&#36824;&#33021;&#22815;&#25509;&#21463;&#12290;&#20294;&#22312;&#22242;&#38431;&#37324;&#65292;&#19968;&#20010;&#24037;&#20316;&#20110;&#26381;&#21153;&#22120;&#19978;&#30340;&#20027; build  &#29615;&#22659;&#21644;&#20174;&#20854;&#23427;&#33050;&#26412;&#37324;&#36816;&#34892;&#30340;&#33021;&#21147;&#26356;&#37325;&#35201;&#12290;&#25105;&#20204;&#35748;&#20026;&#65292;&#22312; Java &#39033;&#30446;&#37324;&#65292;&#24320;&#21457;&#32773;&#21487;&#20197;&#29992;&#33258;&#24049;&#30340; IDE &#20570; build&#65292;&#20294;&#20027; build &#24517;&#39035;&#29992; Ant  &#26469;&#20570;&#65292;&#20197;&#20445;&#35777;&#23427;&#21487;&#20197;&#22312;&#24320;&#21457;&#26381;&#21153;&#22120;&#19978;&#36816;&#34892;&#12290;</p> <p><br> </p> <h3>&#35753;&#20320;&#30340;build&#33258;&#34892;&#27979;&#35797;</h3> <p><br> </p>  <p>&#20256;&#32479;&#24847;&#20041;&#19978;&#30340; build  &#25351;&#32534;&#35793;&#65292;&#38142;&#25509;&#65292;&#21644;&#19968;&#20123;&#20854;&#23427;&#33021;&#35753;&#31243;&#24207;&#36816;&#34892;&#36215;&#26469;&#30340;&#27493;&#39588;&#12290;&#31243;&#24207;&#21487;&#20197;&#36816;&#34892;&#24182;&#19981;&#24847;&#21619;&#30528;&#23427;&#20063;&#24037;&#20316;&#27491;&#24120;&#12290;&#29616;&#20195;&#38745;&#24577;&#35821;&#35328;&#21487;&#20197;&#22312;&#32534;&#35793;&#26102;&#26816;&#27979;&#20986;&#35768;&#22810;  bug&#65292;&#20294;&#36824;&#26159;&#26377;&#26356;&#22810;&#30340;&#28431;&#32593;&#20043;&#40060;&#12290;</p> <p><br> </p> <p>&#19968;&#31181;&#21448;&#24555;&#21448;&#30465;&#30340;&#26597; bug &#30340;&#26041;&#27861;&#26159;&#22312; build  &#36807;&#31243;&#20013;&#21253;&#21547;&#33258;&#21160;&#27979;&#35797;&#12290;&#24403;&#28982;&#65292;&#27979;&#35797;&#24182;&#38750;&#23436;&#32654;&#35299;&#20915;&#26041;&#26696;&#65292;&#20294;&#23427;&#30830;&#23454;&#33021;&#25235;&#20303;&#24456;&#22810;  bug&#8212;&#8212;&#22810;&#21040;&#21487;&#20197;&#35753;&#36719;&#20214;&#30495;&#27491;&#21487;&#29992;&#12290;&#26497;&#38480;&#32534;&#31243;&#65288;XP&#65289;&#21644;&#27979;&#35797;&#39537;&#21160;&#24320;&#21457;&#65288;TDD&#65289;&#30340;&#20986;&#29616;&#24456;&#22909;&#22320;&#26222;&#21450;&#20102;&#33258;&#27979;&#35797;&#20195;&#30721;&#30340;&#27010;&#24565;&#65292;&#29616;&#22312;&#24050;&#32463;&#26377;&#24456;&#22810;&#20154;&#24847;&#35782;&#21040;&#20102;&#36825;&#31181;&#25216;&#24039;&#30340; &#20215;&#20540;&#12290; </p> <p><br> </p> <p>&#32463;&#24120;&#35835;&#25105;&#30340;&#33879;&#20316;&#30340;&#35835;&#32773;&#37117;&#30693;&#36947;&#25105;&#26159; TDD &#21644; XP  &#30340;&#22362;&#23450;&#36861;&#38543;&#32773;&#12290;&#20294;&#26159;&#25105;&#24819;&#35201;&#24378;&#35843;&#20320;&#19981;&#38656;&#35201;&#36825;&#20004;&#32773;&#20013;&#20219;&#20309;&#19968;&#20010;&#23601;&#33021;&#20139;&#21463;&#33258;&#27979;&#35797;&#20195;&#30721;&#30340;&#22909;&#22788;&#12290;&#20004;&#32773;&#37117;&#35201;&#27714;&#20320;&#20808;&#20889;&#27979;&#35797;&#65292;&#20877;&#20889;&#20195;&#30721;&#20197;&#36890;&#36807;&#27979;&#35797;&#65292;&#22312;&#36825;&#31181;&#24037;&#20316;&#27169;&#24335;&#37324;&#27979;&#35797;&#26356;&#22810; &#30528;&#37325;&#20110;&#25506;&#32034;&#35774;&#35745;&#32780;&#19981;&#26159;&#21457;&#29616; bug&#12290;&#36825;&#32477;&#23545;&#26159;&#19968;&#20010;&#22909;&#26041;&#27861;&#65292;&#20294;&#23545;&#20110;&#25345;&#32493;&#38598;&#25104;&#32780;&#35328;&#23427;&#24182;&#19981;&#24517;&#35201;&#65292;&#22240;&#20026;&#36825;&#37324;&#23545;&#33258;&#27979;&#35797;&#20195;&#30721;&#30340;&#35201;&#27714;&#27809;&#26377;&#37027;&#20040;&#39640;&#12290;&#65288;&#23613;&#31649;&#25105;&#32943;&#23450;&#20250;&#36873;&#25321;&#29992;  TDD &#30340;&#26041;&#24335;&#12290;&#65289;</p> <p><br> </p> <p>&#33258;&#27979;&#35797;&#20195;&#30721;&#38656;&#35201;&#21253;&#21547;&#19968;&#22871;&#33258;&#21160;&#21270;&#27979;&#35797;&#29992;&#20363;&#65292;&#36825;&#20123;&#27979;&#35797;&#29992;&#20363;&#21487;&#20197;&#26816;&#26597;&#22823;&#37096;&#20998;&#20195;&#30721;&#24182;&#25214;&#20986;  bug&#12290;&#27979;&#35797;&#35201;&#33021;&#22815;&#20174;&#19968;&#26465;&#31616;&#21333;&#30340;&#21629;&#20196;&#21551;&#21160;&#12290;&#27979;&#35797;&#32467;&#26524;&#24517;&#39035;&#33021;&#25351;&#20986;&#21738;&#20123;&#27979;&#35797;&#22833;&#36133;&#20102;&#12290;&#23545;&#20110;&#21253;&#21547;&#27979;&#35797;&#30340; build&#65292;&#27979;&#35797;&#22833;&#36133;&#24517;&#39035;&#23548;&#33268; build &#20063;&#22833;&#36133;&#12290;</p>  <p><br> </p> <p>&#22312;&#36807;&#21435;&#30340;&#20960;&#24180;&#37324;&#65292;TDD &#30340;&#23835;&#36215;&#26222;&#21450;&#20102;&#24320;&#28304;&#30340;&#160;<a href="http://www.martinfowler.com/bliki/Xunit.html" target="_blank">XUnit  &#31995;&#21015;&#24037;&#20855;</a>&#65292;&#36825;&#20123;&#24037;&#20855;&#29992;&#20316;&#20197;&#19978;&#29992;&#36884;&#38750;&#24120;&#29702;&#24819;&#12290;&#23545;&#20110;&#25105;&#20204;&#22312; ThoughWorks &#24037;&#20316;&#30340;&#20154;&#26469;&#35828;&#65292;XUnit  &#24037;&#20855;&#24050;&#32463;&#35777;&#26126;&#20102;&#23427;&#20204;&#30340;&#20215;&#20540;&#12290;&#25105;&#24635;&#26159;&#24314;&#35758;&#20154;&#20204;&#20351;&#29992;&#23427;&#20204;&#12290;&#36825;&#20123;&#26368;&#26089;&#30001; Kent Beck &#21457;&#26126;&#30340;&#24037;&#20855;&#20351;&#24471;&#35774;&#32622;&#19968;&#20010;&#23436;&#20840;&#33258;&#27979;&#35797;&#29615;&#22659;&#30340;&#24037;&#20316;&#21464;&#24471;&#38750;&#24120;&#31616;&#21333;&#12290;</p>  <p><br> </p> <p>&#27595;&#24248;&#32622;&#30097;&#65292;&#23545;&#20110;&#33258;&#21160;&#27979;&#35797;&#30340;&#24037;&#20316;&#32780;&#35328;&#65292;XUnit  &#24037;&#20855;&#21482;&#26159;&#19968;&#20010;&#36215;&#28857;&#12290;&#20320;&#36824;&#24517;&#39035;&#33258;&#24049;&#23547;&#25214;&#20854;&#20182;&#26356;&#36866;&#21512;&#31471;&#23545;&#31471;&#27979;&#35797;&#30340;&#24037;&#20855;&#12290;&#29616;&#22312;&#26377;&#24456;&#22810;&#27492;&#31867;&#24037;&#20855;&#65292;&#21253;&#25324;<a href="http://fit.c2.com/" target="_blank">FIT</a>&#65292;<a href="http://www.openqa.org/selenium/" target="_blank">Selenium</a>&#65292;<a href="http://sahi.sourceforge.net/" target="_blank">Sahi</a>&#65292;<a href="http://wtr.rubyforge.org/" target="_blank">Watir</a>&#65292;<a href="http://fitnesse.org/" target="_blank">FITnesse</a>&#65292; &#21644;&#35768;&#22810;&#20854;&#23427;&#25105;&#26080;&#27861;&#21015;&#22312;&#36825;&#37324;&#30340;&#24037;&#20855;&#12290;</p> <p><br> </p> <p>&#24403;&#28982;&#20320;&#19981;&#33021;&#25351;&#26395;&#27979;&#35797;&#21457;&#29616;&#25152;&#26377;&#38382;&#39064;&#12290;&#23601;&#20687;&#20154;&#20204;&#32463;&#24120;&#35828;&#30340;&#65306;&#27979;&#35797;&#36890;&#36807;&#19981;&#33021;&#35777;&#26126;&#27809;&#26377;  bug&#12290;&#28982;&#32780;&#65292;&#23436;&#32654;&#24182;&#38750;&#26159;&#20320;&#35201;&#36890;&#36807;&#33258;&#27979;&#35797; build &#36798;&#21040;&#30340;&#21807;&#19968;&#30446;&#26631;&#12290;&#32463;&#24120;&#36816;&#34892;&#19981;&#23436;&#32654;&#30340;&#27979;&#35797;&#35201;&#36828;&#36828;&#22909;&#36807;&#26790;&#24819;&#30528;&#23436;&#32654;&#30340;&#27979;&#35797;&#65292;&#20294;&#23454;&#38469;&#20160;&#20040;&#20063;&#19981;&#20570;&#12290;</p>  <p><br> </p> <h3>&#27599;&#20154;&#27599;&#22825;&#37117;&#35201;&#21521; mainline &#25552;&#20132;&#20195;&#30721;</h3> <p><br> </p> <p>&#38598;&#25104;&#30340;&#20027;&#35201;&#24037;&#20316;&#20854;&#23454;&#26159;&#27807; &#36890;&#12290;&#38598;&#25104;&#21487;&#20197;&#35753;&#24320;&#21457;&#32773;&#21578;&#35785;&#20854;&#20182;&#20154;&#20182;&#20204;&#37117;&#25913;&#20102;&#20160;&#20040;&#19996;&#35199;&#12290;&#39057;&#32321;&#30340;&#27807;&#36890;&#21487;&#20197;&#35753;&#20154;&#20204;&#26356;&#24555;&#22320;&#20102;&#35299;&#21464;&#21270;&#12290;</p> <p><br> </p> <p>&#35753;&#24320;&#21457;&#32773;&#25552;&#20132;&#21040;  mainline &#30340;&#19968;&#20010;&#20808;&#20915;&#26465;&#20214;&#26159;&#20182;&#20204;&#24517;&#39035;&#33021;&#22815;&#27491;&#30830;&#22320; build &#20182;&#20204;&#30340;&#20195;&#30721;&#12290;&#36825;&#24403;&#28982;&#20063;&#21253;&#25324;&#36890;&#36807; build  &#21253;&#21547;&#30340;&#27979;&#35797;&#12290;&#22312;&#27599;&#20010;&#25552;&#20132;&#36845;&#20195;&#37324;&#65292;&#24320;&#21457;&#32773;&#39318;&#20808;&#26356;&#26032;&#20182;&#20204;&#30340;&#24037;&#20316;&#25335;&#36125;&#20197;&#19982; mainline &#19968;&#33268;&#65292;&#35299;&#20915;&#20219;&#20309;&#21487;&#33021;&#30340;&#20914;&#31361;&#65292;&#28982;&#21518;&#22312;&#33258;&#24049;&#30340;&#26426;&#22120;&#19978;&#20570; build&#12290;&#22312;  build &#36890;&#36807;&#21518;&#65292;&#20182;&#20204;&#23601;&#21487;&#20197;&#38543;&#20415;&#21521; mainline &#25552;&#20132;&#20102;&#12290;</p> <p><br> </p> <p>&#36890;&#36807;&#39057;&#32321;&#37325;&#22797;&#19978;&#36848;&#36807;&#31243;&#65292;&#24320;&#21457;&#32773;&#21487;&#20197;&#21457;&#29616; &#20004;&#20010;&#20154;&#20043;&#38388;&#30340;&#20195;&#30721;&#20914;&#31361;&#12290;&#35299;&#20915;&#38382;&#39064;&#30340;&#20851;&#38190;&#26159;&#23613;&#26089;&#21457;&#29616;&#38382;&#39064;&#12290;&#22914;&#26524;&#24320;&#21457;&#32773;&#27599;&#36807;&#20960;&#20010;&#23567;&#26102;&#23601;&#20250;&#25552;&#20132;&#19968;&#27425;&#65292;&#37027;&#20914;&#31361;&#20063;&#20250;&#22312;&#20986;&#29616;&#30340;&#20960;&#20010;&#23567;&#26102;&#20043;&#20869;&#34987;&#21457;&#29616;&#65292;&#20174;&#36825;&#19968;&#28857;&#26469;&#35828;&#65292;&#22240;&#20026; &#36824;&#27809;&#26377;&#20570;&#22826;&#22810;&#20107;&#65292;&#35299;&#20915;&#36215;&#26469;&#20063;&#23481;&#26131;&#12290;&#22914;&#26524;&#35753;&#20914;&#31361;&#24453;&#19978;&#20960;&#20010;&#26143;&#26399;&#65292;&#23427;&#23601;&#20250;&#21464;&#24471;&#38750;&#24120;&#38590;&#35299;&#20915;&#12290;</p> <p><br> </p> <p>&#22240;&#20026;&#20320;&#22312;&#26356;&#26032;&#24037;&#20316;&#25335;&#36125;&#26102;&#20063; &#20250;&#20570; build&#65292;&#36825;&#24847;&#21619;&#30528;&#20320;&#38500;&#20102;&#35299;&#20915;&#28304;&#20195;&#30721;&#20914;&#31361;&#22806;&#20063;&#20250;&#26816;&#26597;&#32534;&#35793;&#20914;&#31361;&#12290;&#22240;&#20026; build  &#26159;&#33258;&#27979;&#35797;&#30340;&#65292;&#20320;&#20063;&#21487;&#20197;&#26597;&#20986;&#20195;&#30721;&#36816;&#34892;&#26102;&#30340;&#20914;&#31361;&#12290;&#21518;&#32773;&#22914;&#26524;&#22312;&#19968;&#27573;&#36739;&#38271;&#30340;&#26102;&#38388;&#36824;&#27809;&#34987;&#26597;&#20986;&#30340;&#35805;&#20250;&#21464;&#24471;&#23588;&#20854;&#40635;&#28902;&#12290;&#22240;&#20026;&#20004;&#27425;&#25552;&#20132;&#20043;&#38388;&#21482;&#26377;&#20960;&#20010;&#23567;&#26102;&#30340;&#20462;&#25913;&#65292;&#20135;&#29983;&#36825;&#20123;&#38382;&#39064; &#21482;&#21487;&#33021;&#22312;&#24456;&#26377;&#38480;&#30340;&#20960;&#20010;&#22320;&#26041;&#12290;&#27492;&#22806;&#65292;&#22240;&#20026;&#27809;&#25913;&#22826;&#22810;&#19996;&#35199;&#65292;&#20320;&#36824;&#21487;&#20197;&#29992;&#160;<a href="http://www.martinfowler.com/bliki/DiffDebugging.html" target="_blank">diff-debugging</a>&#160;&#30340;&#25216;&#24039;&#26469;&#25214; bug&#12290;</p> <p><br> </p> <p>&#24635;&#30340;&#26469;&#35828;&#65292;&#25105; &#30340;&#21407;&#21017;&#26159;&#27599;&#20010;&#24320;&#21457;&#32773;&#27599;&#22825;&#37117;&#24517;&#39035;&#25552;&#20132;&#20195;&#30721;&#12290;&#23454;&#36341;&#20013;&#65292;&#22914;&#26524;&#24320;&#21457;&#32773;&#25552;&#20132;&#30340;&#26356;&#20026;&#39057;&#32321;&#25928;&#26524;&#20063;&#20250;&#26356;&#22909;&#12290;&#20320;&#25552;&#20132;&#30340;&#36234;&#22810;&#65292;&#20320;&#38656;&#35201;&#26597;&#25214;&#20914;&#31361;&#38169;&#35823;&#30340;&#22320;&#26041;&#23601;&#36234;&#23569;&#65292;&#25913;&#36215;&#26469;&#20063;&#36234;&#24555;&#12290;</p>  <p><br> </p> <p>&#39057;&#32321;&#25552;&#20132;&#23458;&#35266;&#19978;&#20250;&#40723;&#21169;&#24320;&#21457;&#32773;&#23558;&#24037;&#20316;&#20998;&#35299;&#25104;&#20197;&#23567;&#26102;&#35745;&#30340;&#23567;&#22359;&#12290;&#36825;&#21487;&#20197;&#24110;&#21161;&#36319;&#36394;&#36827;&#24230;&#21644;&#35753;&#22823;&#23478;&#24863;&#21463;&#21040;&#36827;&#23637;&#12290;&#32463;&#24120;&#20250;&#26377;&#20154;&#19968;&#24320;&#22987;&#26681; &#26412;&#26080;&#27861;&#25214;&#21040;&#21487;&#20197;&#22312;&#20960;&#23567;&#26102;&#20869;&#23436;&#25104;&#30340;&#20687;&#26679;&#30340;&#24037;&#20316;&#65292;&#20294;&#25105;&#20204;&#21457;&#29616;&#36741;&#23548;&#21644;&#32451;&#20064;&#21487;&#20197;&#24110;&#21161;&#20182;&#20204;&#23398;&#20064;&#20854;&#20013;&#30340;&#25216;&#24039;&#12290;</p> <p><br> </p> <h3>&#27599;&#27425;&#25552;&#20132;&#37117; &#24212;&#22312;&#38598;&#25104;&#35745;&#31639;&#26426;&#19978;&#37325;&#26032;&#26500;&#24314; mainline</h3> <p><br> </p> <p>&#20351;&#29992;&#27599;&#26085;&#25552;&#20132;&#30340;&#31574;&#30053;&#21518;&#65292;&#22242;&#38431;&#23601;&#33021;&#24471;&#21040;&#24456;&#22810;&#32463;&#36807;&#27979;&#35797;&#30340;  build&#12290;&#36825;&#24212;&#35813;&#24847;&#21619;&#30528; mainline  &#24212;&#35813;&#24635;&#26159;&#22788;&#20110;&#19968;&#31181;&#20581;&#24247;&#30340;&#29366;&#24577;&#12290;&#20294;&#22312;&#23454;&#36341;&#20013;&#65292;&#20107;&#24773;&#24182;&#38750;&#24635;&#26159;&#22914;&#27492;&#12290;&#19968;&#20010;&#21407;&#22240;&#36319;&#32426;&#24459;&#26377;&#20851;&#65292;&#20154;&#20204;&#27809;&#26377;&#20005;&#26684;&#36981;&#23432;&#22312;&#25552;&#20132;&#20043;&#21069;&#22312;&#26412;&#22320;&#26356;&#26032;&#24182;&#20570; build  &#30340;&#35201;&#27714;&#12290;&#21478;&#19968;&#20010;&#21407;&#22240;&#26159;&#24320;&#21457;&#32773;&#30340;&#35745;&#31639;&#26426;&#20043;&#38388;&#29615;&#22659;&#37197;&#32622;&#30340;&#19981;&#21516;&#12290;</p> <p><br> </p> <p>&#32467;&#35770;&#26159;&#20320;&#24517;&#39035;&#20445;&#35777;&#26085;&#24120;&#30340; build  &#21457;&#29983;&#22312;&#19987;&#29992;&#30340;&#38598;&#25104;&#35745;&#31639;&#26426;&#19978;&#65292;&#21482;&#26377;&#38598;&#25104; build &#25104;&#21151;&#20102;&#65292;&#25552;&#20132;&#30340;&#36807;&#31243;&#25165;&#31639;&#32467;&#26463;&#12290;&#26412;&#30528;&#8220;&#35841;&#25552;&#20132;&#65292;&#35841;&#36127;&#36131;&#8221;&#30340;&#21407;&#21017;&#65292;&#24320;&#21457;&#32773;&#24517;&#39035;&#30417;&#35270; mainline &#19978;&#30340;  build &#20197;&#20415;&#22833;&#36133;&#26102;&#21450;&#26102;&#20462;&#22797;&#12290;&#19968;&#20010;&#25512;&#35770;&#26159;&#22914;&#26524;&#20320;&#22312;&#19979;&#29677;&#21069;&#25552;&#20132;&#20102;&#20195;&#30721;&#65292;&#37027;&#20320;&#22312; mainline build &#25104;&#21151;&#20043;&#21069;&#23601;&#19981;&#33021;&#22238;&#23478;&#12290;</p> <p><br>  </p> <p>&#25105;&#30693;&#36947;&#20027;&#35201;&#26377;&#20004;&#31181;&#26041;&#27861;&#21487;&#20197;&#20351;&#29992;&#65306;&#25163;&#21160; build&#65292;&#25110;&#25345;&#32493;&#38598;&#25104;&#26381;&#21153;&#22120;&#36719;&#20214;&#12290;</p> <p><br> </p> <p>&#25163;&#21160;  build &#25551;&#36848;&#36215;&#26469;&#27604;&#36739;&#31616;&#21333;&#12290;&#22522;&#26412;&#19978;&#23427;&#36319;&#25552;&#20132;&#20195;&#30721;&#20043;&#21069;&#22312;&#26412;&#22320;&#25152;&#20570;&#30340;&#37027;&#27425; build &#24046;&#19981;&#22810;&#12290;&#24320;&#21457;&#32773;&#30331;&#24405;&#21040;&#38598;&#25104;&#35745;&#31639;&#26426;&#65292;check out &#20986;  mainline &#19978;&#26368;&#26032;&#30340;&#28304;&#30721;&#65288;&#24050;&#21253;&#21547;&#26368;&#26032;&#30340;&#25552;&#20132;&#65289;&#65292;&#24182;&#21551;&#21160;&#19968;&#20010;&#38598;&#25104; build&#12290;&#20182;&#35201;&#30041;&#24847; build &#30340;&#36827;&#31243;&#65292;&#21482;&#26377; build  &#25104;&#21151;&#20102;&#20182;&#30340;&#25552;&#20132;&#25165;&#31639;&#25104;&#21151;&#12290;&#65288;&#35831;&#26597;&#30475; Jim Shore &#30340;<a href="http://www.jamesshore.com/Blog/Continuous-Integration-on-a-Dollar-a-Day.html" target="_blank">&#25551;&#36848;</a>&#12290;&#65289;</p> <p><br> </p> <p>&#25345;&#32493;&#38598;&#25104;&#26381;&#21153;&#22120;&#36719;&#20214;&#23601;&#20687;&#19968;&#20010;&#30417;&#35270;&#30528;&#28304;&#30721;&#20179;&#24211;&#30340;&#30417;&#35270;&#22120;&#12290;&#27599; &#27425;&#28304;&#30721;&#20179;&#24211;&#20013;&#26377;&#26032;&#30340;&#25552;&#20132;&#65292;&#26381;&#21153;&#22120;&#23601;&#20250;&#33258;&#21160; check out &#20986;&#28304;&#20195;&#30721;&#24182;&#21551;&#21160;&#19968;&#27425; build&#65292;&#24182;&#19988;&#25226; build  &#30340;&#32467;&#26524;&#36890;&#30693;&#25552;&#20132;&#32773;&#12290;&#36825;&#31181;&#24773;&#20917;&#19979;&#65292;&#25552;&#20132;&#32773;&#30340;&#24037;&#20316;&#30452;&#21040;&#25910;&#21040;&#36890;&#30693;&#65288;&#36890;&#24120;&#26159; email&#65289;&#25165;&#31639;&#32467;&#26463;&#12290;</p> <p><br> </p> <p>&#22312;  ThoughtWorks&#65292;&#25105;&#20204;&#37117;&#26159;&#25345;&#32493;&#38598;&#25104;&#26381;&#21153;&#22120;&#36719;&#20214;&#30340;&#22362;&#23450;&#25903;&#25345;&#32773;&#65292;&#23454;&#38469;&#19978;&#25105;&#20204;&#24341;&#39046;&#20102;&#160;<a href="http://cruisecontrol.sourceforge.net/" target="_blank">CruiseControl</a>&#160;&#21644;&#160;<a href="http://ccnet.thoughtworks.com/" target="_blank">CruiseControl.NET</a>&#160;&#26368; &#26089;&#26399;&#30340;&#24320;&#21457;&#65292;&#20004;&#32773;&#37117;&#26159;&#34987;&#24191;&#27867;&#20351;&#29992;&#30340;&#24320;&#28304;&#36719;&#20214;&#12290;&#27492;&#21518;&#65292;&#25105;&#20204;&#36824;&#20570;&#20102;&#21830;&#19994;&#29256;&#30340;&#160;<a href="http://studios.thoughtworks.com/cruise-continuous-integration" target="_blank">Cruise</a>&#160;&#25345;&#32493;&#38598;&#25104;&#26381;&#21153;&#22120;&#12290;&#25105;&#20204;&#20960;&#20046;&#22312;&#27599;&#19968;&#20010;&#39033;&#30446;&#37324;&#37117;&#20250;&#29992;&#25345;&#32493;&#38598;&#25104;&#26381;&#21153;&#22120;&#65292;&#24182;&#19988;&#23545;&#32467;&#26524;&#38750;&#24120;&#28385;&#24847;&#12290; </p>  <p><br> </p> <p>&#19981;&#26159;&#27599;&#20010;&#20154;&#37117;&#20250;&#29992;&#25345;&#32493;&#38598;&#25104;&#26381;&#21153;&#22120;&#12290;Jim Shore &#23601;<a href="http://www.jamesshore.com/Blog/Continuous-Integration-is-an-Attitude.html" target="_blank">&#28165;&#26970;&#22320;&#34920;&#36798;</a>&#20102;&#20026;&#20160;&#20040;&#20182;&#26356;&#20559;&#22909;&#25163;&#21160;&#30340;&#21150;&#27861;&#12290;&#25105;&#21516;&#24847;&#20182;&#30340;&#30475;&#27861;&#20013;&#30340;&#25345;&#32493;&#38598;&#25104;&#24182;&#19981;&#20165;&#20165;&#26159;&#23433;&#35013;&#20960;&#20010;&#36719;&#20214;&#32780;&#24050;&#65292;&#25152;&#26377;&#30340;&#23454;&#36341; &#37117;&#24517;&#39035;&#20026;&#20102;&#33021;&#35753;&#25345;&#32493;&#38598;&#25104;&#26356;&#26377;&#25928;&#29575;&#12290;&#20294;&#21516;&#26679;&#30340;&#65292;&#35768;&#22810;&#25345;&#32493;&#38598;&#25104;&#25191;&#34892;&#24471;&#24456;&#22909;&#30340;&#22242;&#38431;&#20063;&#20250;&#21457;&#29616;&#25345;&#32493;&#38598;&#25104;&#26381;&#21153;&#22120;&#26159;&#20010;&#24456;&#26377;&#29992;&#30340;&#24037;&#20855;&#12290;</p> <p><br> </p>  <p>&#35768;&#22810;&#32452;&#32455;&#26681;&#25454;&#23433;&#25490;&#22909;&#30340;&#26085;&#31243;&#34920;&#20570;&#20363;&#34892;  build&#65292;&#22914;&#27599;&#22825;&#26202;&#19978;&#12290;&#36825;&#20854;&#23454;&#36319;&#25345;&#32493;&#38598;&#25104;&#26159;&#20004;&#30721;&#20107;&#65292;&#32780;&#19988;&#20570;&#24471;&#36828;&#36828;&#19981;&#22815;&#12290;&#25345;&#32493;&#38598;&#25104;&#30340;&#26368;&#32456;&#30446;&#26631;&#23601;&#26159;&#35201;&#23613;&#21487;&#33021;&#24555;&#22320;&#21457;&#29616;&#38382;&#39064;&#12290;Nightly build  &#24847;&#21619;&#30528; bug &#34987;&#21457;&#29616;&#20043;&#21069;&#21487;&#33021;&#20250;&#24453;&#19978;&#25972;&#25972;&#19968;&#22825;&#12290;&#19968;&#26086; bug &#33021;&#22312;&#31995;&#32479;&#37324;&#21574;&#36825;&#20040;&#20037;&#65292;&#25214;&#21040;&#24182;&#20462;&#22797;&#23427;&#20204;&#20063;&#20250;&#33457;&#36739;&#38271;&#30340;&#26102;&#38388;&#12290;</p> <p><br> </p>  <p>&#20570;&#22909;&#25345;&#32493;&#38598;&#25104;&#30340;&#19968;&#20010;&#20851;&#38190;&#22240;&#32032;&#26159;&#19968;&#26086; mainline &#19978;&#30340; build  &#22833;&#36133;&#20102;&#65292;&#23427;&#24517;&#39035;&#34987;&#39532;&#19978;&#20462;&#22797;&#12290;&#32780;&#22312;&#25345;&#32493;&#38598;&#25104;&#29615;&#22659;&#20013;&#24037;&#20316;&#26368;&#22823;&#30340;&#22909;&#22788;&#26159;&#65292;&#20320;&#24635;&#33021;&#22312;&#19968;&#20010;&#31283;&#23450;&#30340;&#22522;&#30784;&#19978;&#20570;&#24320;&#21457;&#12290;mainline &#19978; build  &#22833;&#36133;&#24182;&#19981;&#24635;&#26159;&#22351;&#20107;&#65292;&#20294;&#22914;&#26524;&#23427;&#32463;&#24120;&#20986;&#38169;&#65292;&#23601;&#24847;&#21619;&#30528;&#20154;&#20204;&#27809;&#26377;&#35748;&#30495;&#22320;&#22312;&#25552;&#20132;&#20195;&#30721;&#21069;&#20808;&#22312;&#26412;&#22320;&#26356;&#26032;&#20195;&#30721;&#21644;&#20570; build&#12290;&#24403; mainline &#19978; build  &#30495;&#30340;&#22833;&#36133;&#26102;&#65292;&#31532;&#19968;&#26102;&#38388;&#20462;&#22797;&#23601;&#25104;&#20102;&#22836;&#31561;&#22823;&#20107;&#12290;&#20026;&#20102;&#38450;&#27490;&#22312; mainline &#19978;&#30340;&#38382;&#39064;&#65292;&#20320;&#20063;&#21487;&#20197;&#32771;&#34385;&#29992;&#160;<a href="http://martinfowler.com/bliki/PendingHead.html" target="_blank">pending  head</a>&#160;&#30340;&#26041;&#27861;&#12290;</p> <p><br> </p> <p>&#24403;&#22242;&#38431;&#24341;&#20837;&#25345;&#32493;&#38598;&#25104;&#26102;&#65292;&#36825;&#36890;&#24120;&#26159;&#26368;&#38590;&#25630;&#23450;&#30340;&#20107;&#24773;&#20043;&#19968;&#12290;&#22312;&#21021;&#26399;&#65292;&#22242;&#38431;&#20250;&#38750;&#24120;&#38590;&#20197;&#25509; &#21463;&#39057;&#32321;&#22312; mainline &#19978;&#20570; build  &#30340;&#20064;&#24815;&#65292;&#29305;&#21035;&#24403;&#20182;&#20204;&#24037;&#20316;&#22312;&#19968;&#20010;&#24050;&#23384;&#22312;&#30340;&#20195;&#30721;&#22522;&#30784;&#19978;&#26102;&#26356;&#26159;&#22914;&#27492;&#12290;&#20294;&#26368;&#21518;&#32784;&#24515;&#21644;&#22362;&#23450;&#19981;&#31227;&#30340;&#23454;&#36341;&#24120;&#24120;&#20250;&#36215;&#20316;&#29992;&#65292;&#25152;&#20197;&#19981;&#35201;&#27668;&#39297;&#12290;</p> <p><br> </p>  <h3>&#20445;&#25345;&#24555;&#36895; build</h3> <p><br> </p> <p>&#25345;&#32493;&#38598;&#25104;&#30340;&#37325;&#28857;&#23601;&#26159;&#24555;&#36895;&#21453;&#39304;&#12290;&#27809;&#26377;&#20160;&#20040;&#27604;&#32531;&#24930;&#30340; build  &#26356;&#33021;&#21361;&#23475;&#25345;&#32493;&#38598;&#25104;&#27963;&#21160;&#12290;&#36825;&#37324;&#25105;&#24517;&#39035;&#25215;&#35748;&#19968;&#20010;&#22855;&#24605;&#24618;&#24819;&#30340;&#32769;&#23478;&#20249;&#20851;&#20110; build  &#24555;&#24930;&#26631;&#20934;&#30340;&#30340;&#29609;&#31505;&#65288;&#35793;&#32773;&#27880;&#65306;&#21407;&#25991;&#22914;&#27492;&#65292;&#19981;&#30693;&#20316;&#32773;&#25152;&#25351;&#65289;&#12290;&#25105;&#30340;&#22823;&#37096;&#20998;&#21516;&#20107;&#35748;&#20026;&#36229;&#36807;1&#23567;&#26102;&#30340; build &#26159;&#19981;&#33021;&#24525;&#21463;&#30340;&#12290;&#22242;&#38431;&#20204;&#37117;&#26790;&#24819;&#30528;&#25226; build  &#25630;&#24471;&#39134;&#24555;&#65292;&#20294;&#26377;&#26102;&#25105;&#20204;&#20063;&#30830;&#23454;&#20250;&#21457;&#29616;&#24456;&#38590;&#35753;&#23427;&#36798;&#21040;&#29702;&#24819;&#30340;&#36895;&#24230;&#12290;</p> <p><br> </p> <p>&#23545;&#22823;&#22810;&#25968;&#39033;&#30446;&#26469;&#35828;&#65292;XP &#30340;10&#20998;&#38047; build   &#30340;&#25351;&#23548;&#26041;&#38024;&#38750;&#24120;&#21512;&#29702;&#12290;&#25105;&#20204;&#29616;&#22312;&#20570;&#30340;&#22823;&#22810;&#25968;&#39033;&#30446;&#37117;&#33021;&#36798;&#21040;&#36825;&#20010;&#35201;&#27714;&#12290;&#36825;&#20540;&#24471;&#33457;&#20123;&#21147;&#27668;&#21435;&#20570;&#65292;&#22240;&#20026;&#20320;&#22312;&#36825;&#37324;&#30465;&#19979;&#30340;&#27599;&#19968;&#20998;&#38047;&#37117;&#33021;&#20307;&#29616;&#22312;&#27599;&#20010;&#24320;&#21457;&#32773;&#27599;&#27425;&#25552;&#20132;&#30340;&#26102;&#20505;&#12290;&#25345; &#32493;&#38598;&#25104;&#35201;&#27714;&#39057;&#32321;&#25552;&#20132;&#65292;&#25152;&#20197;&#36825;&#31215;&#32047;&#19979;&#26469;&#33021;&#33410;&#30465;&#24456;&#22810;&#26102;&#38388;&#12290;&#22914;&#26524;&#20320;&#19968;&#24320;&#22987;&#23601;&#35201;&#33457;1&#23567;&#26102;&#30340;&#26102;&#38388;&#20570;  build&#65292;&#24819;&#21152;&#24555;&#36825;&#20010;&#36807;&#31243;&#20250;&#30456;&#24403;&#26377;&#25361;&#25112;&#12290;&#21363;&#20351;&#22312;&#19968;&#20010;&#20174;&#22836;&#24320;&#22987;&#30340;&#26032;&#39033;&#30446;&#37324;&#65292;&#24819;&#35753; build  &#22987;&#32456;&#20445;&#25345;&#24555;&#36895;&#20063;&#26159;&#24456;&#26377;&#25361;&#25112;&#30340;&#12290;&#33267;&#23569;&#22312;&#20225;&#19994;&#24212;&#29992;&#37324;&#65292;&#25105;&#20204;&#21457;&#29616;&#24120;&#35265;&#30340;&#29942;&#39048;&#20986;&#29616;&#22312;&#27979;&#35797;&#26102;&#65292;&#23588;&#20854;&#24403;&#27979;&#35797;&#28041;&#21450;&#21040;&#22806;&#37096;&#26381;&#21153;&#22914;&#25968;&#25454;&#24211;&#12290;</p> <p><br> </p>  <p>&#20063;&#35768;&#26368;&#20851;&#38190;&#30340;&#19968;&#27493;&#26159;&#24320;&#22987;&#20351;&#29992;&#20998;&#38454;&#27573;build&#65288;staged build&#65289;&#12290;<strong>&#20998;&#38454;&#27573; build</strong>&#65288;&#20063;&#34987;&#31216;&#20316;&#160;<strong>build  &#29983;&#20135;&#32447;</strong>&#65289;&#30340;&#22522;&#26412;&#24819;&#27861;&#26159;&#22810;&#20010; build &#25353;&#19968;&#23450;&#39034;&#24207;&#25191;&#34892;&#12290;&#21521; mainline &#25552;&#20132;&#20195;&#30721;&#20250;&#24341;&#21457;&#31532;&#19968;&#20010; build&#65292;&#25105;&#31216;&#20043;&#20026;&#25552;&#20132;  build&#65288;commit build&#65289;&#12290;<strong>&#25552;&#20132; build&#160;</strong>&#26159;&#24403;&#26377;&#20154;&#21521; mainline &#25552;&#20132;&#26102;&#24341;&#21457;&#30340; build&#12290;&#25552;&#20132; build  &#35201;&#36275;&#22815;&#24555;&#65292;&#22240;&#27492;&#23427;&#20250;&#36339;&#36807;&#19968;&#20123;&#27493;&#39588;&#65292;&#26816;&#27979; bug &#30340;&#33021;&#21147;&#20063;&#36739;&#24369;&#12290;&#25552;&#20132; build &#26159;&#20026;&#20102;&#24179;&#34913;&#36136;&#37327;&#26816;&#27979;&#21644;&#36895;&#24230;&#65292;&#22240;&#27492;&#19968;&#20010;&#22909;&#30340;&#25552;&#20132; build  &#33267;&#23569;&#20063;&#35201;&#36275;&#22815;&#31283;&#23450;&#20197;&#20379;&#20182;&#20154;&#22522;&#20110;&#27492;&#24037;&#20316;&#12290; </p> <p><br> </p> <p>&#19968;&#26086;&#25552;&#20132; build  &#25104;&#21151;&#65292;&#20854;&#20182;&#20154;&#23601;&#21487;&#20197;&#25918;&#24515;&#22320;&#22522;&#20110;&#36825;&#20123;&#20195;&#30721;&#24037;&#20316;&#20102;&#12290;&#20294;&#21035;&#24536;&#20102;&#20320;&#36824;&#26377;&#26356;&#22810;&#26356;&#24930;&#30340;&#27979;&#35797;&#35201;&#20570;&#65292;&#21487;&#20197;&#21478;&#25214;&#19968;&#21488;&#35745;&#31639;&#26426;&#26469;&#36816;&#34892;&#36816;&#34892;&#36825;&#20123;&#27979;&#35797;&#12290; </p> <p><br> </p>  <p>&#19968;&#20010;&#31616;&#21333;&#30340;&#20363;&#23376;&#26159;&#20004;&#38454;&#27573; build&#12290;&#31532;&#19968;&#38454;&#27573;&#20250;&#32534;&#35793;&#21644;&#36816;&#34892;&#19968;&#20123;&#26412;&#22320;&#27979;&#35797;&#65292;&#19982;&#25968;&#25454;&#24211;&#30456;&#20851;&#30340;&#21333;&#20803;&#27979;&#35797;&#20250;&#34987;&#23436;&#20840;&#38548;&#31163;&#25481;&#65288;stub  out&#65289;&#12290;&#36825;&#20123;&#27979;&#35797;&#21487;&#20197;&#36816;&#34892;&#24471;&#38750;&#24120;&#24555;&#65292;&#31526;&#21512;&#25105;&#20204;&#30340;10&#20998;&#38047;&#25351;&#23548;&#26041;&#38024;&#12290;&#20294;&#26159;&#25152;&#26377;&#36319;&#22823;&#35268;&#27169;&#20132;&#20114;&#65292;&#23588;&#20854;&#26159;&#30495;&#27491;&#30340;&#25968;&#25454;&#24211;&#20132;&#20114;&#30340; bug &#37117;&#26080;&#27861;&#34987;&#21457;&#29616;&#12290;&#31532;&#20108;&#38454;&#27573;&#30340;  build &#36816;&#34892;&#19968;&#32452;&#19981;&#21516;&#30340;&#27979;&#35797;&#65292;&#36825;&#20123;&#27979;&#35797;&#20250;&#35843;&#29992;&#30495;&#27491;&#30340;&#25968;&#25454;&#24211;&#24182;&#28041;&#21450;&#26356;&#22810;&#30340;&#31471;&#21040;&#31471;&#30340;&#34892;&#20026;&#12290;&#36825;&#20123;&#27979;&#35797;&#20250;&#36305;&#19978;&#22909;&#20960;&#23567;&#26102;&#12290;</p> <p><br> </p>  <p>&#36825;&#31181;&#24773;&#20917;&#19979;&#65292;&#20154;&#20204;&#29992;&#31532;&#19968;&#38454;&#27573;&#20316;&#20026;&#25552;&#20132; build&#65292;&#24182;&#25226;&#36825;&#20316;&#20026;&#20027;&#35201;&#30340;&#25345;&#32493;&#38598;&#25104;&#24037;&#20316;&#12290;&#31532;&#20108;&#38454;&#27573; build &#26159;<strong>&#27425;&#32423;build</strong>&#65292;&#21482;&#26377; &#22312;&#38656;&#35201;&#30340;&#26102;&#20505;&#25165;&#36816;&#34892;&#65292;&#20174;&#26368;&#21518;&#19968;&#27425;&#25104;&#21151;&#30340;&#25552;&#20132; build &#20013;&#21462;&#20986;&#21487;&#25191;&#34892;&#25991;&#20214;&#20316;&#36827;&#19968;&#27493;&#27979;&#35797;&#12290;&#22914;&#26524;&#27425;&#32423; build  &#22833;&#36133;&#20102;&#65292;&#22823;&#23478;&#19981;&#20250;&#31435;&#21051;&#20572;&#19979;&#25163;&#20013;&#25152;&#26377;&#24037;&#20316;&#21435;&#20462;&#22797;&#65292;&#20294;&#22242;&#38431;&#20063;&#35201;&#22312;&#20445;&#35777;&#25552;&#20132; build &#27491;&#24120;&#36816;&#34892;&#30340;&#21516;&#26102;&#23613;&#24555;&#20462;&#27491; bug&#12290;&#23454;&#38469;&#19978;&#27425;&#32423; build  &#24182;&#38750;&#19968;&#23450;&#35201;&#27491;&#24120;&#36816;&#34892;&#65292;&#21482;&#35201; bug &#37117;&#33021;&#22815;&#34987;&#26816;&#26597;&#20986;&#26469;&#24182;&#19988;&#33021;&#23613;&#24555;&#24471;&#21040;&#35299;&#20915;&#23601;&#22909;&#12290;&#22312;&#20004;&#38454;&#27573; build &#30340;&#20363;&#23376;&#37324;&#65292;&#27425;&#32423; build  &#32463;&#24120;&#21482;&#26159;&#32431;&#31929;&#30340;&#27979;&#35797;&#65292;&#22240;&#20026;&#36890;&#24120;&#21482;&#26159;&#27979;&#35797;&#25302;&#24930;&#20102;&#36895;&#24230;&#12290;</p> <p><br> </p> <p>&#22914;&#26524;&#27425;&#32423; build &#26816;&#26597;&#21040;&#20102;  bug&#65292;&#36825;&#26159;&#19968;&#20010;&#20449;&#21495;&#65292;&#24847;&#21619;&#30528;&#25552;&#20132; build &#38656;&#35201;&#28155;&#21152;&#19968;&#20010;&#26032;&#27979;&#35797;&#20102;&#12290;&#20320;&#24212;&#35813;&#23613;&#21487;&#33021;&#25226;&#27425;&#32423; build &#22833;&#36133;&#36807;&#30340;&#27979;&#35797;&#29992;&#20363;&#37117;&#28155;&#21152;&#21040;&#25552;&#20132; build  &#20013;&#65292;&#20351;&#24471;&#25552;&#20132; build &#26377;&#33021;&#21147;&#39564;&#35777;&#36825;&#20123; bug&#12290;&#27599;&#24403;&#26377; bug &#32469;&#36807;&#25552;&#20132;&#27979;&#35797;&#65292;&#25552;&#20132;&#27979;&#35797;&#24635;&#33021;&#36890;&#36807;&#36825;&#31181;&#26041;&#27861;&#34987;&#21152;&#24378;&#12290;&#26377;&#26102;&#20505;&#30830;&#23454;&#26080;&#27861;&#25214;&#21040;&#27979;&#35797;&#36895;&#24230;&#21644;  bug &#39564;&#35777;&#20860;&#39038;&#30340;&#26041;&#27861;&#65292;&#20320;&#19981;&#24471;&#19981;&#20915;&#23450;&#25226;&#36825;&#20010;&#27979;&#35797;&#25918;&#22238;&#21040;&#27425;&#32423; build &#37324;&#12290;&#20294;&#22823;&#37096;&#20998;&#24773;&#20917;&#19979;&#37117;&#24212;&#35813;&#21487;&#20197;&#25214;&#21040;&#21512;&#36866;&#21152;&#20837;&#25552;&#20132; build &#30340;&#27979;&#35797;&#12290;</p>  <p><br> </p> <p>&#19978;&#38754;&#36825;&#20010;&#20363;&#23376;&#26159;&#20851;&#20110;&#20004;&#38454;&#27573; build&#65292;&#20294;&#22522;&#26412;&#21407;&#21017;&#21487;&#20197;&#34987;&#25512;&#24191;&#21040;&#20219;&#24847;&#25968;&#37327;&#30340;&#21518;&#38454;&#27573; build&#12290;&#25552;&#20132; build  &#20043;&#21518;&#30340;&#20854;&#23427; build  &#37117;&#21487;&#20197;&#21516;&#26102;&#36827;&#34892;&#65292;&#25152;&#20197;&#22914;&#26524;&#20320;&#30340;&#27425;&#32423;&#27979;&#35797;&#35201;&#20004;&#23567;&#26102;&#25165;&#33021;&#23436;&#25104;&#65292;&#20320;&#21487;&#20197;&#36890;&#36807;&#29992;&#20004;&#21488;&#26426;&#22120;&#21508;&#36816;&#34892;&#19968;&#21322;&#27979;&#35797;&#26469;&#24555;&#19968;&#28857;&#25343;&#21040;&#32467;&#26524;&#12290;&#36890;&#36807;&#36825;&#20010;&#24182;&#34892;&#27425;&#32423; build  &#25216;&#24039;&#65292;&#20320;&#21487;&#20197;&#21521;&#26085;&#24120; build &#27969;&#31243;&#20013;&#24341;&#20837;&#21253;&#25324;&#24615;&#33021;&#27979;&#35797;&#22312;&#20869;&#30340;&#21508;&#31181;&#33258;&#21160;&#21270;&#27979;&#35797;&#12290;&#65288;&#24403;&#25105;&#36807;&#21435;&#20960;&#24180;&#20869;&#21442;&#21152; Thoughtworks  &#30340;&#21508;&#31181;&#39033;&#30446;&#26102;&#65292;&#25105;&#30896;&#21040;&#20102;&#24456;&#22810;&#26377;&#36259;&#30340;&#25216;&#24039;&#65292;&#25105;&#24076;&#26395;&#33021;&#22815;&#35828;&#26381;&#19968;&#20123;&#24320;&#21457;&#32773;&#25226;&#36825;&#20123;&#32463;&#39564;&#20889;&#20986;&#26469;&#12290;&#65289;</p> <p><br> </p> <h3>&#22312;&#27169;&#25311;&#29983;&#20135;&#29615;&#22659;&#20013;&#36827; &#34892;&#27979;&#35797;</h3> <p><br> </p> <p>&#27979;&#35797;&#30340;&#20851;&#38190;&#22312;&#20110;&#22312;&#21463;&#25511;&#26465;&#20214;&#19979;&#25214;&#20986;&#31995;&#32479;&#20869;&#21487;&#33021;&#22312;&#23454;&#38469;&#29983;&#20135;&#20013;&#20986;&#29616;&#30340;&#20219;&#20309;&#38382;&#39064;&#12290;&#36825;&#37324;&#19968;&#20010;&#26126;&#26174;&#30340;&#22240;&#32032;&#26159;&#29983;&#20135;&#31995; &#32479;&#30340;&#36816;&#34892;&#29615;&#22659;&#12290;&#22914;&#26524;&#20320;&#19981;&#22312;&#29983;&#20135;&#29615;&#22659;&#20570;&#27979;&#35797;&#65292;&#25152;&#26377;&#29615;&#22659;&#24046;&#24322;&#37117;&#26159;&#39118;&#38505;&#65292;&#21487;&#33021;&#26368;&#32456;&#36896;&#25104;&#27979;&#35797;&#29615;&#22659;&#20013;&#36816;&#34892;&#27491;&#24120;&#30340;&#36719;&#20214;&#22312;&#29983;&#20135;&#29615;&#22659;&#20013;&#26080;&#27861;&#27491;&#24120;&#36816;&#34892;&#12290;</p> <p><br>  </p> <p>&#33258;&#28982;&#20320;&#20250;&#24819;&#21040;&#24314;&#31435;&#19968;&#20010;&#19982;&#29983;&#20135;&#29615;&#22659;&#23613;&#21487;&#33021;&#23436;&#20840;&#30456;&#21516;&#30340;&#27979;&#35797;&#29615;&#22659;&#12290;&#29992;&#30456;&#21516;&#30340;&#25968;&#25454;&#24211;&#36719;&#20214;&#65292;&#36824;&#35201;&#21516;&#19968;&#20010;&#29256;&#26412;&#65307;&#29992;&#30456;&#21516;&#29256;&#26412;&#30340;&#25805;&#20316;&#31995;&#32479;&#65307;&#25226;&#25152;&#26377;&#29983;&#20135;&#29615; &#22659;&#29992;&#21040;&#30340;&#24211;&#25991;&#20214;&#37117;&#25918;&#36827;&#27979;&#35797;&#29615;&#22659;&#20013;&#65292;&#21363;&#20351;&#20320;&#30340;&#31995;&#32479;&#27809;&#26377;&#30495;&#27491;&#29992;&#21040;&#23427;&#20204;&#65307;&#20351;&#29992;&#30456;&#21516;&#30340;IP&#22320;&#22336;&#21644;&#31471;&#21475;&#65307;&#20197;&#21450;&#30456;&#21516;&#30340;&#30828;&#20214;&#65307;</p> <p><br> </p> <p>&#22909; &#21543;&#65292;&#29616;&#23454;&#20013;&#36824;&#26159;&#26377;&#24456;&#22810;&#38480;&#21046;&#30340;&#12290;&#22914;&#26524;&#20320;&#22312;&#20889;&#19968;&#20010;&#26700;&#38754;&#24212;&#29992;&#36719;&#20214;&#65292;&#24819;&#35201;&#27169;&#25311;&#25152;&#26377;&#22411;&#21495;&#30340;&#35013;&#26377;&#19981;&#21516;&#31532;&#19977;&#26041;&#36719;&#20214;&#30340;&#21488;&#24335;&#26426;&#26469;&#27979;&#35797;&#26174;&#28982;&#26159;&#19981;&#29616;&#23454;&#30340;&#12290;&#31867;&#20284;&#30340;&#65292;&#26377;&#20123;&#29983;&#20135;&#29615;&#22659;&#21487; &#33021;&#22240;&#20026;&#36807;&#20110;&#26114;&#36149;&#32780;&#26080;&#27861;&#22797;&#21046;&#65288;&#23613;&#31649;&#25105;&#24120;&#30896;&#21040;&#20986;&#20110;&#32463;&#27982;&#32771;&#34385;&#25298;&#32477;&#22797;&#21046;&#19981;&#31639;&#22826;&#36149;&#30340;&#29615;&#22659;&#65292;&#32467;&#26524;&#24471;&#19981;&#20607;&#22833;&#30340;&#20363;&#23376;&#65289;&#12290;&#21363;&#20351;&#26377;&#36825;&#20123;&#38480;&#21046;&#65292;&#20320;&#30340;&#30446;&#26631;&#20173;&#28982;&#26159;&#23613;&#21487;&#33021;&#22320;&#22797;&#21046;&#29983;&#20135;&#29615; &#22659;&#65292;&#24182;&#19988;&#35201;&#29702;&#35299;&#24182;&#25509;&#21463;&#22240;&#27979;&#35797;&#29615;&#22659;&#21644;&#29983;&#20135;&#29615;&#22659;&#19981;&#21516;&#24102;&#26469;&#30340;&#39118;&#38505;&#12290;</p> <p><br> </p> <p>&#22914;&#26524;&#20320;&#30340;&#23433;&#35013;&#27493;&#39588;&#36275;&#22815;&#31616;&#21333;&#65292;&#26080;&#38656;&#22826;&#22810;&#20132;&#20114;&#65292;&#20320;&#20063;&#35768; &#33021;&#22312;&#19968;&#20010;&#27169;&#25311;&#29983;&#20135;&#29615;&#22659;&#37324;&#36816;&#34892;&#25552;&#20132; build&#12290;&#20294;&#20107;&#23454;&#19978;&#31995;&#32479;&#32463;&#24120;&#21453;&#24212;&#32531;&#24930;&#25110;&#19981;&#22815;&#31283;&#23450;&#65292;&#36825;&#21487;&#20197;&#29992;&#160;<a href="http://www.martinfowler.com/bliki/TestDouble.html" target="_blank">test  double</a>&#160;&#26469;&#35299;&#20915;&#12290;&#32467;&#26524;&#24120;&#24120;&#26159;&#25552;&#20132;&#27979;&#35797;&#20026;&#20102;&#36895;&#24230;&#21407;&#22240;&#22312;&#19968;&#20010;&#20551;&#29615;&#22659;&#20869;&#36816;&#34892;&#65292;&#32780;&#27425;&#32423;&#27979;&#35797;&#36816;&#34892;&#22312;&#27169;&#25311;&#30495;&#23454;&#30340;&#29983;&#20135;&#29615;&#22659;&#20013;&#12290;</p> <p><br>  </p> <p>&#25105;&#27880;&#24847;&#21040;&#36234;&#26469;&#36234;&#22810;&#20154;&#29992;&#34394;&#25311;&#21270;&#26469;&#25645;&#24314;&#27979;&#35797;&#29615;&#22659;&#12290;&#34394;&#25311;&#26426;&#30340;&#29366;&#24577;&#21487;&#20197;&#34987;&#20445;&#23384;&#65292;&#22240;&#27492;&#23433;&#35013;&#24182;&#27979;&#35797;&#26368;&#26032;&#29256;&#26412;&#30340;build&#30456;&#23545;&#31616;&#21333;&#12290;&#27492;&#22806;&#65292;&#36825;&#21487;&#20197;&#35753;&#20320; &#22312;&#19968;&#21488;&#26426;&#22120;&#19978;&#36816;&#34892;&#22810;&#20010;&#27979;&#35797;&#65292;&#25110;&#22312;&#19968;&#21488;&#26426;&#22120;&#19978;&#27169;&#25311;&#32593;&#32476;&#37324;&#30340;&#22810;&#21488;&#20027;&#26426;&#12290;&#38543;&#30528;&#34394;&#25311;&#21270;&#24615;&#33021;&#30340;&#25552;&#21319;&#65292;&#36825;&#31181;&#36873;&#25321;&#30475;&#36215;&#26469;&#36234;&#26469;&#36234;&#21487;&#34892;&#12290;</p> <p><br> </p>  <h3>&#35753;&#27599;&#20010;&#20154;&#37117;&#33021;&#36731;&#26131;&#33719;&#24471;&#26368;&#26032;&#30340;&#21487;&#25191;&#34892;&#25991;&#20214;</h3> <p><br> </p> <p>&#36719;&#20214;&#24320;&#21457;&#20013;&#26368;&#22256;&#38590;&#30340;&#37096;&#20998;&#26159;&#30830;&#23450;&#20320;&#30340;&#36719;&#20214;&#34892;&#20026;&#31526;&#21512;&#39044;&#26399;&#12290;&#25105;&#20204; &#21457;&#29616;&#20107;&#20808;&#28165;&#26970;&#24182;&#27491;&#30830;&#25551;&#36848;&#38656;&#27714;&#38750;&#24120;&#22256;&#38590;&#12290;&#23545;&#20154;&#20204;&#32780;&#35328;&#65292;&#22312;&#19968;&#20010;&#26377;&#32570;&#38519;&#30340;&#19996;&#35199;&#19978;&#25351;&#20986;&#38656;&#35201;&#20462;&#25913;&#30340;&#22320;&#26041;&#35201;&#23481;&#26131;&#24471;&#22810;&#12290;&#25935;&#25463;&#24320;&#21457;&#36807;&#31243;&#35748;&#21487;&#36825;&#31181;&#34892;&#20026;&#65292;&#24182;&#20174;&#20013;&#21463;&#30410;&#12290;</p>  <p><br> </p> <p>&#20026;&#20102;&#20197;&#36825;&#31181;&#26041;&#24335;&#24037;&#20316;&#65292;&#39033;&#30446;&#20013;&#30340;&#27599;&#20010;&#20154;&#37117;&#24212;&#35813;&#33021;&#25343;&#21040;&#26368;&#26032;&#30340;&#21487;&#25191;&#34892;&#25991;&#20214;&#24182;&#36816;&#34892;&#12290;&#30446;&#30340;&#21487;&#20197;&#20026;&#20102;  demo&#65292;&#20063;&#21487;&#20197;&#20026;&#20102;&#25506;&#32034;&#24615;&#27979;&#35797;&#65292;&#25110;&#32773;&#21482;&#26159;&#20026;&#20102;&#30475;&#30475;&#36825;&#21608;&#26377;&#20160;&#20040;&#36827;&#23637;&#12290;</p> <p><br> </p> <p>&#36825;&#20570;&#36215;&#26469;&#20854;&#23454;&#30456;&#24403;&#31616;&#21333;&#65306;&#21482;&#35201;&#25214;&#21040;&#19968;&#20010;&#22823;&#23478; &#37117;&#30693;&#36947;&#30340;&#22320;&#26041;&#26469;&#25918;&#32622;&#21487;&#25191;&#34892;&#25991;&#20214;&#21363;&#21487;&#12290;&#21487;&#20197;&#21516;&#26102;&#20445;&#23384;&#22810;&#20221;&#21487;&#25191;&#34892;&#25991;&#20214;&#20197;&#22791;&#20351;&#29992;&#12290;&#27599;&#27425;&#25918;&#36827;&#21435;&#30340;&#21487;&#25191;&#34892;&#25991;&#20214;&#24212;&#35813;&#35201;&#36890;&#36807;&#25552;&#20132;&#27979;&#35797;&#65292;&#25552;&#20132;&#27979;&#35797;&#36234;&#20581;&#22766;&#65292;&#21487;&#25191;&#34892;&#25991;&#20214;&#23601;&#20250;&#36234; &#31283;&#23450;&#12290;</p> <p><br> </p> <p>&#22914;&#26524;&#20320;&#37319;&#29992;&#30340;&#36807;&#31243;&#26159;&#19968;&#20010;&#36275;&#22815;&#22909;&#30340;&#36845;&#20195;&#36807;&#31243;&#65292;&#25226;&#27599;&#27425;&#36845;&#20195;&#20013;&#26368;&#21518;&#19968;&#20010; build  &#25918;&#36827;&#21435;&#36890;&#24120;&#26159;&#26126;&#26234;&#30340;&#20915;&#23450;&#12290;Demo &#26159;&#19968;&#20010;&#29305;&#20363;&#65292;&#34987; demo &#30340;&#36719;&#20214;&#29305;&#24615;&#37117;&#24212;&#35813;&#26159;&#28436;&#31034;&#32773;&#29087;&#24713;&#30340;&#29305;&#24615;&#12290;&#20026;&#20102; demo &#30340;&#25928;&#26524;&#20540;&#24471;&#29306;&#29298;&#25481;&#26368;&#26032;&#30340;  build&#65292;&#36716;&#32780;&#25214;&#19968;&#20010;&#26089;&#19968;&#28857;&#20294;&#28436;&#31034;&#32773;&#26356;&#29087;&#24713;&#30340;&#29256;&#26412;&#12290;</p> <p><br> </p> <h3>&#27599;&#20010;&#20154;&#37117;&#33021;&#30475;&#21040;&#36827;&#24230;</h3> <p><br> </p>  <p>&#25345;&#32493;&#38598;&#25104;&#20013;&#26368;&#37325;&#35201;&#30340;&#26159;&#27807;&#36890;&#12290;&#20320;&#38656;&#35201;&#20445;&#35777;&#27599;&#20010;&#20154;&#37117;&#33021;&#36731;&#26131;&#30475;&#21040;&#31995;&#32479;&#30340;&#29366;&#24577;&#21644;&#26368;&#26032;&#30340;&#20462;&#25913;&#12290;</p> <p><br> </p> <p>&#27807;&#36890;&#30340;&#26368;&#37325;&#35201;&#30340;&#36884; &#24452;&#20043;&#19968;&#26159; mainline build&#12290;&#22914;&#26524;&#20320;&#29992; Cruise&#65292;&#19968;&#20010;&#20869;&#24314;&#30340;&#32593;&#31449;&#20250;&#21578;&#35785;&#20320;&#26159;&#21542;&#27491;&#26377; build &#22312;&#36827;&#34892;&#65292;&#21644;&#26368;&#36817;&#19968;&#27425; mainline  build &#30340;&#29366;&#24577;&#12290;&#35768;&#22810;&#22242;&#38431;&#21916;&#27426;&#25226;&#19968;&#20010;&#25345;&#32493;&#24037;&#20316;&#30340;&#29366;&#24577;&#26174;&#31034;&#35774;&#22791;&#36830;&#25509;&#21040; build  &#31995;&#32479;&#26469;&#35753;&#36825;&#20010;&#36807;&#31243;&#26356;&#21152;&#24341;&#20154;&#27880;&#30446;&#65292;&#26368;&#21463;&#27426;&#36814;&#30340;&#26174;&#31034;&#35774;&#22791;&#26159;&#28783;&#20809;&#65292;&#32511;&#28783;&#38378;&#20142;&#34920;&#31034; build &#25104;&#21151;&#65292;&#32418;&#28783;&#34920;&#31034;&#22833;&#36133;&#12290;&#19968;&#31181;&#24120;&#35265;&#30340;&#36873;&#25321;&#26159;&#32418;&#33394;&#21644;&#32511;&#33394;&#30340;<a href="http://www.pragmaticautomation.com/cgi-bin/pragauto.cgi/Monitor/Devices/BubbleBubbleBuildsInTrouble.rdoc" target="_blank">&#29076;&#23721;&#28783;</a>&#65292;&#36825;&#19981;&#20165;&#20165;&#25351;&#31034; build &#30340;&#29366;&#24577;&#65292;&#36824;&#33021;&#25351;&#31034;&#23427;&#20572;&#30041;&#22312;&#36825;&#20010;&#29366;&#24577;&#30340;&#26102;&#38388;&#38271;&#30701;&#65292;&#32418;&#28783;&#37324;&#20986;&#29616;&#27668;&#27873;&#34920;&#31034;  build &#20986;&#38382;&#39064;&#24050;&#32463;&#22826;&#38271;&#26102;&#38388;&#20102;&#12290;&#27599;&#19968;&#20010;&#22242;&#38431;&#37117;&#20250;&#36873;&#25321;&#20182;&#20204;&#33258;&#24049;&#30340; build  &#20256;&#24863;&#22120;&#12290;&#22914;&#26524;&#20320;&#30340;&#36873;&#25321;&#24102;&#28857;&#24189;&#40664;&#24615;&#21644;&#23089;&#20048;&#24615;&#25928;&#26524;&#20250;&#26356;&#22909;&#65288;&#26368;&#36817;&#25105;&#30475;&#21040;&#26377;&#20154;&#22312;&#23454;&#39564;&#36339;&#33310;&#20820;&#65289;&#12290;</p> <p><br> </p> <p>&#21363;&#20351;&#20320;&#22312;&#20351;&#29992;&#25163;&#21160;&#25345;&#32493;&#38598; &#25104;&#65292;&#21487;&#35265;&#31243;&#24230;&#20381;&#28982;&#24456;&#37325;&#35201;&#12290;Build &#35745;&#31639;&#26426;&#30340;&#26174;&#31034;&#22120;&#21487;&#20197;&#29992;&#26469;&#26174;&#31034; mainline build &#30340;&#29366;&#24577;&#12290;&#20320;&#24456;&#21487;&#33021;&#38656;&#35201;&#19968;&#20010; build  &#20196;&#29260;&#25918;&#22312;&#27491;&#22312;&#20570; build &#37027;&#20154;&#30340;&#26700;&#23376;&#19978;&#65288;&#27233;&#30382;&#40481;&#36825;&#31181;&#30475;&#19978;&#21435;&#20667;&#20667;&#30340;&#19996;&#35199;&#26368;&#22909;&#65292;&#21407;&#22240;&#21516;&#19978;&#65289;&#12290;&#26377;&#26102;&#20154;&#20204;&#20250;&#24819;&#22312; build  &#25104;&#21151;&#26102;&#24324;&#20986;&#19968;&#28857;&#22122;&#38899;&#26469;&#65292;&#27604;&#22914;&#25671;&#38083;&#30340;&#22768;&#38899;&#12290;</p> <p><br> </p> <p>&#25345;&#32493;&#38598;&#25104;&#26381;&#21153;&#22120;&#36719;&#20214;&#30340;&#32593;&#39029;&#21487;&#20197;&#25215;&#36733;&#26356;&#22810;&#20449;&#24687;&#12290;Cruise  &#19981;&#20165;&#26174;&#31034;&#35841;&#22312;&#20570; build&#65292;&#36824;&#33021;&#25351;&#20986;&#20182;&#20204;&#37117;&#25913;&#20102;&#20160;&#20040;&#12290;Cruise &#36824;&#25552;&#20379;&#20102;&#19968;&#20010;&#21382;&#21490;&#20462;&#25913;&#35760;&#24405;&#65292;&#20197;&#20415;&#22242;&#38431;&#25104;&#21592;&#33021;&#22815;&#23545;&#26368;&#36817;&#39033;&#30446;&#37324;&#30340;&#24773;&#20917;&#26377;&#25152;&#20102;&#35299;&#12290;&#25105;&#30693;&#36947;  team leader&#21916;&#27426;&#29992;&#36825;&#20010;&#21151;&#33021;&#20102;&#35299;&#22823;&#23478;&#25163;&#22836;&#30340;&#24037;&#20316;&#21644;&#36861;&#36394;&#31995;&#32479;&#30340;&#26356;&#25913;&#12290;</p> <p><br> </p> <p>&#20351;&#29992;&#32593;&#31449;&#30340;&#21478;&#19968;&#22823;&#20248;&#28857;&#26159;&#20415;&#20110;&#37027;&#20123; &#36828;&#31243;&#24037;&#20316;&#30340;&#20154;&#20102;&#35299;&#39033;&#30446;&#30340;&#29366;&#24577;&#12290;&#19968;&#33324;&#26469;&#35828;&#65292;&#25105;&#20542;&#21521;&#20110;&#35753;&#39033;&#30446;&#20013;&#21457;&#25381;&#20316;&#29992;&#30340;&#25104;&#21592;&#37117;&#22352;&#22312;&#19968;&#36215;&#24037;&#20316;&#65292;&#20294;&#36890;&#24120;&#20063;&#20250;&#26377;&#19968;&#20123;&#22806;&#22260;&#20154;&#21592;&#24819;&#35201;&#20102;&#35299;&#39033;&#30446;&#30340;&#21160;&#24577;&#12290;&#22914;&#26524;&#32452;&#32455;&#24819;&#35201;&#25226;&#22810; &#20010;&#39033;&#30446;&#30340; build&#24773;&#20917;&#32858;&#21512;&#36215;&#26469;&#20197;&#25552;&#20379;&#33258;&#21160;&#26356;&#26032;&#30340;&#31616;&#21333;&#29366;&#24577;&#26102;&#65292;&#36825;&#20063;&#20250;&#24456;&#26377;&#29992;&#12290;</p> <p><br> </p> <p>&#22909;&#30340;&#20449;&#24687;&#23637;&#31034;&#26041;&#24335;&#19981;&#20165;&#20165;&#20381;&#36182;&#20110; &#30005;&#33041;&#26174;&#31034;&#22120;&#12290;&#25105;&#26368;&#21916;&#27426;&#30340;&#26041;&#24335;&#20986;&#29616;&#20110;&#19968;&#20010;&#20013;&#36884;&#36716;&#20837;&#25345;&#32493;&#38598;&#25104;&#30340;&#39033;&#30446;&#12290;&#24456;&#38271;&#26102;&#38388;&#23427;&#37117;&#26080;&#27861;&#25343;&#20986;&#19968;&#20010;&#31283;&#23450;&#30340;  build&#12290;&#25105;&#20204;&#22312;&#22681;&#19978;&#36148;&#20102;&#19968;&#25972;&#24180;&#30340;&#26085;&#21382;&#65292;&#27599;&#19968;&#22825;&#37117;&#26159;&#19968;&#20010;&#23567;&#26041;&#22359;&#12290;&#27599;&#19968;&#22825;&#22914;&#26524; QA &#22242;&#38431;&#25910;&#21040;&#20102;&#19968;&#20010;&#33021;&#36890;&#36807;&#25552;&#20132;&#27979;&#35797;&#30340;&#31283;&#23450;  build&#65292;&#20182;&#20204;&#37117;&#20250;&#36148;&#19968;&#24352;&#32511;&#33394;&#30340;&#36148;&#32440;&#65292;&#21542;&#21017;&#23601;&#26159;&#32418;&#33394;&#30340;&#36148;&#32440;&#12290;&#26085;&#31215;&#26376;&#32047;&#65292;&#20174;&#26085;&#21382;&#19978;&#33021;&#30475;&#20986; build  &#36807;&#31243;&#22312;&#31283;&#23450;&#22320;&#36827;&#27493;&#12290;&#30452;&#21040;&#32511;&#33394;&#30340;&#23567;&#26041;&#22359;&#24050;&#32463;&#21344;&#25454;&#20102;&#22823;&#37096;&#20998;&#30340;&#31354;&#38388;&#26102;&#65292;&#26085;&#21382;&#34987;&#25764;&#25481;&#20102;&#65292;&#22240;&#20026;&#23427;&#30340;&#20351;&#21629;&#24050;&#32463;&#23436;&#25104;&#20102;&#12290;</p> <p><br> </p> <h3>&#33258; &#21160;&#21270;&#37096;&#32626;</h3> <p><br> </p> <p>&#33258;&#21160;&#21270;&#38598;&#25104;&#38656;&#35201;&#22810;&#20010;&#29615;&#22659;&#65292;&#19968;&#20010;&#36816;&#34892;&#25552;&#20132;&#27979;&#35797;&#65292;&#19968;&#20010;&#25110;&#22810;&#20010;&#36816;&#34892;&#27425;&#32423;&#27979;&#35797;&#12290;&#27599;&#22825;&#22312;&#36825;&#20123;&#29615;&#22659;&#20043;&#38388;&#39057;&#32321;&#25335;&#36125; &#21487;&#25191;&#34892;&#25991;&#20214;&#21487;&#19981;&#36731;&#26494;&#65292;&#33258;&#21160;&#21270;&#26159;&#19968;&#20010;&#26356;&#22909;&#30340;&#26041;&#26696;&#12290;&#20026;&#23454;&#29616;&#33258;&#21160;&#21270;&#65292;&#20320;&#24517;&#39035;&#26377;&#20960;&#20010;&#24110;&#20320;&#23558;&#24212;&#29992;&#36731;&#26494;&#37096;&#32626;&#21040;&#21508;&#20010;&#29615;&#22659;&#20013;&#30340;&#33050;&#26412;&#12290;&#26377;&#20102;&#33050;&#26412;&#20043;&#21518;&#65292;&#33258;&#28982;&#32780;&#28982;&#30340;&#32467;&#26524;&#26159;&#20320;&#20063;&#35201; &#29992;&#31867;&#20284;&#30340;&#26041;&#24335;&#37096;&#32626;&#21040;&#29983;&#20135;&#29615;&#22659;&#20013;&#12290;&#20320;&#21487;&#33021;&#19981;&#38656;&#35201;&#27599;&#22825;&#37117;&#37096;&#32626;&#21040;&#29983;&#20135;&#29615;&#22659;&#65288;&#23613;&#31649;&#25105;&#35265;&#36807;&#36825;&#20040;&#20570;&#30340;&#39033;&#30446;&#65289;&#65292;&#20294;&#33258;&#21160;&#21270;&#33021;&#22815;&#21152;&#24555;&#36895;&#24230;&#24182;&#20943;&#23569;&#38169;&#35823;&#12290;&#23427;&#30340;&#20195;&#20215;&#20063;&#24456;&#20302;&#65292;&#22240;&#20026;&#23427; &#22522;&#26412;&#19978;&#21644;&#20320;&#37096;&#32626;&#21040;&#27979;&#35797;&#29615;&#22659;&#26159;&#19968;&#22238;&#20107;&#12290;</p> <p><br> </p> <p>&#22914;&#26524;&#20320;&#37096;&#32626;&#21040;&#29983;&#20135;&#29615;&#22659;&#65292;&#20320;&#38656;&#35201;&#22810;&#32771;&#34385;&#19968;&#20214;&#20107;&#24773;&#65306;&#33258;&#21160;&#21270;&#22238;&#28378;&#12290;&#22351;&#20107;&#24773;&#38543;&#26102;&#21487; &#33021;&#21457;&#29983;&#65292;&#22914;&#26524;&#24773;&#20917;&#19981;&#22937;&#65292;&#26368;&#22909;&#30340;&#21150;&#27861;&#26159;&#23613;&#24555;&#22238;&#21040;&#19978;&#19968;&#20010;&#24050;&#30693;&#30340;&#27491;&#24120;&#29366;&#24577;&#12290;&#33021;&#22815;&#33258;&#21160;&#22238;&#28378;&#20063;&#20250;&#20943;&#36731;&#37096;&#32626;&#30340;&#21387;&#21147;&#65292;&#20174;&#32780;&#40723;&#21169;&#20154;&#20204;&#26356;&#39057;&#32321;&#22320;&#37096;&#32626;&#65292;&#20351;&#24471;&#26032;&#21151;&#33021;&#26356;&#24555;&#21457;&#24067;&#32473;&#29992; &#25143;&#12290;&#65288;Ruby on Rails &#31038;&#21306;&#24320;&#21457;&#20102;&#19968;&#20010;&#21517;&#20026;&#160;<a href="http://capify.org/" target="_blank">Capistrano</a>&#160;&#30340;&#24037;&#20855;&#65292;&#26159;&#36825;&#31867;&#24037;&#20855;&#24456;&#22909;&#30340;&#20195;&#34920;&#12290;&#65289;</p> <p><br> </p> <p>&#25105;&#36824;&#22312;&#26381; &#21153;&#22120;&#38598;&#32676;&#29615;&#22659;&#20013;&#35265;&#36807;&#28378;&#21160;&#37096;&#32626;&#30340;&#26041;&#27861;&#65292;&#26032;&#36719;&#20214;&#27599;&#27425;&#34987;&#37096;&#32626;&#21040;&#19968;&#20010;&#33410;&#28857;&#19978;&#65292;&#22312;&#20960;&#23567;&#26102;&#26102;&#38388;&#20869;&#36880;&#27493;&#26367;&#25442;&#25481;&#21407;&#26377;&#30340;&#36719;&#20214;&#12290;</p> <p><br> </p> <blockquote><p><strong>&#21442;&#35265;&#30456;&#20851;&#25991;&#31456;&#65306;</strong><a href="http://www.martinfowler.com/articles/evodb.html" target="_blank">&#36827; &#21270;&#24335;&#25968;&#25454;&#24211;&#35774;&#35745;</a></p> <p>&#35768;&#22810;&#20154;&#22312;&#39057;&#32321;&#21457;&#24067;&#26102;&#37117;&#36935;&#21040;&#30340;&#19968;&#20010;&#38556;&#30861;&#26159;&#25968;&#25454;&#24211;&#30340;&#36801;&#31227;&#12290;&#25968;&#25454;&#24211;&#30340;&#25913;&#21160;&#24456;&#40635;&#28902;&#65292;&#22240;&#20026;&#20320;&#19981;&#33021;&#20165;&#20165;&#20462;&#25913;  schema&#65292;&#20320;&#36824;&#35201;&#20445;&#35777;&#25968;&#25454;&#26412;&#36523;&#20063;&#34987;&#39034;&#21033;&#36801;&#31227;&#12290;&#36825;&#31687;&#25991;&#31456;&#25551;&#36848;&#20102;&#25105;&#30340;&#21516;&#20107; Pramod Sadalage  &#33258;&#21160;&#21270;&#37325;&#26500;&#21644;&#36801;&#31227;&#25968;&#25454;&#24211;&#30340;&#25216;&#24039;&#12290;&#36825;&#31687;&#25991;&#31456;&#21482;&#26159;&#19968;&#20010;&#31616;&#21333;&#30340;&#35760;&#24405;&#65292;&#20854;&#20013;&#30340;&#20449;&#24687;&#22312; Pramod &#21644; Scott Amblers  &#20851;&#20110;&#25968;&#25454;&#24211;&#37325;&#26500;&#30340;&#20070;&#20013;&#26377;&#26356;&#35814;&#32454;&#30340;&#38416;&#36848;[ambler-sadalage]&#12290;</p> </blockquote> <p><br> </p> <p>&#22312;  web &#24212;&#29992;&#24320;&#21457;&#20013;&#65292;&#25105;&#30896;&#21040;&#30340;&#19968;&#20010;&#26377;&#36259;&#30340;&#24819;&#27861;&#26159;&#25226;&#19968;&#20010;&#35797;&#39564;&#24615;&#30340; build &#37096;&#32626;&#21040;&#29992;&#25143;&#30340;&#19968;&#20010;&#23376;&#38598;&#12290;&#22242;&#38431;&#21487;&#20197;&#35266;&#23519;&#36825;&#20010;&#35797;&#39564; build  &#34987;&#20351;&#29992;&#30340;&#24773;&#20917;&#65292;&#20197;&#20915;&#23450;&#26159;&#21542;&#23558;&#23427;&#37096;&#32626;&#21040;&#20840;&#20307;&#29992;&#25143;&#12290;&#20320;&#21487;&#20197;&#22312;&#20570;&#20986;&#26368;&#32456;&#20915;&#23450;&#20043;&#21069;&#35797;&#39564;&#26032;&#30340;&#21151;&#33021;&#21644;&#26032;&#30340;  UI&#12290;&#33258;&#21160;&#21270;&#37096;&#32626;&#21152;&#19978;&#33391;&#22909;&#30340;&#25345;&#32493;&#38598;&#25104;&#30340;&#32426;&#24459;&#26159;&#36825;&#39033;&#24037;&#20316;&#30340;&#22522;&#30784;&#12290; </p> <p><br> </p> <h2>&#25345;&#32493;&#38598;&#25104;&#30340;&#30410;&#22788; </h2> <p><br>  </p> <p>&#25105;&#35748;&#20026;&#25345;&#32493;&#38598;&#25104;&#26368;&#26174;&#33879;&#20063;&#26368;&#24191;&#27867;&#30340;&#30410;&#22788;&#26159;&#38477;&#20302;&#39118;&#38505;&#12290;&#35828;&#21040;&#36825;&#37324;&#65292;&#25105;&#30340;&#33041;&#28023;&#20013;&#36824;&#26159;&#20250;&#28014;&#29616;&#20986;&#31532;&#19968;&#27573;&#25551;&#36848;&#30340;&#26089;&#26399;&#36719;&#20214;&#39033;&#30446;&#12290;&#20182;&#20204;&#24050;&#32463;&#21040;&#20102;&#19968;&#20010;&#28459;&#38271;&#39033; &#30446;&#30340;&#26411;&#26399;&#65288;&#33267;&#23569;&#20182;&#20204;&#26399;&#26395;&#22914;&#27492;&#65289;&#65292;&#20294;&#36824;&#26159;&#19981;&#30693;&#36947;&#36317;&#31163;&#30495;&#27491;&#30340;&#32467;&#26463;&#26377;&#22810;&#36828;&#12290;</p> <p><br> </p> <p>&#24310;&#36831;&#38598;&#25104;&#30340;&#38382;&#39064;&#22312;&#20110;&#26102;&#38388;&#38590;&#20197;&#20272;&#35745;&#65292;&#20320;&#29978;&#33267; &#26080;&#27861;&#24471;&#30693;&#20320;&#30340;&#36827;&#23637;&#12290;&#32467;&#26524;&#26159;&#20320;&#22312;&#39033;&#30446;&#26368;&#32039;&#24352;&#30340;&#38454;&#27573;&#20043;&#19968;&#25226;&#33258;&#24049;&#32622;&#20837;&#20102;&#19968;&#20010;&#30450;&#21306;&#65292;&#27492;&#26102;&#21363;&#20351;&#27809;&#26377;&#25302;&#24310;&#65288;&#36825;&#24456;&#32597;&#35265;&#65289;&#20063;&#36731;&#26494;&#19981;&#20102;&#22810;&#23569;&#12290;</p> <p><br> </p>  <p>&#25345;&#32493;&#38598;&#25104;&#24039;&#22937;&#30340;&#35299;&#20915;&#20102;&#36825;&#20010;&#38382;&#39064;&#12290;&#38271;&#26102;&#38388;&#30340;&#38598;&#25104;&#19981;&#20877;&#23384;&#22312;&#65292;&#30450;&#21306;&#34987;&#24443;&#24213;&#28040;&#38500;&#20102;&#12290;&#22312;&#20219;&#20309;&#26102;&#38388;&#20320;&#37117;&#30693;&#36947;&#20320;&#33258;&#24049;&#30340;&#36827;&#23637;&#65292;&#20160;&#20040;&#33021;&#36816;&#36716;&#65292;&#20160;&#20040;&#19981;&#33021;&#36816;&#36716;&#65292;&#20320;&#31995;&#32479;&#37324; &#26377;&#20160;&#20040;&#26126;&#26174;&#30340; bug&#65292;&#36825;&#20123;&#37117;&#19968;&#30446;&#20102;&#28982;&#12290;</p> <p><br> </p> <p>Bug  &#35753;&#20154;&#24694;&#24515;&#65292;&#23427;&#25703;&#27585;&#20154;&#30340;&#33258;&#20449;&#65292;&#25630;&#20081;&#26102;&#38388;&#34920;&#65292;&#36824;&#30772;&#22351;&#22242;&#38431;&#24418;&#35937;&#12290;&#24050;&#37096;&#32626;&#36719;&#20214;&#37324;&#30340; bug &#25307;&#33268;&#29992;&#25143;&#30340;&#24594;&#27668;&#12290;&#26410;&#23436;&#25104;&#36719;&#20214;&#37324;&#30340; bug &#35753;&#20320;&#25509;&#19979;&#26469;&#30340;&#24320;&#21457;&#24037;&#20316;&#21463;&#38459;&#12290;</p>  <p><br> </p> <p>&#25345;&#32493;&#38598;&#25104;&#19981;&#33021;&#38450;&#27490; bug &#30340;&#20135;&#29983;&#65292;&#20294;&#23427;&#33021;&#26126;&#26174;&#35753;&#23547;&#25214;&#21644;&#20462;&#25913; bug  &#30340;&#24037;&#20316;&#21464;&#31616;&#21333;&#12290;&#20174;&#36825;&#20010;&#26041;&#38754;&#30475;&#65292;&#23427;&#26356;&#20687;&#33258;&#27979;&#35797;&#20195;&#30721;&#12290;&#22914;&#26524;&#20320;&#24341;&#20837; bug  &#21518;&#33021;&#24456;&#24555;&#21457;&#29616;&#65292;&#25913;&#27491;&#20063;&#20250;&#31616;&#21333;&#24471;&#22810;&#12290;&#22240;&#20026;&#20320;&#21482;&#25913;&#20102;&#31995;&#32479;&#20013;&#24456;&#23567;&#30340;&#19968;&#37096;&#20998;&#65292;&#20320;&#26080;&#38656;&#30475;&#24456;&#22810;&#20195;&#30721;&#23601;&#33021;&#25214;&#21040;&#38382;&#39064;&#25152;&#22312;&#12290;&#22240;&#20026;&#36825;&#19968;&#23567;&#37096;&#20998;&#20320;&#21018;&#21018;&#25913;&#36807;&#65292;&#20320;&#30340;&#35760;&#24518;&#36824;&#24456;&#26032;&#40092;&#65292;&#20063; &#20250;&#35753;&#25214; bug &#30340;&#24037;&#20316;&#31616;&#21333;&#19981;&#23569;&#12290;&#20320;&#36824;&#21487;&#20197;&#29992;<a href="http://www.martinfowler.com/bliki/DiffDebugging.html" target="_blank">&#24046;&#24322;&#35843;&#35797;</a>&#8212;&#8212;&#27604;&#36739;&#24403;&#21069;&#29256;&#26412;&#21644;&#20043;&#21069;&#27809;&#26377; bug &#30340;&#29256;&#26412;&#12290;</p> <p><br> </p> <p>Bug  &#20063;&#20250;&#31215;&#32047;&#12290;&#20320;&#30340; bug &#36234;&#22810;&#65292;&#35299;&#20915;&#25481;&#20219;&#20309;&#19968;&#20010;&#37117;&#20250;&#36234;&#22256;&#38590;&#12290;&#36825;&#37096;&#20998;&#21407;&#22240;&#26159; bug  &#20043;&#38388;&#30340;&#20114;&#30456;&#20316;&#29992;&#65292;&#20320;&#30475;&#21040;&#30340;&#22833;&#36133;&#23454;&#38469;&#19978;&#26159;&#22810;&#20010;&#38382;&#39064;&#21472;&#21152;&#30340;&#32467;&#26524;&#65292;&#36825;&#20351;&#24471;&#26816;&#26597;&#20854;&#20013;&#20219;&#20309;&#19968;&#20010;&#38382;&#39064;&#37117;&#26356;&#21152;&#22256;&#38590;&#12290;&#36824;&#26377;&#37096;&#20998;&#21407;&#22240;&#26159;&#24515;&#29702;&#23618;&#38754;&#30340;&#22240;&#32032;&#65292;&#24403;&#20154;&#20204;&#38754;&#23545;&#22823;&#37327;  bug &#26102;&#65292;&#20182;&#20204;&#23547;&#25214;&#21644;&#35299;&#20915; bug &#30340;&#21160;&#21147;&#23601;&#20250;&#20943;&#24369;&#12290;&#12298;Pragmatic Programmer&#12299;&#19968;&#20070;&#20013;&#31216;&#20043;&#20026;&#8220;<a href="http://www.amazon.com/exec/obidos/ASIN/020161622X" target="_blank">&#30772;&#31383;&#32508;&#21512;&#30151;</a>&#8220;&#12290;</p> <p><br> </p> <p>&#20351;&#29992;&#25345;&#32493;&#38598;&#25104;&#30340;&#39033;&#30446;&#30340;&#36890;&#24120;&#32467;&#26524;&#26159; bug  &#25968;&#30446;&#26126;&#26174;&#26356;&#23569;&#65292;&#19981;&#31649;&#22312;&#20135;&#21697;&#37324;&#36824;&#26159;&#24320;&#21457;&#36807;&#31243;&#20013;&#37117;&#26159;&#22914;&#27492;&#12290;&#28982;&#32780;&#65292;&#25105;&#24517;&#39035;&#24378;&#35843;&#65292;&#20320;&#21463;&#30410;&#30340;&#31243;&#24230;&#36319;&#20320;&#27979;&#35797;&#30340;&#23436;&#21892;&#31243;&#24230;&#30452;&#25509;&#30456;&#20851;&#12290;&#20854;&#23454;&#24314;&#31435;&#27979;&#35797;&#31995;&#32479;&#24182;&#38750;&#24819;&#35937;&#20013;&#37027;&#20040;&#22256;&#38590;&#65292; &#20294;&#24102;&#26469;&#30340;&#21306;&#21035;&#21364;&#26174;&#32780;&#26131;&#35265;&#12290;&#19968;&#33324;&#26469;&#35828;&#65292;&#22242;&#38431;&#38656;&#35201;&#33457;&#19968;&#23450;&#26102;&#38388;&#25165;&#33021;&#25226; bug &#25968;&#37327;&#20943;&#23569;&#21040;&#29702;&#24819;&#30340;&#22320;&#27493;&#12290;&#20570;&#21040;&#36825;&#19968;&#28857;&#24847;&#21619;&#30528;&#19981;&#26029;&#28155;&#21152;&#21644;&#25913;&#36827;&#27979;&#35797;&#20195;&#30721;&#12290;</p> <p><br>  </p> <p>&#22914;&#26524;&#20320;&#29992;&#20102;&#25345;&#32493;&#38598;&#25104;&#65292;&#20320;&#23601;&#35299;&#20915;&#20102;&#39057;&#32321;&#37096;&#32626;&#30340;&#26368;&#22823;&#38556;&#30861;&#20043;&#19968;&#12290;&#39057;&#32321;&#37096;&#32626;&#24456;&#26377;&#20215;&#20540;&#65292;&#22240;&#20026;&#23427;&#21487;&#20197;&#35753;&#20320;&#30340;&#29992;&#25143;&#23613;&#24555;&#29992;&#21040;&#26032;&#21151;&#33021;&#65292;&#20174;&#32780;&#24555;&#36895;&#25552;&#20379;&#21453;&#39304;&#65292; &#36825;&#26679;&#20182;&#20204;&#22312;&#24320;&#21457;&#36807;&#31243;&#20013;&#21487;&#20197;&#26377;&#26356;&#22810;&#30340;&#20114;&#21160;&#12290;&#36825;&#21487;&#20197;&#24110;&#21161;&#25171;&#30772;&#25105;&#24515;&#30446;&#20013;&#25104;&#21151;&#30340;&#36719;&#20214;&#24320;&#21457;&#26368;&#22823;&#30340;&#38556;&#30861;&#8212;&#8212;&#23458;&#25143;&#19982;&#24320;&#21457;&#22242;&#38431;&#20043;&#38388;&#30340;&#38556;&#30861;&#12290;</p> <p><br> </p>  <h2>&#24341;&#20837;&#25345;&#32493;&#38598;&#25104;</h2> <p><br> </p> <p>&#30475;&#21040;&#36825;&#37324;&#65292;&#20320;&#19968;&#23450;&#24819;&#35201;&#23581;&#35797;&#19968;&#19979;&#25345;&#32493;&#38598;&#25104;&#20102;&#12290;&#20294;&#26159;&#20174;&#21738;&#37324;&#24320;&#22987;&#21602;&#65311;&#25105;&#22312;&#19978;&#38754;&#25551;&#36848;&#20102;&#19968;&#25972;&#22871; &#30340;&#23454;&#36341;&#65292;&#36825;&#20123;&#21487;&#20197;&#35753;&#20320;&#20307;&#39564;&#21040;&#25152;&#26377;&#30340;&#22909;&#22788;&#12290;&#20294;&#20320;&#20063;&#19981;&#24517;&#19968;&#24320;&#22987;&#23601;&#29031;&#21333;&#20840;&#25910;&#65292;&#20320;&#26377;&#33258;&#24049;&#30340;&#36873;&#25321;&#20313;&#22320;&#65292;&#22522;&#26412;&#19978;&#21462;&#20915;&#20110;&#20320;&#30340;&#29615;&#22659;&#21644;&#22242;&#38431;&#30340;&#29305;&#24615;&#12290;&#25105;&#20204;&#20063;&#20174;&#36807;&#21435;&#30340;&#23454;&#36341;&#20013;&#21560;&#21462; &#20102;&#19968;&#20123;&#32463;&#39564;&#21644;&#25945;&#35757;&#65292;&#20570;&#22909;&#19979;&#38754;&#36825;&#20123;&#20107;&#20250;&#23545;&#20110;&#20320;&#30340;&#25345;&#32493;&#38598;&#25104;&#36816;&#20316;&#26377;&#37325;&#35201;&#30340;&#24847;&#20041;&#12290;</p> <p><br> </p> <p>&#26368;&#26089;&#30340;&#20960;&#27493;&#20043;&#19968;&#26159;&#23454;&#29616; build  &#33258;&#21160;&#21270;&#12290;&#25226;&#25152;&#26377;&#38656;&#35201;&#30340;&#19996;&#35199;&#37117;&#25918;&#36827;&#29256;&#26412;&#25511;&#21046;&#31995;&#32479;&#37324;&#65292;&#36825;&#26679;&#20320;&#23601;&#21487;&#20197;&#29992;&#19968;&#26465;&#21629;&#20196; build  &#25972;&#20010;&#31995;&#32479;&#12290;&#36825;&#23545;&#35768;&#22810;&#39033;&#30446;&#32780;&#35328;&#19981;&#26159;&#20160;&#20040;&#23567;&#20219;&#21153;&#65292;&#36825;&#23545;&#20110;&#20854;&#20182;&#19996;&#35199;&#27491;&#24120;&#24037;&#20316;&#38750;&#24120;&#37325;&#35201;&#12290;&#21018;&#24320;&#22987;&#20320;&#21487;&#33021;&#21482;&#26159;&#20598;&#23572;&#38656;&#35201;&#30340;&#26102;&#20505;&#20570;&#19968;&#20010; build&#65292;&#25110;&#32773;&#21482;&#26159;&#20570;&#19968;&#20010;&#33258;&#21160;&#30340;  nightly build&#12290;&#24403;&#20320;&#36824;&#27809;&#26377;&#24320;&#22987;&#25345;&#32493;&#38598;&#25104;&#26102;&#65292;&#33258;&#21160; nightly build &#20063;&#26159;&#19968;&#20010;&#19981;&#38169;&#30340;&#24320;&#22987;&#12290;</p> <p><br> </p>  <p>&#20854;&#27425;&#26159;&#24341;&#20837;&#19968;&#20123;&#33258;&#21160;&#21270;&#27979;&#35797;&#21040;&#20320;&#30340; build  &#20013;&#12290;&#35797;&#30528;&#25351;&#20986;&#20027;&#35201;&#20986;&#38169;&#30340;&#22320;&#26041;&#65292;&#24182;&#35201;&#35753;&#33258;&#21160;&#21270;&#27979;&#35797;&#26292;&#38706;&#36825;&#20123;&#38169;&#35823;&#12290;&#24314;&#31435;&#21448;&#24555;&#21448;&#22909;&#30340;&#27979;&#35797;&#38598;&#21512;&#20250;&#27604;&#36739;&#22256;&#38590;&#65292;&#29305;&#21035;&#22312;&#24050;&#23384;&#22312;&#30340;&#39033;&#30446;&#20013;&#65292;&#24314;&#31435;&#27979;&#35797;&#38656;&#35201;&#26102;&#38388;&#12290;&#20320;&#24517;&#39035;&#25214;&#20010;&#22320; &#26041;&#24320;&#22987;&#21160;&#25163;&#65292;&#23601;&#20687;&#20439;&#35805;&#35828;&#30340;&#65292;&#32599;&#39532;&#19981;&#26159;&#19968;&#22825;&#24314;&#25104;&#30340;&#12290;</p> <p><br> </p> <p>&#36824;&#35201;&#35797;&#30528;&#21152;&#24555;&#25552;&#20132; build &#30340;&#36895;&#24230;&#12290;&#34429;&#28982;&#38656;&#35201;&#20960;&#20010;&#23567;&#26102;  build &#30340;&#25345;&#32493;&#38598;&#25104;&#20063;&#27604;&#20160;&#20040;&#37117;&#27809;&#26377;&#22909;&#65292;&#20294;&#33021;&#20570;&#21040;&#20256;&#35828;&#20013;&#30340;10&#20998;&#38047;&#20250;&#26356;&#22909;&#12290;&#36825;&#36890;&#24120;&#35201;&#23545;&#20320;&#30340;&#20195;&#30721;&#21160;&#19968;&#20123;&#22823;&#25163;&#26415;&#65292;&#20197;&#21093;&#31163;&#23545;&#36816;&#34892;&#32531;&#24930;&#37027;&#37096;&#20998;&#30340;&#20381;&#36182;&#12290;</p> <p><br>  </p> <p>&#22914;&#26524;&#20320;&#21018;&#21018;&#24320;&#22987;&#19968;&#20010;&#26032;&#39033;&#30446;&#65292;&#20174;&#19968;&#24320;&#22987;&#23601;&#29992;&#25345;&#32493;&#38598;&#25104;&#12290;&#23545;build&#26102;&#38388;&#20445;&#25345;&#20851;&#27880;&#65292;&#24403;&#24930;&#20110;10&#20998;&#38047;&#26102;&#23601;&#31435;&#21363;&#37319;&#21462;&#34892;&#21160;&#12290;&#36890;&#36807;&#24555;&#36895;&#34892;&#21160;&#65292;&#20320;&#21487;&#20197; &#22312;&#20195;&#30721;&#21464;&#24471;&#22826;&#22823;&#20043;&#21069;&#20570;&#19968;&#20123;&#24517;&#35201;&#30340;&#26550;&#26500;&#35843;&#25972;&#12290;</p> <p><br> </p> <p>&#27604;&#25152;&#26377;&#20107;&#24773;&#37117;&#37325;&#35201;&#30340;&#26159;&#23547;&#25214;&#24110;&#21161;&#12290;&#25214;&#19968;&#20010;&#20197;&#21069;&#20570;&#36807;&#25345;&#32493;&#38598;&#25104;&#30340;&#20154;&#26469;&#24110; &#20320;&#12290;&#20687;&#25152;&#26377;&#26032;&#25216;&#24039;&#19968;&#26679;&#65292;&#24403;&#20320;&#19981;&#30693;&#36947;&#26368;&#32456;&#32467;&#26524;&#24590;&#26679;&#30340;&#26102;&#20505;&#20250;&#38750;&#24120;&#38590;&#20197;&#23454;&#26045;&#12290;&#35831;&#19968;&#20010;&#23548;&#24072;&#65288;mentor&#65289;&#21487;&#33021;&#20250;&#33457;&#20123;&#38065;&#65292;&#20294;&#22914;&#26524;&#20320;&#19981;&#20570;&#65292;&#20320;&#20250;&#20184;&#20986;&#26102;&#38388;&#21644;&#29983;&#20135;&#25928;&#29575;&#25439; &#22833;&#30340;&#20195;&#20215;&#12290;&#65288;&#20813;&#36131;&#22768;&#26126;/&#24191;&#21578;&#65306;&#26159;&#30340;&#65292;&#25105;&#20204; ThoughtWorks &#22312;&#36825;&#20010;&#39046;&#22495;&#25552;&#20379;&#21672;&#35810;&#26381;&#21153;&#12290;&#19981;&#31649;&#24590;&#26679;&#65292;&#25105;&#20204;&#26366;&#32463;&#29359;&#36807;&#20320;&#21487;&#33021;&#20250;&#29359;&#30340;&#22823;&#22810;&#25968;&#38169;&#35823;&#12290;&#65289;</p>  <p><br> </p> <h2>&#26368;&#21518;&#30340;&#24605;&#32771;</h2> <p><br> </p> <p>&#22312;&#25105;&#21644; Matt  &#20889;&#23436;&#26368;&#21021;&#37027;&#31687;&#35770;&#25991;&#21518;&#30340;&#20960;&#24180;&#65292;&#25345;&#32493;&#38598;&#25104;&#24050;&#32463;&#25104;&#20026;&#20102;&#36719;&#20214;&#24320;&#21457;&#30340;&#19968;&#20010;&#20027;&#27969;&#26041;&#27861;&#12290;ThoughtWorks  &#30340;&#39033;&#30446;&#24456;&#23569;&#26377;&#19981;&#29992;&#21040;&#23427;&#30340;&#12290;&#25105;&#20204;&#20063;&#33021;&#30475;&#21040;&#19990;&#30028;&#21508;&#22320;&#30340;&#20154;&#20204;&#22312;&#29992;&#25345;&#32493;&#38598;&#25104;&#12290;&#19982;&#26497;&#38480;&#32534;&#31243;&#20013;&#19968;&#20123;&#20805;&#28385;&#20105;&#35758;&#30340;&#23454;&#36341;&#19981;&#21516;&#65292;&#25105;&#24456;&#23569;&#21548;&#21040;&#20851;&#20110;&#25345;&#32493;&#38598;&#25104;&#30340;&#36127;&#38754;&#28040;&#24687;&#12290; </p>  <p><br> </p> <p>&#22914;&#26524;&#20320;&#36824;&#27809;&#29992;&#25345;&#32493;&#38598;&#25104;&#65292;&#25105;&#24378;&#28872;&#24314;&#35758;&#20320;&#35797;&#19968;&#19979;&#12290;&#22914;&#26524;&#20320;&#24050;&#32463;&#22312;&#20570;&#20102;&#65292;&#21487;&#33021;&#36825;&#31687;&#25991;&#31456;&#20013;&#30340;&#26576;&#20123;&#26041;&#27861;&#21487;&#20197;&#24110;&#20320;&#24471;&#21040;&#26356;&#22909;&#30340;&#25928;&#26524;&#12290;&#36807; &#21435;&#20960;&#24180;&#20013;&#65292;&#25105;&#20204;&#24050;&#32463;&#20102;&#35299;&#20102;&#24456;&#22810;&#20851;&#20110;&#25345;&#32493;&#38598;&#25104;&#30340;&#30693;&#35782;&#65292;&#25105;&#24076;&#26395;&#36824;&#26377;&#26356;&#22810;&#30340;&#30693;&#35782;&#21487;&#20197;&#35753;&#25105;&#20204;&#23398;&#20064;&#21644;&#25552;&#39640;&#12290;</p> <p><br> </p> <h2>&#24310;&#20280;&#38405;&#35835;</h2>  <p><br> </p> <p>&#26412;&#25991;&#31687;&#24133;&#25152;&#38480;&#65292;&#21482;&#33021;&#35206;&#30422;&#37096;&#20998;&#20869;&#23481;&#12290;&#24819;&#20102;&#35299;&#25345;&#32493;&#38598;&#25104;&#30340;&#26356;&#22810;&#32454;&#33410;&#65292;&#25105;&#24314;&#35758;&#30475;&#19968;&#19979; Paul Duvall &#30340;<a href="http://martinfowler.com/books.html#duvall" target="_blank">&#20070;</a>&#65288;&#36825;&#26412;&#20070;&#24471;&#21040;&#20102;Jolt&#22823;&#22870;&#65289;&#12290;&#30446;&#21069;&#20026;&#27490;&#36824;&#27809;&#26377;&#22810;&#23569;&#20851;&#20110;&#20998;&#38454;&#27573;build&#30340;&#25991;&#31456;&#65292;&#20294;&#26377;&#19968;&#31687; Dave  Farley &#21457;&#34920;&#22312;<a href="http://www.pragprog.com/titles/twa/thoughtworks-anthology" target="_blank">&#12298;ThoughtWorks &#25991;&#36873;&#12299;</a>&#20013;&#30340;&#25991;&#31456;&#36824;&#19981;&#38169;&#65288;&#20320;&#20063;&#21487;&#20197;&#22312;<a href="http://studios.thoughtworks.com/assets/2007/5/11/The-Deployment-Pipeline-by-Dave-Farley-2007.pdf" target="_blank">&#36825;&#37324;</a>&#25214;&#21040;&#65289;&#12290;</p></div></body></html>